Repository: Frank1eJohnson/Uwajimaya
Catalog: Content/Localization/UwajimayaDialogues/*/UwajimayaDialogues.po
Languages: ro

# Dialogue_TLAdventurerGnome0
source: Look, I'm forced to stay in this realm so that I could do all these silly tasks for a wizard. Any chance you could help me with that? Please?
ro: Uite, sunt obligat să rămân pe tărâm, ca să pot face toate aceste sarcini stupide pentru un vrăjitor. Ai vreo șansă să mă ajuți cu asta? Te rog?

# Dialogue_TLAdventurerGnome0
source: Actually yes, I...
ro: De fapt da, Eu ...

# Dialogue_TLAdventurerGnome0
source: That's how these rusty monsters work like: you pull a few levers here and there, and... whoops, the door is open! It's called science!
ro: Așa funcționează acești monștri ruginiți: tragi câteva manete pe ici și pe colo și ... oops, ușa este deschisă! Se numește știință!

# Dialogue_TLAdventurerGnome0
source: I've got to go...
ro: Trebuie să plec...

# Dialogue_TLAdventurerGnome0
source: That's easy! Just pull every single lever you can find.
ro: Asta e ușor! Pur și simplu trage fiecare manetă pe care o găsești.

# Dialogue_TLAdventurerGnome0
source: Sounds like you met the GateKeeper!
ro: Se Pare că ai întâlnit Portarul!

# Dialogue_TLAdventurerGnome0
source: It was a rhetorical question. I am not old!
ro: A fost o întrebare retorică. Nu sunt bătrân!

# Dialogue_TLAdventurerGnome0
source: Not really, I don't feel like helping you out. And to be honest, I prefer to stay away from wizards. Sorry!
ro: Nu chiar, nu am chef să te ajut. Și să fiu sincer, prefer să stau departe de vrăjitori. Îmi pare rău!

# Dialogue_TLAdventurerGnome0
source: It's been nice meeting you.
ro: A fost frumos să te întâlnesc.

# Dialogue_TLAdventurerGnome0
source: Here, take this! I hope it's worth the trouble... hahaha... Thanks to you I can continue with my journey... after I read a few more pages, of course.
ro: Aici, ia asta! Sper să merite situația dificilă ... hahaha ... Mulțumită ție, pot continua cu călătoria mea ... după ce am citit încă câteva pagini, desigur.

# Dialogue_TLAdventurerGnome0
source: Is there anything a middle-aged crazy gnome scientist can do for you? Now, this one is not a rhetorical question!
ro: Există ceva ce un om pitic de știință nebun de vârstă mijlocie poate să facă pentru tine? Acum, aceasta nu este o întrebare retorică!

# Dialogue_TLAdventurerGnome0
source: I will give you one if you are kind enough to open this door for me! I am stuck on the other side, you see...
ro: Îți voi da unul dacă ești suficient de amabil să deschizi această ușă pentru mine! Sunt blocat de cealaltă parte, vezi ...

# Dialogue_TLAdventurerGnome0
source: No way!
ro: În nici un caz!

# Dialogue_TLAdventurerGnome0
source: Thanks and good luck!
ro: Mulțumesc și mult noroc!

# Dialogue_TLAdventurerGnome0
source: Getting help from a mad scientist? Thanks, but I would rather skip that!
ro: Obține ajutor de la un om de știință nebun? Mulțumesc, dar aș prefera să sar peste asta!

# Dialogue_TLAdventurerGnome0
source: I am crazy, therefore I am!
ro: Sunt nebun, de aceea sunt!

# Dialogue_TLAdventurerGnome0
source: You managed to open the gate! Well done!
ro: Ai reușit să deschizi poarta! Foarte bine!

# Dialogue_TLAdventurerGnome0
source: How unfortunate! And I thought that I was the idiot here. You will totally need my help... you'll see.
ro: Ce nefericire! Și am crezut că sunt idiotul aici. Vei avea nevoie total de ajutorul meu ... vei vedea.

# Dialogue_TLAdventurerGnome0
source: Some kind of golem sent me here to prove my worthiness... any idea how I could do that?
ro: Un fel de golem m-a trimis aici să îmi demonstrez demnitatea ... ai vreo idee cum aș putea face asta?

# Dialogue_TLAdventurerGnome0
source: Is there anything an old wise gnome scientist could do for you, I wonder?
ro: Există ceva ce un om de știință înțelept bătrân ar putea face pentru tine, mă întreb?

# Dialogue_TLAdventurerGnome0
source: Any idea how I could open this gate for you?
ro: Ai vreo idee despre cum aș putea deschide această poartă pentru tine?

# Dialogue_TLAdventurerGnome1
source: I've managed to get this obelisk thing. Do you know what it is?
ro: Am reușit să obțin chestia asta cu obeliscul. Știi ce e asta?

# Dialogue_TLAdventurerGnome1
source: I... I don't know. They are kinda predictable though...
ro: Eu ... nu stiu. Cu toate acestea, sunt cam previzibile ...

# Dialogue_TLAdventurerGnome1
source: Don't care about it and you'll live longer.
ro: Nu-ți pasă de asta și vei trăi mai mult.

# Dialogue_TLAdventurerGnome1
source: There is a floating magical thing right there...
ro: Există un lucru magic plutitor chiar acolo ...

# Dialogue_TLAdventurerGnome1
source: Isn't it weird that doors are always closed around these places?
ro: Nu este ciudat că ușile sunt întotdeauna închise în jurul acestor locuri?

# Dialogue_TLAdventurerGnome1
source: This is my research project! Looks totally garbage, but sometimes even I cannot understand my brilliance.
ro: Acesta este proiectul meu de cercetare! Arată complet gunoi, dar uneori nici măcar eu nu îmi pot înțelege strălucirea.

# Dialogue_TLAdventurerGnome1
source: Let him answer
ro: Lasă-l să răspundă

# Dialogue_TLAdventurerGnome1
source: I found the secret hideout of the Secret Science Society. Is there anything you could tell me about them?
ro: Am găsit ascunderea secretă a Societății de Științe Secrete. Ai putea să-mi spui ceva despre ei?

# Dialogue_TLAdventurerGnome1
source: I guess he will be happy if you return this to him, but otherwise it's garbage.
ro: Bănuiesc că va fi fericit dacă îi întorci asta, dar în caz contrar este gunoi.

# Dialogue_TLAdventurerGnome1
source: Really? Then maybe I should give you this: another bottle of Potion of Worthiness!
ro: Într-adevăr? Atunci poate că ar trebui să-ți ofer asta: încă o sticlă de poțiune demnă!

# Dialogue_TLAdventurerGnome1
source: I've got to go...
ro: Trebuie să plec...

# Dialogue_TLAdventurerGnome1
source: Secret Science Society
ro: Societatea de Științe Secrete

# Dialogue_TLAdventurerGnome1
source: I pulled a few levers here and there...
ro: Am tras câteva manete aici și acolo ...

# Dialogue_TLAdventurerGnome1
source: Yes, things like that happen here all the time. You'll get used to it.
ro: Da, așa ceva se întâmplă aici tot timpul. Te vei obișnui.

# Dialogue_TLAdventurerGnome1
source: Oh, really? That was nice, even if it was absolutely unnecessary! Never mind, here is your reward!
ro: Oh, chiar așa? Asta a fost frumos, chiar dacă a fost absolut inutil! Nu contează, iată răsplata ta!

# Dialogue_TLAdventurerGnome1
source: Hmm... One of the creaks was a bit odd. I think the door will open soon!
ro: Hmm ... Una dintre creste a fost un pic ciudată. Cred că ușa se va deschide în curând!

# Dialogue_TLAdventurerGnome1
source: The mind is furnished with ideas by a drunk upholsterer...
ro: Mintea este dotată cu idei de un tapițar beat ...

# Dialogue_TLAdventurerGnome1
source: Also, reading something represents such a nice way of killing time when I encounter a closed door!
ro: De asemenea, a citi ceva reprezintă un mod atât de frumos de a ucide timpul când întâlnesc o ușă închisă!

# Dialogue_TLAdventurerGnome1
source: How about a deal? Open this door and I will give you another bottle from my collection of Potions of Worthiness.
ro: Ce zici de o afacere? Deschide această ușă și îți voi oferi o altă sticlă din colecția mea de Poțiuni demne.

# Dialogue_TLAdventurerGnome1
source: Ask about the book
ro: Întreabă despre carte

# Dialogue_TLAdventurerGnome1
source: Floating obelisk
ro: Obeliscul plutitor

# Dialogue_TLAdventurerGnome1
source: We met before, right? Of course we did.
ro: Ne-am întâlnit înainte, nu? Desigur că am făcut-o.

# Dialogue_TLAdventurerGnome1
source: It might actually be total nonsense. That's what I am trying to find out at the moment, so I am reading it again and again and again...
ro: Ar putea fi de fapt o prostie totală. Asta încerc să aflu în acest moment, așa că o citesc din nou și din nou și din nou ...

# Dialogue_TLAdventurerGnome1
source: Leave
ro: Pleacă

# Dialogue_TLAdventurerGnome1
source: This is a Memory Crystal made by a really old looking man I've met long ago.
ro: Acesta este un cristal de memorie realizat de un bărbat bătrân pe care l-am cunoscut cu mult timp în urmă.

# Dialogue_TLAdventurerGnome1
source: No man's knowledge here can go beyond my experience!
ro: Nici o cunoaștere a omului nu poate trece dincolo de experiența mea!

# Dialogue_TLAdventurerGnome1
source: I sure can! They used to invent cool stuff back in the days, before... you know, everyone's mind decided to go a bit insane.
ro: Sunt sigur că pot! Au inventat lucruri frumoase în zilele trecute, înainte ... știți, mintea tuturor a decis să devină puțin nebună.

# Dialogue_TLAdventurerGnome1
source: I don’t know why we are here... maybe to enjoy ourselves?
ro: Nu știu de ce suntem aici ... poate să ne bucurăm?

# Dialogue_TLAdventurerGnome1
source: Another door
ro: O altă ușă

# Dialogue_TLAdventurerGnome1
source: On the other hand, everyone is crazy these days... so we don't need doors anymore!
ro: Pe de altă parte, toată lumea este nebună în aceste zile ... așa că nu mai avem nevoie de uși!

# Dialogue_TLAdventurerGnome1
source: To be perceived is to be!
ro: A fi perceput înseamnă a fi!

# Dialogue_TLAdventurerGnome1
source: I will let you know when I come up with something.
ro: Te voi anunța când voi veni cu ceva.

# Dialogue_TLAdventurerGnome1
source: Nah. The world is full of crazy people. If I were sane, I would have liked to have as many closed doors as possible between me and those weirdos.
ro: Nah. Lumea este plină de nebuni. Dacă aș fi sănătos, mi-ar fi plăcut să am cât mai multe uși închise între mine și acei ciudăți.

# Dialogue_TLAdventurerGnome1
source: The door asks for a password that members use to enter the hideout... any idea what that could be?
ro: Ușa cere o parolă pe care membrii o folosesc pentru a intra în ascunzătoare ... ai idee despre ce ar putea fi asta?

# Dialogue_TLAdventurerGnome1
source: I am here because I actually have to prove my worth again...
ro: Sunt aici pentru că de fapt trebuie să îmi dovedesc din nou valoarea ...

# Dialogue_TLAdventurerGnome1
source: And I would actually feel much happier if I were on the other side of the door! You know,... I tried to ask it nicely to open and it just ignored me!
ro: Și m-aș simți de fapt mult mai fericit dacă aș fi de cealaltă parte a ușii! Știi, ... Am încercat să-l rog frumos să se deschidă și pur și simplu m-a ignorat!

# Dialogue_TLAdventurerGnome1
source: What kind of book is that?
ro: Ce fel de carte este asta?

# Dialogue_TLAdventurerGnome1
source: It was nice seeing you...
ro: A fost frumos să te văd ...

# Dialogue_TLAdventurerGnome1
source: The gate is open! Maybe this creature has a heart after all... and probably started feeling sorry for me as well.
ro: Poarta este deschisă! Poate că această creatură are o inimă până la urmă ... și probabil a început să-i pară rău și pentru mine.

# Dialogue_TLAdventurerGnome1
source: Let me see! Yes... Oh...
ro: Stai să văd! Da ... Oh ...

# Dialogue_TLAdventurerGnome2
source: Also, after skipping a couple of lectures, I got fired from university.
ro: De asemenea, după ce am sărit câteva cursuri, am fost concediat de la universitate.

# Dialogue_TLAdventurerGnome2
source: I am a scientist! I managed to prove it! I discovered this when I was conducting my research on gnome behavior...
ro: Eu sunt un om de stiinta! Am reușit să-l dovedesc! Am descoperit acest lucru când am condus cercetările mele despre comportamentul piticilor ...

# Dialogue_TLAdventurerGnome2
source: Help me out with the door for the last time, and I will give you my last potion!
ro: Ajută-mă cu ușa pentru ultima oară și îți voi da ultima poțiune!

# Dialogue_TLAdventurerGnome2
source: Hello again! You remember me, right? I'm the gnome who was crazy before it was cool!
ro: Buna din nou! Îți aduci aminte de mine, nu? Sunt piticul care a fost nebun înainte de a fi mișto!

# Dialogue_TLAdventurerGnome2
source: Be as you with to seem. ... or was it seem as you wish to be?
ro: Fii ca tine să pari. ... sau o fost așa cum dorești să fii?

# Dialogue_TLAdventurerGnome2
source: That is amazing! Thank you, my globular friend! Take these coins, I am sure you will enjoy spending them on... on whatever Balls like you like to spend.
ro: Asta este incredibil! Mulțumesc, prietenul meu globular! Ia aceste monede, sunt sigur că îți va plăcea să le cheltuiești pe ... pe orice Mingi ca tine le place să cheltuiască.

# Dialogue_TLAdventurerGnome2
source: Password
ro: Parolă

# Dialogue_TLAdventurerGnome2
source: I sure can! They used to invent cool stuff back in the days, before... you know, everyone's mind decided to go a bit insane.
ro: Sunt sigur că pot! Au inventat lucruri frumoase în zilele trecute, înainte ... ști, mintea tuturor a decis să meargă puțin nebun.

# Dialogue_TLAdventurerGnome2
source: Leave
ro: Ieși

# Dialogue_TLAdventurerGnome2
source: Take this! You deserve it...
ro: Ia asta! O meriți...

# Dialogue_TLAdventurerGnome2
source: I can't believe my eyes! It is open!
ro: Nu-mi vine să cred ochii! Este deschis!

# Dialogue_TLAdventurerGnome2
source: It's your lucky day! Take this... it's my last bottle, but I guess your needs are greater than mine!
ro: Este ziua ta norocoasă! Ia asta ... este ultima mea sticlă, dar cred că nevoile tale sunt mai mari decât ale mele!

# Dialogue_TLAdventurerGnome2
source: The unexamined life is not worth living!
ro: Viața neexaminată nu merită traită!

# Dialogue_TLAdventurerGnome2
source: If you manage to find a strangely unique device in the hideout, I would be more than happy to buy that from you...
ro: Dacă reușești să găsești un dispozitiv ciudat unic în ascunzătoare, aș fi mai mult decât fericit să cumpăr asta de la tine ...

# Dialogue_TLAdventurerGnome2
source: And you have the habit of needing my potions..
ro: Și ai obiceiul să ai nevoie de poțiunile mele ..

# Dialogue_TLAdventurerGnome2
source: Yes, I am pretty sure this week is "The only true wisdom is in knowing you know everything.".
ro: Da, sunt destul de sigur că săptămâna aceasta este „Singura înțelepciune adevărată este să știi că știi totul”.

# Dialogue_TLAdventurerGnome2
source: I guess we are in the same boat - well, more or less... figuratively speaking, of course, because I can't really stand boats!
ro: Bănuiesc ca suntem in aceeași barca - bine, mai mult sau mai puțin ... la figurat vorbind, desigur, pentru ca nu prea pot suporta bărcile!

# Dialogue_TLAdventurerGnome2
source: Secret Science Society
ro: Societatea de Științe Secrete

# Dialogue_TLAdventurerGnome2
source: Why do you think that you're crazy?
ro: De ce crezi că ești nebun?

# Dialogue_TLAdventurerGnome2
source: It is always wrong to believe everything!
ro: Este întotdeauna greșit să crezi totul!

# Dialogue_TLAdventurerGnome2
source: Any luck with the password for the Secret Science Society door?
ro: Ai vreun noroc cu parola pentru ușa Societății de Știință Secrete?

# Dialogue_TLAdventurerGnome2
source: Give Weird Device
ro: Dă Dispozitiv Ciudat

# Dialogue_TLAdventurerGnome2
source: See you later...
ro: Ne vedem mai târziu...

# Dialogue_TLAdventurerGnome2
source: I also have the bad habit of being obstructed by closed doors!
ro: Am și prostul obicei de a fi obstrucționat de ușile închise!

# Dialogue_TLAdventurerGnome2
source: The door asks for a password that members need to provide in order to enter the hideout... any idea what that could be?
ro: Ușa cere o parolă pe care membrii trebuie să o furnizeze pentru a intra în ascunzătoare ... ai idee despre ce ar putea fi asta?

# Dialogue_TLAdventurerGnome2
source: No wonder everyone started to consider me an idiot.
ro: Nu este de mirare că toată lumea a început să mă considere un idiot.

# Dialogue_TLAdventurerGnome2
source: Long story short, I used to do all these crazy things, like talking about the weather or taking naps in the afternoon. At first, they seemed okay to me but in reality what I was doing was totally ridiculous!
ro: Să scurtez o poveste, obișnuiam să fac toate aceste lucruri nebunești, cum ar fi să vorbesc despre vreme sau să dorm după-amiaza. La început, mi s-au părut în regulă, dar în realitate ceea ce făceam era total ridicol!

# Dialogue_TLAdventurerGnome2
source: Hmm... One of the creaks was a bit odd. I think the door will open soon!
ro: Hmm ... Una dintre creste a fost un pic ciudată. Cred că ușa se va deschide în curând!

# Dialogue_TLAdventurerGnome2
source: It was nice seeing you!
ro: A fost frumos să te văd!

# Dialogue_TLAdventurerGnome2
source: You Crazy?
ro: Ești nebun?

# Dialogue_TLAdventurerGnome2
source: I found the secret hideout of the Secret Science Society. Do you know anything about them?
ro: Am găsit ascunderea secretă a Societății de Științe Secrete. Ști ceva despre ei?

# Dialogue_TLAdventurerGnome2
source: Turns out that you cannot skip lectures if you're the teacher.
ro: Se dovedește că nu poți sări cursurile dacă ești profesorul.

# Dialogue_TLAdventurerGnome2
source: Here is the Weird Device I found in the hideout of the Secret Science Society.
ro: Iată dispozitivul ciudat pe care l-am găsit în ascunderea Societății de Științe Secrete.

# Dialogue_TLSecretSocietyGate
source: Mellon
ro: Pepene

# Dialogue_TLSecretSocietyGate
source: The only...
ro: Singurul...

# Dialogue_TLSecretSocietyGate
source: *******? No, that is not correct.
ro: *******? Nu, nu este corect.

# Dialogue_TLSecretSocietyGate
source: Okay, whatever
ro: Bine, indiferent de

# Dialogue_TLSecretSocietyGate
source: Do you really think secret scientists would use an elven word as a password? I don't even know what that means.
ro: Chiar crezi că oamenii de știință secretoși ar folosi un cuvânt al elfilor ca parolă? Nici nu știu ce înseamnă asta.

# Dialogue_TLSecretSocietyGate
source: I am pretty sure that it is better to avoid the Secret Science Society anyways...
ro: Sunt destul de sigur că este mai bine să eviți societatea secretă a științei ...

# Dialogue_TLSecretSocietyGate
source: STOP! Do not move! This gate is only for the members of the Secret Science Society!
ro: STOP! Nu mișca! Această poartă este destinată doar membrilor Societății de Științe Secrete!

# Dialogue_TLSecretSocietyGate
source: That is the silliest combination I have ever heard about in my whole life! That's the kind of thing an idiot would carry in his luggage!
ro: Aceasta este cea mai neplăcută combinație despre care am auzit vreodată în toată viața mea! Acesta este genul de lucruri pe care le va purta un idiot în bagaje!

# Dialogue_TLSecretSocietyGate
source: Leave the gate
ro: Ieși prin poartă

# Dialogue_TLSecretSocietyGate
source: That password is for witch and wizard kids, not for old, wise, world renowned secret scientists!
ro: Acea parolă este destinată copiilor vrăjitori și vrăjitoare, nu pentru secrete vechi, și oameni de știință înțelepți de renume mondial!

# Dialogue_TLSecretSocietyGate
source: Try to gain some time
ro: Încercă să câștigi ceva timp

# Dialogue_TLSecretSocietyGate
source: I... I think I forgot... I have to remember it. I'll be back...
ro: Eu ... cred că am uitat ... trebuie să-mi amintesc. Mă voi întoarce...

# Dialogue_TLSecretSocietyGate
source: Let us go on with the standard protocol then. Tell me the password of the week.
ro: Să continuăm cu protocolul standard atunci. Spune-mi parola săptămânii.

# Dialogue_TLSecretSocietyGate
source: I am a member
ro: Sunt membru

# Dialogue_TLSecretSocietyGate
source: Are you a member? Prove it! What is the password of the week?
ro: Ești membru? Dovedește-o! Care este parola săptămânii?

# Dialogue_TLSecretSocietyGate
source: Correct. Welcome to the secret hideout 12345, scientist!
ro: Corect. Bine ai venit la asunzătoarea secretă 12345, om de știință!

# Dialogue_TLSecretSocietyGate
source: The only true wisdom is in knowing you know everything!
ro: Singura înțelepciune adevărată este să știi că știi totul!

# Dialogue_TombOfTabby
source: Take this. It's all I can give now.
ro: Ia asta. Este tot ce pot oferi acum.

# Dialogue_TombOfTabby
source: It was too much. I couldn’t keep on. I failed.
ro: Era prea mult. Nu am putut continua. Am eșuat.

# Dialogue_TombOfTabby
source: Leave
ro: Pleacă

# Dialogue_TombOfTabby
source: Raven
ro: Corb

# Dialogue_TombOfTabby
source: Tell me the name!
ro: Spune-mi numele!

# Dialogue_TombOfTabby
source: Here lies Tabby, wanderer of the Ruined Realm. We will never forget what you did for us. May your spirit find peace in the afterlife.
ro: Aici se află Tabby, rătăcitor al Tărâmului Ruinat. Nu vom uita niciodată ce ai făcut pentru noi. Fie ca spiritul tău să găsească pace în viața de apoi.

# Dialogue_TombOfTabby
source: He took the artefacts. His master never knew it.
ro: El a luat artefactele. Stăpânul său nu a știut-o niciodată.

# Dialogue_TombOfTabby
source: Wizard
ro: Vrăjitor

# Dialogue_TombOfTabby
source: I’m leaving... I didn’t want to bother you. May you find peace at last.
ro: Plec ... nu voiam să te deranjez. Îți doresc să găsești în sfârșit pacea.

# Dialogue_TombOfTabby
source: He liked Lillian. He finished what I started.
ro: Îi plăcea de Lillian. A terminat ce am început.

# Dialogue_TombOfTabby
source: Rest in peace!
ro: Odihnească-se în pace!

# Dialogue_TombOfTabby
source: I will be there on her side again when the time comes.
ro: Voi fi acolo din nou, când va veni vremea.

# Dialogue_TombOfTabby
source: She is my only true master. I can’t leave her. Zhongqi Shan.
ro: Ea este singurul meu stăpân adevărat. Nu o pot părăsi. Nu inca.

# Dialogue_TombOfTabby
source: Raven!
ro: Corb!

# Dialogue_TombOfTabby
source: He forced me. Though I understood. I wanted the same.
ro: El m-a forțat. Deși am înțeles. Voiam la fel.

# Dialogue_TombOfTabby
source: You are familiar... I almost remember...
ro: Ești familiar ... aproape îmi amintesc ...

# Dialogue_TombOfTabby
source: Wizard!
ro: Vrăjitor!

# Dialogue_tut2
source: I see you managed to shape that ball body of yours… that’s interesting.
ro: Văd că ai reușit să modelezi corpul tău de bilă ... este interesant.

# Dialogue_tut2
source: I didn’t want to summon you. I wanted to get my daughter back.
ro: Nu am vrut să te chem. Am vrut să-mi iau fiica înapoi.

# Dialogue_tut2
source: Your presence is not welcome here, demon!
ro: Prezența ta nu este binevenită aici, demon!

# Dialogue_tut5
source: Once you are done I will set you free.
ro: După ce ai terminat, te voi elibera.

# Dialogue_tut5
source: This is the deal demon...
ro: Acesta este înțelegerea demone...

# Dialogue_tut5
source: Get into the Heart of the Realm and find the three Artefacts! I need those to correct the summoning.
ro: Intră în Inima Tărâmului și găsește cele trei Artefacte! Am nevoie de ele să corecteze convocarea.

# Dialogue_tut8
source: A cat that used to help my daughter to explore these realms.
ro: O pisică a ajutat-o pe fiica mea să exploreze aceste tărâmuri.

# Dialogue_tut8
source: Who is Tabby?
ro: Cine este Tabby?

# Dialogue_tut8
source: Tabby was formidable with her claws, but you will need that sword.
ro: Tabby era formidabilă cu ghearele ei, dar vei avea nevoie de sabie.

# Dialogue_tut8
source: So he did the hard job before me...
ro: Așa că a făcut treaba grea înaintea mea ...

# Dialogue_tut9
source: What could be possibly weird for a walking ball?
ro: Ce ar putea fi ciudat pentru o minge care merge?

# Dialogue_tut9
source: This place is in a better shape...
ro: Acest loc este într-o stare mai bună ...

# Dialogue_tut9
source: The Ancient Magic is still strong within these walls. It keeps the Ruin at bay.
ro: Magia Antică este încă puternică în acești ziduri. Ține ruina departe.

# Dialogue_tut9
source: Be careful though... it can have the weirdest side effects.
ro: Fii atent totuși ... poate avea cele mai ciudate reacții adverse.
