Repository: Frank1eJohnson/Uwajimaya
Catalog: Content/Localization/UwajimayaDialogues/*/UwajimayaDialogues.po
Languages: ro

# Dialogue_C3MerchAnt
source: Show me what you've got for sale!
ro: Arată-mi ce ai de vânzare!

# Dialogue_C3MerchAnt
source: I’ve got to go.
ro: Trebuie să plec.

# Dialogue_C3MerchAnt
source: Ah, never mind, here you go!
ro: Ah, nu contează, iată!

# Dialogue_C3MerchAnt
source: Don’t be surprised!
ro: Nu fi surprins!

# Dialogue_C3MerchAnt
source: Aren’t two Gems enough for you?
ro: Nu sunt suficiente două bijuterii pentru tine?

# Dialogue_C3MerchAnt
source: Okey, okey! I have to admit I also do some regular ant work from time to time.
ro: Okey, okey! Trebuie să recunosc că fac și o muncă regulată de furnici din când în când.

# Dialogue_C3MerchAnt
source: Are you sure the key works?
ro: Ești sigur că funcționează cheia?

# Dialogue_C3MerchAnt
source: Was nice to deal with ya!
ro: A fost frumos să am de a face cu tine!

# Dialogue_C3MerchAnt
source: I've changed my mind. I'm fine with my current name.
ro: M-am răzgândit. Sunt bine cu numele meu actual.

# Dialogue_C3MerchAnt
source: Leave
ro: Pleacă

# Dialogue_C3MerchAnt
source: I did my part. Give me the key!
ro: Mi-am făcut partea. Dă-mi cheia!

# Dialogue_C3MerchAnt
source: Saviour
ro: Salvator

# Dialogue_C3MerchAnt
source: Blue Gem
ro: Bijuterie albastră

# Dialogue_C3MerchAnt
source: Due to my size!
ro: Datorită dimensiunii mele!

# Dialogue_C3MerchAnt
source: Can I buy a name from you?
ro: Pot cumpăra un nume de la tine?

# Dialogue_C3MerchAnt
source: Easy man! Here ya go!
ro: Ușor om! Iată-te!

# Dialogue_C3MerchAnt
source: Hey again!
ro: Bună din nou!

# Dialogue_C3MerchAnt
source: Come on man! You can't just wander around!
ro: Fii serios omule! Nu te poți doar plimba!

# Dialogue_C3MerchAnt
source: See ya man!
ro: Ne vedem omule!

# Dialogue_C3MerchAnt
source: Hey there!
ro: Bună!

# Dialogue_C3MerchAnt
source: I’m Merch Ant, I deal with microtransactions.
ro: Sunt o Furnică Negustor, mă ocup de microtransacții.

# Dialogue_C3MerchAnt
source: That's cool man. Though I wonder who will you save?
ro: Asta-i mișto omul . Deși mă întreb pe cine vei salva?

# Dialogue_C3Monk
source: Yet they could do nothing.
ro: Cu toate acestea, nu puteau face nimic.

# Dialogue_C3Monk
source: We can’t let everyone die here.
ro: Nu putem lăsa pe toți să moară aici.

# Dialogue_C3Monk
source: We’ll have time to find a cure.
ro: Vom avea timp să găsim un remediu.

# Dialogue_C3Monk
source: Prepare for your last travel in the Ruined Realm. Head to the north from where the wind is blowing!
ro: Pregătește-te pentru ultima ta călătorie pe tărâmul Ruinat. Îndreaptă-te spre nord de unde bate vântul!

# Dialogue_C3Monk
source: Can't leave them
ro: Nu îi pot părăsi

# Dialogue_C3Monk
source: I wish you better luck this time!
ro: Îțî doresc mult mai mult noroc de data asta!

# Dialogue_C3Monk
source: Not my problem
ro: Nu este problema mea

# Dialogue_C3Monk
source: There is nothing we can do for this World.
ro: Nu putem face nimic pentru această lume.

# Dialogue_C3Monk
source: Farewell!
ro: Rămas bun!

# Dialogue_C3Monk
source: I’m ready to sacrifice myself but I feel sorrow for this world.
ro: Sunt gata să mă sacrific, dar simt întristare pentru această lume.

# Dialogue_C3Monk
source: Back already?
ro: Înapoi deja?

# Dialogue_C3Monk
source: Yet, we need to save those we can.
ro: Cu toate acestea, trebuie să îi salvăm pe cei pe care îi putem.

# Dialogue_C3Monk
source: Farewell Wanderer!
ro: Adio Hoinarule!

# Dialogue_C3Monk
source: Head to the north from where the wind is blowing!
ro: Îndreaptă-te spre nord de unde bate vântul!

# Dialogue_C3Monk
source: I will go home and you will solve your problems on your own.
ro: Voi merge acasă și îți vei rezolva singur problemele.

# Dialogue_C3Monk
source: This is none of my business.
ro: Nu este treaba mea.

# Dialogue_C3Monk
source: Leave
ro: Pleacă

# Dialogue_C3Monk
source: You? You mean the Wizard Council?
ro: Tu? Vrei să spui Consiliul Vrăjitorilor?

# Dialogue_C3Monk
source: I’m sorry it ends like this, Wanderer.
ro: Îmi pare rău că se termină așa, Rătăcitorule.

# Dialogue_C3Monk
source: I’m really proud of you little spirit. This wasn’t an easy decision for me either.
ro: Chiar sunt mândru de tine micule spirit. Nici aceasta nu a fost o decizie ușoară pentru mine.

# Dialogue_C3Monk
source: Wizard can’t hear us here, we can talk freely.
ro: Vrăjitorul nu ne poate auzi aici, putem vorbi liber.

# Dialogue_C3Monk
source: Do you know what you are risking?
ro: Ști ce riști?

# Dialogue_C3Monk
source: From here I can teleport you close to the place where the Wizard will be able to get you out.
ro: De aici te pot teleporta aproape de locul în care Vrăjitorul te va putea scoate.

# Dialogue_C3Monk
source: So many great things will perish. So many...
ro: Atâtea lucruri grozave vor pieri. Așa de mult...

# Dialogue_C3Monk
source: Take your time!
ro: Nu te grăbi!

# Dialogue_C3Monk
source: Let me try again!
ro: Lasă-mă să mai încerc o dată!

# Dialogue_C3Monk
source: What chance do the humans have?
ro: Ce șanse au oamenii?

# Dialogue_C3Monk
source: I just need some rest.
ro: Am nevoie doar de odihnă.

# Dialogue_C3Monk
source: Retry
ro: Reîncercă

# Dialogue_C3Monk
source: This one was enough.
ro: Acesta a fost suficient.

# Dialogue_C3Monk
source: Let’s get them out first and face Ruin after.
ro: Să le scoatem mai întâi și să ne confruntăm cu Ruina după.

# Dialogue_C3Monk
source: How can I get to the Wizard’s tower?
ro: Cum pot ajunge la turnul Vrăjitorului?

# Dialogue_C3Monk
source: Raven’s plan
ro: Planul Corbului

# Dialogue_C3Monk
source: Separate Worlds
ro: Lumile Separate

# Dialogue_C3Monk
source: When Ruin started in the Runic Realm they had hundreds of Scientists who studied the force which made Ruin.
ro: Când Ruina a început pe Tărâmul Runic, au avut sute de oameni de știință care au studiat forța care a făcut Ruina.

# Dialogue_C3Monk
source: I just can’t leave them to die here...
ro: Nu pot să-i las să moară aici ...

# Dialogue_C3Monk
source: This is the end of the path where we last meet.
ro: Acesta este sfârșitul căii pe care ne-am întâlnit ultima dată.

# Dialogue_C3Monk
source: You are right. The only way to stop Ruin is to lock the Ruined Realm forever.
ro: Ai dreptate. Singura modalitate de a opri Ruina este să blochezi Tărâmul Ruinat pentru totdeauna.

# Dialogue_C3Monk
source: Have you made your decision?
ro: Ți-ai luat decizia?

# Dialogue_C3Monk
source: If you bring infected people into the Human Realm Ruin will consume them.
ro: Dacă aduci oameni infectați pe Tărâmul Uman, Ruina îi va consuma.

# Dialogue_C3Monk
source: It’s your decision, Wanderer. I understand.
ro: E decizia ta, Rătăcitorule. Înțeleg.

# Dialogue_C3Monk
source: I’ll stay here. I won’t be able to watch another World dying...
ro: Voi rămâne aici. Nu voi putea viziona o altă lume murind ...

# Dialogue_C3Monk
source: Hello, little Wanderer!
ro: Bună ziua, micule Rătăcitor!

# Dialogue_C3Monk
source: You are right
ro: Ai dreptate

# Dialogue_C3Monk
source: I’ll take you to the place where you can leave this Realm.
ro: Te voi duce în locul unde poți părăsi acest Tărâm.

# Dialogue_C3Raven1
source: I know you have summoned a Spirit of the Unknown world. You were a fool to think you can get away with this.
ro: Știu că ai chemat un Duh al lumii Necunoscute. Ai fost un prost să crezi că poți scăpa de asta.

# Dialogue_C3Raven1
source: Argh! All right, here you go...
ro: Argh! Bine, aici te duci ...

# Dialogue_C3Raven1
source: Krrr... Raven gives you magic which will make you fly like a Raven.
ro: Krrr ... Corbul îți oferă magie, care te face să zbori ca un corb.

# Dialogue_C3Raven1
source: Come on, go and try it!
ro: Hai, du-te și încearcă!

# Dialogue_C3Raven1
source: How?
ro: Cum?

# Dialogue_C3Raven1
source: Call your master little spirit, I have words with him.
ro: Cheamă-ți stăpânul duhule cel mic, am ceva de spus lui.

# Dialogue_C3Raven1
source: I don’t know about any rule forbidding that...
ro: Nu știu nicio regulă care să interzică asta ...

# Dialogue_C3Raven1
source: Wait Scholar! Please give me a few more days!
ro: Așteaptă Savantule! Te rog să-mi dai încă câteva zile!

# Dialogue_C3Raven1
source: Why should I ask that?
ro: De ce ar trebui să întreb asta?

# Dialogue_C3Raven1
source: I have no doubt how the Council will react.
ro: Pentru că ți-ar plăcea să știi cum poți ieși de aici.

# Dialogue_C3Raven1
source: Because you would love to know how you can get out of here.
ro: Pentru că ți-ar plăcea să știi cum poți ieși de aici.

# Dialogue_C3Raven1
source: Don’t worry! I know your daughter is trapped in the Unknown and my research confirms there is a chance you can bring her back. I’ll help you bring the missing artefacts back.
ro: Nu îți face griji! Știu că fiica ta este prinsă în Necunoscut și cercetările mele confirmă că există șansa că o poți aduce înapoi. Te voi ajuta să readuci artefactele lipsă.

# Dialogue_C3Raven1
source: What do you want?
ro: Ce vrei?

# Dialogue_C3Raven1
source: What?
ro: Ce?

# Dialogue_C3Raven1
source: Er... thanks!
ro: E ... mulțumesc!

# Dialogue_C3Raven1
source: How will we get out of here?
ro: Cum vom ieși de aici?

# Dialogue_C3Raven1
source: Rule? What rule should be needed for something which was thought to be impossible?
ro: Regulă? Ce regulă trebuie să fie necesară pentru ceva despre care se credea imposibil?

# Dialogue_C3Raven1
source: Why?
ro: De ce?

# Dialogue_C3Raven1
source: Ask how we will get out of here!
ro: Întrebă cum vom ieși de aici!

# Dialogue_C3Raven1
source: Actually it’s not that good but still better than nothing.
ro: De fapt, nu este chiar atât de bun, dar mai bun decât nimic.

# Dialogue_C3Raven1
source: Take this!
ro: Ia asta!

# Dialogue_C3Raven1
source: Finally, Raven found you!
ro: În cele din urmă, Corbul te-a găsit!

# Dialogue_C3Raven1
source: Raven and his fellow Ball on a quest again!
ro: Corbul și colegul său Minge din nou într-o Misiune!

# Dialogue_C3Raven1
source: Let the masters talk in private and discuss how we will get out of here!
ro: Lăsați stăpânii să vorbească în privat și să discute despre cum vom ieși de aici!

# Dialogue_C3Raven2
source: You’ll be all dead
ro: Veți fi toți morți

# Dialogue_C3Raven2
source: Save them!
ro: Salvează-i!

# Dialogue_C3Raven2
source: Leave
ro: Pleacă

# Dialogue_C3Raven2
source: Rumours have been spread of Ruin and the people are scared. They demand the Wizard Council to separate the Human Realm from the Ruined Realm.
ro: S-au răspândit zvonuri despre ruină și oamenii sunt speriați. Aceștia solicită Consiliului Vrăjitorilor să separe Regatul Uman de Tărâmul Ruinat.

# Dialogue_C3Raven2
source: Good luck, Raven!
ro: Noroc, Corbule!

# Dialogue_C3Raven2
source: Only a fool would bring Ruin to his own World.
ro: Doar un prost ar aduce Ruina în propria sa lume.

# Dialogue_C3Raven2
source: Krrrr! Raven and you make a really good team.
ro: Krrrr! Corbul și tu faci o echipă foarte bună.

# Dialogue_C3Raven2
source: You bring back the artefacts to rescue Lillian.
ro: Îi aduci înapoi artefactele pentru salvarea lui Lillian.

# Dialogue_C3Raven2
source: Break in?
ro: Spargere?

# Dialogue_C3Raven2
source: You are right
ro: Ai dreptate

# Dialogue_C3Raven2
source: What it will do?
ro: Ce va face?

# Dialogue_C3Raven2
source: You are trying to rescue a bunch of mad people so that they can live a few more years with the cost of destroying one more Realm.
ro: Încerci să sălvezi o mulțime de oameni nebuni, astfel încât să poată trăi câțiva ani în plus, cu costul distrugerii unui alt Tărâm.

# Dialogue_C3Raven2
source: What happened in the Human Realm?
ro: Ce s-a întâmplat pe Tărâmul Uman?

# Dialogue_C3Raven2
source: What will you do? What’s your part in this?
ro: Ce vei face? Care este partea ta în asta?

# Dialogue_C3Raven2
source: Things are changing in the Human Realm and Raven has many things to do.
ro: Lucrurile se schimbă pe Tărâmul Uman și Corbul are multe lucruri de făcut.

# Dialogue_C3Raven2
source: You are right. We need to save them. What’s the plan?
ro: Ai dreptate. Trebuie să-i salvăm. Care-i planul?

# Dialogue_C3Raven2
source: Is that safe?
ro: Este sigur?

# Dialogue_C3Raven2
source: Agree
ro: De Acord

# Dialogue_C3Raven2
source: Soon the Ruined Realm will be over. We cannot save it.
ro: În curând, tărâmul ruinat se va termina. Nu îl putem salva.

# Dialogue_C3Raven2
source: Wizard won’t activate the device for them but some of them are fools enough to try it anyway.
ro: Vrăjitorul nu vor activa dispozitivul pentru ei, dar unii dintre ei sunt suficient de proști pentru a-l încerca oricum.

# Dialogue_C3Raven2
source: So, what now?
ro: Deci, ce acum?

# Dialogue_C3Raven2
source: With every day more and more people join their ranks.
ro: Cu fiecare zi din ce în ce mai mulți oameni se alătură rândurilor lor.

# Dialogue_C3Raven2
source: Farewell, compeer!
ro: Adio, tovarășe!

# Dialogue_C3Raven2
source: Or maybe you are wrong.
ro: Sau poate te înșeli.

# Dialogue_C3Raven2
source: What happened?
ro: Ce s-a întâmplat?

# Dialogue_C3Raven2
source: Raven will gather as many survivors as Raven can.
ro: Corbul va aduna cât mai mulți supraviețuitori.

# Dialogue_C3Raven2
source: Farewell compeer! Raven will be on a quest on Raven’s own!
ro: Adio tovarășe! Corbul va participa la o căutare al Corbului!

# Dialogue_C3Raven2
source: What happens if they break in?
ro: Ce se întâmplă dacă intră înăuntru?

# Dialogue_C3Raven2
source: Disagree
ro: Nu sunt de acord

# Dialogue_C3Raven2
source: Nothing good...
ro: Nimic bun...

# Dialogue_C3Raven2
source: Farewell!
ro: Rămas bun!

# Dialogue_C3Raven2
source: Except when you kill me with a laser beam.
ro: Cu excepția cazului în care mă omori cu un fascicul laser.

# Dialogue_C3Raven2
source: Farewell compeer until you meet Raven again!
ro: Adio tovarăș până când ne vei întâlni Corbul din nou!

# Dialogue_C3Raven2
source: Somehow they know about the device the Wizard created. They surrounded the Wizard’s tower. Some even tried to break in.
ro: Cumva știu despre dispozitivul creat de Vrăjitorul. Au înconjurat turnul Vrăjitorului. Unii chiar au încercat să intre.

# Dialogue_C3Raven2
source: Krrr! For them it’s much safer than staying here when the World is over.
ro: Krrr! Pentru ei este mult mai sigur decât să stai aici când lumea se va termina.

# Dialogue_C3Raven2
source: We have really short time to act.
ro: Avem într-adevăr scurt timp pentru a acționa.

# Dialogue_C3Raven2
source: There are hundreds of survivors. Races that don’t even exist anywhere else! Who are we if we don’t even try to save them?
ro: Există sute de supraviețuitori. Rase care nici nu există nicăieri în altă parte! Cine suntem dacă nici nu încercăm să le salvăm?

# Dialogue_C3Raven2
source: Except...
ro: Cu excepția...

# Dialogue_C3Raven2
source: You sound like that Monk, don’t you? Maybe you are right.
ro: Suni ca Călugărul acela, nu-i așa? Poate ai dreptate.

# Dialogue_C3Raven2
source: No problem.
ro: Nici o problemă.

# Dialogue_C3Raven2
source: Raven’s master decided we need to gather every survivor and take them into the Human Realm.
ro: Stăpânul Corbului a decis că trebuie să adunăm fiecare supraviețuitor și să-i ducem pe Tărâmul Uman.

# Dialogue_C3Raven2
source: To act?
ro: A acționa?

# Dialogue_C3Raven2
source: Farewell then!
ro: Adio, atunci!

# Dialogue_C3Raven2
source: You need to go on alone.
ro: Trebuie să continui singur.

# Dialogue_C3Raven2
source: If all goes well you will meet Raven on the other side.
ro: Dacă totul merge bine, vei întâlni pe Corb pe partea cealaltă.

# Dialogue_C3Raven2
source: Yes, we did well. Thanks for the help!
ro: Da, ne-am descurcat bine. Mulțumesc pentru ajutor!

# Dialogue_C3SewerCreature
source: Fear not, everything will be alright!
ro: Nu te teme, totul va fi în regulă!

# Dialogue_C3Statue
source: Are you ready?
ro: Ești liber?

# Dialogue_C3Statue
source: Will you release me once I get into your tower?
ro: Mă vei elibera odată ce voi intra în turnul tău?

# Dialogue_C3Statue
source: Ready
ro: Gata

# Dialogue_C3Statue
source: Hurry! We don’t have much time.
ro: Grabă! Nu avem mult timp.

# Dialogue_C3Statue
source: Sure, we made a deal.
ro: Sigur, am făcut o afacere.

# Dialogue_C3Statue
source: Zhongqi Shan. I’ll be back...
ro: Nu încă. Mă voi întoarce...

# Dialogue_C3Statue
source: Well done! From here I can take you to my tower.
ro: Foarte bine! De aici te pot duce în turnul meu.

# Dialogue_C3Statue
source: Stay
ro: Stai

# Dialogue_C3Statue
source: Let’s go then!
ro: Hai sa mergem, atunci!

# Dialogue_C3SupperDwarf
source: Otherwise I would rather stay here.
ro: Altfel aș prefera să rămân aici.

# Dialogue_C3SupperDwarf
source: I hope there is some delicious food in the Human Realm.
ro: Sper să existe mâncare delicioasă pe Tărâmul Uman.

# Dialogue_C3Teachy
source: Don’t say it, I know. I’m genius.
ro: Nu o spune, știu. Sunt un geniu.

# Dialogue_C3Teachy
source: He asked me to prove that I am worthy.
ro: El mi-a cerut să demonstrez că sunt demn.

# Dialogue_C3Teachy
source: Oh, the walking ball again!
ro: Oh, mingea care merge!

# Dialogue_C3Teachy
source: I haven’t seen you since you left me there with that Keeper.
ro: Nu te-am văzut de când m-ai lăsat acolo cu acel Portar.

# Dialogue_C3Teachy
source: I'm not sure if it still matters but here is the Weird Device I found in the hideout of the Secret Science Society.
ro: Nu sunt sigur dacă mai contează, dar iată dispozitivul ciudat pe care l-am găsit în ascunzătorul Societății de Științe Secrete.

# Dialogue_C3Teachy
source: After reordering the right side I got the final result: TEACHY = WORTHY
ro: După reordonarea părții drepte am obținut rezultatul final: PROFESOR = DEMN

# Dialogue_C3Teachy
source: That is amazing! Thank you, my globular friend! Take these coins, I am sure you will enjoy spending them... if you still can.
ro: Asta este incredibil! Mulțumesc, prietenul meu globular! Ia aceste monede, sunt sigur că îți va plăcea să le cheltuiești ... dacă mai poți.

# Dialogue_C3Teachy
source: Well, alright, I’ll tell.
ro: Ei bine, bine, voi spune.

# Dialogue_C3Teachy
source: I made some cups of tea and slowly put them in a row. From that I had this formula: TIME = T CUP = C TEA * C = ROW * T
ro: Am făcut câteva căni de ceai și le-am pus încet pe rând. Din aceasta am avut această formulă: TIMP = T CANĂ = C CEAI * C = RÂND * T

# Dialogue_C3Teachy
source: Then I multiplied by HY, so I get: TEACHY = ROWTHY
ro: Apoi am înmulțit cu HY, așa că obțin: DIDACTIC = EDMN

# Dialogue_DCDictionary
source: Finally! A dictionary!
ro: În cele din urmă! Un dicționar!

# Dialogue_DCDictionary
source: Wake me up when you are ready.
ro: Trezește-mă când ești gata.

# Dialogue_DCSecretDoor
source: There is a hidden Dwarven Door somewhere around here.
ro: Ușa Piticilor undeva pe aicea.

# Dialogue_DCSecretDoor
source: Or if you toggle that switch.
ro: Sau dacă comutați comutatorul.

# Dialogue_DCSecretDoor
source: This one can only be revealed on Christmas time if the full moon shines on it.
ro: Acesta poate fi dezvăluit doar în perioada Crăciunului, dacă luna plină strălucește pe ea.

# Dialogue_DCSecretDoor
source: Dwarfs are fond of these. They can't be seen if you don't know their trick.
ro: Piticii sunt pasionați de acestea. Nu pot fi văzuți dacă nu le cunoști trucul.

# Dialogue_DemonLillian
source: Who you just killed...
ro: Pe cine tocmai l-ai ucis ...

# Dialogue_DemonLillian
source: I'm free without any bounds! I'm human!
ro: Sunt liber, fără limite! Sunt om!

# Dialogue_DemonLillian
source: You liar! I'm the daughter of the Wizard!
ro: Mincinosule! Sunt fiica Vrăjitorului!

# Dialogue_DemonLillian
source: Sister? What makes you say that?
ro: Sora? Ce te face să spui asta?

# Dialogue_DemonLillian
source: Siblings? What makes you say that?
ro: Frații? Ce te face să spui asta?

# Dialogue_DemonLillian
source: Just passing
ro: Doar trecând

# Dialogue_DemonLillian
source: What are you doing here little toy?
ro: Ce faci aici jucărie mică?

# Dialogue_DemonLillian
source: You are nonsense.
ro: Ești prostie.

# Dialogue_DemonLillian
source: You are a Spirit of the Unknown bound to this body by magic. Just like me.
ro: Ești un Duh al Necunoscutului legat de acest corp prin magie. Ca și mine.

# Dialogue_DemonLillian
source: I'm just err... maybe we could play seek and hide?
ro: Doar greșesc ... poate ne-am putea juca ae-a v-ați ascunselea?

# Dialogue_DemonLillian
source: I'll stop you!
ro: Te voi opri!

# Dialogue_DemonLillian
source: Shaped like a human...
ro: În formă de om ...

# Dialogue_DemonLillian
source: We are siblings right? You will surely let me pass...
ro: Suntem frați, nu? Cu siguranță mă vei lăsa să trec ...

# Dialogue_DemonLillian
source: That sounds funny!
ro: Sună amuzant!

# Dialogue_DemonLillian
source: I'm power, I'm god!
ro: Sunt putere, sunt dumnezeu!

# Dialogue_DemonLillian
source: I've found you!
ro: Te-am găsit!

# Dialogue_DemonLillian
source: I've come to stop you sister. The World is not your playground!
ro: Am venit să te opresc sora. Lumea nu este locul tău de joacă!

# Dialogue_DemonLillian
source: I'm bored! Have you come to play with me?
ro: Sunt plictisită! Ai venit să te joci cu mine?

# Dialogue_DemonLillian
source: I can create, I can destroy!
ro: Pot crea, pot distruge!

# Dialogue_DemonLillianDefeated
source: What are you doing? Keep your hands away from me!
ro: Ce faci? Ține-ți mâinile departe de mine!

# Dialogue_DemonLillianDefeated
source: I don't want to play anymore!
ro: Nu mai vreau să mă mai joc!

# Dialogue_DemonLillianDefeated
source: Farewell Spirit!
ro: Adio Duh!

# Dialogue_DemonLillianDefeated
source: Leave me alone!
ro: Lasa-mă in pace!

# Dialogue_DemonLillianDefeated
source: I am his daughter. And this body is mine.
ro: Eu sunt fiica lui. Și acest corp este al meu.

# Dialogue_DemonLillianDefeated
source: I know this body...
ro: Cunosc acest corp ...

# Dialogue_DemonLillianDefeated
source: Away!
ro: Departe!

# Dialogue_DemonLillianDefeated
source: They were wrong all along.
ro: Au greșit tot timpul.

# Dialogue_DlgGolemMaker
source: Thank you! Take this as reward.
ro: Mulțumesc! Luați acest lucru ca recompensă.

# Dialogue_DlgGolemMaker
source: Look what I have found for you!
ro: Uite ce am găsit pentru tine!

# Dialogue_DlgGolemMaker
source: They are somewhere around.
ro: Sunt undeva prin preajmă.

# Dialogue_DlgGolemMaker
source: They fight Ruin
ro: Ei luptă cu Ruina

# Dialogue_DlgGolemMaker
source: Golems destroyed
ro: Golemi distruși

# Dialogue_DlgGolemMaker
source: Even if he couldn't be what I wanted him to be, he was my greatest creation ever.
ro: Chiar dacă nu putea fi ceea ce voiam să fie el, el a fost cea mai mare creație a mea vreodată.

# Dialogue_DlgGolemMaker
source: Could you merge these copper pieces?
ro: Ai putea îmbina aceste bucăți de cupru?

# Dialogue_DlgGolemMaker
source: Don't know
ro: Nu stiu

# Dialogue_DlgGolemMaker
source: Be aware of the Armour Wrath.
ro: Fi conștient de Mânia Armurii.

# Dialogue_DlgGolemMaker
source: Could you merge these bronze pieces?
ro: Ai putea îmbina aceste piese de bronz?

# Dialogue_DlgGolemMaker
source: You are not one of my new creations. Yet not one of the ancients.
ro: Nu ești una dintre noile mele creații. Cu toate acestea, nici unul dintre antici.

# Dialogue_DlgGolemMaker
source: Take care!
ro: Ai grijă!

# Dialogue_DlgGolemMaker
source: Nothing else matters.
ro: Altceva nu contează.

# Dialogue_DlgGolemMaker
source: Too many spirits. They break loose. They couldn’t exist in our Realm. They formed Ruin.
ro: Prea multe spirite. Se desfac. Ei nu ar putea exista pe tărâmul nostru. Au format Ruina.

# Dialogue_DlgGolemMaker
source: Oh, thank you! It also gives back some of my lost knowledge.
ro: Oh, multumesc! De asemenea, îmi dă înapoi o parte din cunoștințele mele pierdute.
