Repository: Frank1eJohnson/Uwajimaya
Catalog: Content/Localization/UwajimayaDialogues/*/UwajimayaDialogues.po
Languages: ro

# Dialogue_Wizard
source: Please wait outside until I repeat the spell. Once Lillian is back, I’ll take you home.
ro: Te rog să așteptați afară până repet repetarea vrăji. După ce Lillian se va întoarce, te voi duce acasă.

# Dialogue_Wizard
source: Er... your room is still as untidy as last time, but no problem.
ro: E ... camera ta este încă la fel de neplăcută ca data trecută, dar nici o problemă.

# Dialogue_Wizard
source: I’m sorry we met like this.
ro: Îmi pare rău că ne-am întâlnit așa.

# Dialogue_Wizard
source: Yes... and thank you!
ro: Da ... și mulțumesc!

# Dialogue_Wizard
source: Here are your artefacts! I made my part of the deal.
ro: Iată artefactele tale! Mi-am făcut partea din afacere.

# Dialogue_Wizard
source: Yes, we made a deal!
ro: Da, am făcut o afacere!

# Dialogue_Wizard
source: Give me a few more minutes to finish what we started!
ro: Mai dă-mi câteva minute pentru a termina ceea ce am început!

# Dialogue_Wizard
source: Will you release me?
ro: Mă vei elibera?

# Dialogue_Wizard
source: Er... excuse me for being rude with you. I might have misjudged you. And, anyway...
ro: Scuză-mă că sunt nepoliticos cu tine. Poate te-am judecat greșit. Și oricum...

# Dialogue_Wizard_AfterMonk
source: What did he say?
ro: Ce a spus el?

# Dialogue_Wizard_AfterMonk
source: Nothing...
ro: Nimic...

# Dialogue_Wizard_Artefact1
source: Well done. Now we have the first artefact. There are only two left...
ro: Foarte bine. Acum avem primul artefact. Au mai rămas doar două ...

# Dialogue_Wizard_Artefact1
source: Don’t tell me I will need to kill another two of these!
ro: Nu-mi spune că va trebui să ucid alte două dintre acestea!

# Dialogue_Wizard_Artefact2
source: We are close! Only one artefact is missing.
ro: Suntem aproape! Doar un singur artefact lipsește.

# Dialogue_Wizard_Artefact2
source: What I miss is a comfortable apartment somewhere safe...
ro: Ceea ce îmi lipsește este un apartament confortabil undeva în siguranță ...

# Dialogue_Wizard_Artefact3
source: What? Can’t you just... oh, forget it!
ro: Ce? Nu poți doar ... oh, uită!

# Dialogue_Wizard_Artefact3
source: Yes, I’ve done what you asked. Now it’s your turn. Set me free!
ro: Da, am făcut ceea ce ai cerut. Acum e rândul tău. Eliberează-mă!

# Dialogue_Wizard_Artefact3
source: I have to admit I’m impressed. You found all the three artefacts.
ro: Trebuie să recunosc că sunt impresionat. Ai găsit toate cele trei artefacte.

# Dialogue_Wizard_Artefact3
source: All right demon. Use the railways to travel to World’s End. That’s where I can bring you back.
ro: Bine demon. Folosește căile ferate pentru a călători la Sfârșitul Lumii. Acolo te pot aduce înapoi.

# Dialogue_Workshop
source: Still nothing, but nobody said anything about any visible change at this point, right?
ro: Încă nimic, dar nimeni nu a spus nimic despre vreo schimbare vizibilă în acest moment, nu?

# Dialogue_Workshop
source: Craft Ghost Abacus
ro: Creează Abacul Fantomă

# Dialogue_Workshop
source: You have a glowing hammer. What's next?
ro: Ai un ciocan strălucitor. Ce urmează?

# Dialogue_Workshop
source: Say a different color
ro: Spune o altă culoare

# Dialogue_Workshop
source: Gnome magic at its best. Did you do everything the way it was supposed to be done? You should find out soon... maybe.
ro: Magia piticilor în acțiune. Ai făcut totul așa cum trebuia făcut? Ar trebui să afli în curând ... poate.

# Dialogue_Workshop
source: With the proper instructions and materials you could definitely create something valuable here.
ro: Cu instrucțiunile și materialele adecvate, poți crea cu siguranță ceva valoros aici.

# Dialogue_Workshop
source: The object is coagulated into a single Surrected object!
ro: Obiectul este coagulat într-un singur obiect resuscitat!

# Dialogue_Workshop
source: Break the abacus into pieces
ro: Rupe abacul în bucăți

# Dialogue_Workshop
source: The abacus does not show any emotion.
ro: Abacul nu arată nicio emoție.

# Dialogue_Workshop
source: Croon "La La LaLaLa LaLaLa"
ro: Fredonează "La LaLa LaLaLa LaLaLa"

# Dialogue_Workshop
source: Give up for now
ro: Renunță deocamdată

# Dialogue_Workshop
source: Poor Abacus. It is broken into pieces now.
ro: Săracul Abacus. Acum este rupt în bucăți.

# Dialogue_Workshop
source: You have the Abacus and the Ghost Flower Petals in front of you. The workshop has all the tools you need. How do you proceed?
ro: Ai în față abacul și petalele de flori fantome. Atelierul are toate instrumentele de care ai nevoie. Cum procedezi?

# Dialogue_Workshop
source: Leave
ro: Pleacă

# Dialogue_Workshop
source: Croon "La LaLa LaLaLa LaLaLa"
ro: Fredonează "La LaLa LaLaLa LaLaLa"

# Dialogue_Workshop
source: Say "Sorry my <object name>!"
ro: Spune „Îmi pare rău <nume obiect>!"

# Dialogue_Workshop
source: Say "Brown"
ro: Spune „Maro”

# Dialogue_Workshop
source: Say "Blue"
ro: Spune „Albastru”

# Dialogue_Workshop
source: Cover the Abacus with Petals
ro: Acoperă Abacusul cu petale

# Dialogue_Workshop
source: Maybe the abacus is a bit more ghosty now... or is it just you getting tired of trying?
ro: Poate că abacul este ceva mai fantomatic acum ... sau doar te-ai săturat să încerci?

# Dialogue_Workshop
source: Your last action did not lead to any visible change. What is your next move?
ro: Ultima ta acțiune nu a dus la nicio schimbare vizibilă. Care este următoarea mișcare?

# Dialogue_Workshop
source: Heat a hammer
ro: Încălzește un ciocan

# Dialogue_Workshop
source: Say "Sorry my Abacus!"
ro: Spune „Îmi pare rău Abacusul meu!”

# Dialogue_Workshop
source: The Abacus is covered with the Petals of the Ghost Flower.
ro: Abacul este acoperit cu petalele florii fantome.

# Dialogue_WW_Scroll_Inspect
source: It says: "Be careful: I think there are Fishies in the water!"
ro: Spune: „Fii atent: cred că există pești în apă!”

# Dialogue_WW_Scroll_Inspect
source: He was.
ro: El a fost.

# Dialogue_WW_Scroll_Inspect
source: He was right.
ro: El a avut dreptate.

# Dialogue_WWSewerCreatures
source: Farewell and good luck to you as well!
ro: Adio și mult noroc și ție!

# Dialogue_WWSewerCreatures
source: All right, I will return when I'm done.
ro: Bine, voi reveni când termin.

# Dialogue_WWSewerCreatures
source: No problem. I always help when I can.
ro: Nici o problema. Întotdeauna ajut când pot.

# Dialogue_WWSewerCreatures
source: One of your brothers is trapped? What happened?
ro: Unul dintre frații tăi este prins? Ce s-a întâmplat?

# Dialogue_WWSewerCreatures
source: Leave
ro: Pleacă

# Dialogue_WWSewerCreatures
source: Farewell until we meet again!
ro: Adio până ne întâlnim din nou!

# Dialogue_WWSewerCreatures
source: It was nice to see you again.
ro: A fost frumos să te văd din nou.

# Dialogue_WWSewerCreatures
source: Don't worry! I'm still looking for it.
ro: Nu-ți face griji! Încă o caut.

# Dialogue_WWSewerCreatures
source: I don't have time for you creature! Stay out of my way!
ro: Nu am timp pentru tine creatură! Stai în afara drumului meu!

# Dialogue_WWSewerCreatures
source: Accept Quest
ro: Acceptă Misiune

# Dialogue_WWSewerCreatures
source: Calm down creature! I mean you no harm.
ro: Calmează-te creatura! Nu îți vreau nici un rău.

# Dialogue_WWSewerCreatures
source: All right I will see what I can do.
ro: Bine, voi vedea ce pot face.

# Dialogue_WWSewerCreatures
source: Oh, thank you!
ro: Oh, mulțumesc!

# Dialogue_WWSewerCreatures
source: Decline
ro: Refuză

# Dialogue_WWSewerCreatures
source: I'm sorry but I can't help you.
ro: Îmi pare rău, dar nu te pot ajuta.

# Dialogue_WWSewerCreatures
source: Help
ro: Ajutor

# DlgSystemSettings
source: Next
ro: Următor
