Repository: Frank1eJohnson/Uwajimaya
Catalog: Content/Localization/UwajimayaDialogues/*/UwajimayaDialogues.po
Languages: ro

# Dialogue_SewerCreatures
source: Calm down creature! I mean you no harm.
ro: Calmează-te creatură! Nu îți vreau răul.

# Dialogue_SewerCreatures
source: All right I will see what I can do.
ro: Bine, voi vedea ce pot face.

# Dialogue_SewerCreatures
source: Oh, thank you!
ro: Oh, multumesc!

# Dialogue_SewerCreatures
source: Just tell me what do you want...
ro: Spune-mi ce vrei ...

# Dialogue_SewerCreatures
source: Decline
ro: Refuză

# Dialogue_SewerCreatures
source: Let it talk
ro: Lasă-l să vorbească

# Dialogue_SewerCreatures
source: I'm sorry but I can't help you.
ro: Îmi pare rău, dar nu te pot ajuta.

# Dialogue_sewertut1
source: I don't like the idea of this additional challenge, but without the help of the Keeper you won't be able to get out.
ro: Nu-mi place ideea acestei provocări suplimentare, dar fără ajutorul Portarului nu vei putea ieși.

# Dialogue_sewertut2_magicbox
source: It's a magic box! That's what it's supposed to do, demon.
ro: Este o cutie magică! Asta ar trebui să facă, demon.

# Dialogue_sewertut2_magicbox
source: Is that box just floating in the air?
ro: Această cutie plutește doar în aer?

# Dialogue_sewertut3_silverkey
source: What is that crystal?
ro: Ce este acel cristal?

# Dialogue_sewertut3_silverkey
source: Don't care about that. Focus on finding a way out.
ro: Nu-mi pasă de asta. Concentrează-te pe a găsi o cale de ieșire.

# Dialogue_SupperDwarf
source: We need his help.
ro: Avem nevoie de ajutorul lui.

# Dialogue_SupperDwarf
source: They always wanted to invade the Outpost. They are many and we are few.
ro: Au dorit întotdeauna să invadeze avanpostul. Ei sunt mulți și noi suntem puțini.

# Dialogue_SupperDwarf
source: Why should I set you free?
ro: De ce să te eliberez?

# Dialogue_SupperDwarf
source: Some say Tabby's spirit returned and took the artefacts to Lillian. Maybe that is what happened.
ro: Unii spun că spiritul lui Tabby s-a întors și i-a dus artefactele la Lillian. Poate asta s-a întâmplat.

# Dialogue_SupperDwarf
source: Back to the question: will you get me out?
ro: Înapoi la întrebarea: mă vei scoate afară?

# Dialogue_SupperDwarf
source: I would invite you for dinner but unfortunately the door is closed.
ro: Te-aș invita la cină, dar, din păcate, ușa este închisă.

# Dialogue_SupperDwarf
source: No time to talk!
ro: Nu e timp pentru a vorbi!

# Dialogue_SupperDwarf
source: I mean I'm sorry about the others... not that you survived.
ro: Adică îmi pare rău de ceilalți ... nu că ai supraviețuit.

# Dialogue_SupperDwarf
source: But she is gone for months and no one knows where she might be.
ro: Dar este plecată de luni întregi și nimeni nu știe unde ar putea fi.

# Dialogue_SupperDwarf
source: He had so many friends. We all gathered and buried him near the Ancient Temple.
ro: Am avut atâția prieteni. Ne-am adunat cu toții și l-am îngropat lângă Templul Antic.

# Dialogue_SupperDwarf
source: I’m looking for three artefacts. Do you know something about them?
ro: Caut trei artefacte. Ști ceva despre ele?

# Dialogue_SupperDwarf
source: I will return to the Main Station at Crossroad Cave and see what I can do with the trains.
ro: Mă voi întoarce la gara principală de la Peștera Intersecției și voi vedea ce pot face cu trenurile.

# Dialogue_SupperDwarf
source: It has a key. The end of it is shaped like a dwarven helmet. You can easily recognise it.
ro: Are o cheie. Capătul acesteia are forma unei căști de pitici. Îl poți recunoaște cu ușurință.

# Dialogue_SupperDwarf
source: What happened to Tabby?
ro: Ce s-a întâmplat cu Tabby?

# Dialogue_SupperDwarf
source: They are all dead...
ro: Toți sunt morți ...

# Dialogue_SupperDwarf
source: Oh, it’s you again.
ro: Oh, ești din nou.

# Dialogue_SupperDwarf
source: But first I finish my supper. See you there!
ro: Dar mai întâi îmi termin cina. Ne vedem acolo!

# Dialogue_SupperDwarf
source: Just ask one of the other dwarfs to open the door.
ro: Doar cere unuia dintre ceilalți pitici să deschidă ușa.

# Dialogue_SupperDwarf
source: Everyone dead?
ro: Toți sunt morți?

# Dialogue_SupperDwarf
source: By the time I found him he was dead.
ro: Când l-am găsit era mort.

# Dialogue_SupperDwarf
source: Please help me out!
ro: Te rog ajuta-mă!

# Dialogue_SupperDwarf
source: Well that explains why they didn’t come for me over the last four months.
ro: Ei bine, asta explică de ce nu au venit pentru mine în ultimele patru luni.

# Dialogue_SupperDwarf
source: What were you Dwarves doing here?
ro: Ce făceați voi piticii aici?

# Dialogue_SupperDwarf
source: Tabby found the three artefacts but on his way home he got injured.
ro: Tabby a găsit cele trei artefacte, dar în drum spre casă a fost rănit.

# Dialogue_SupperDwarf
source: Artefacts
ro: Artefactele

# Dialogue_SupperDwarf
source: I've found the key!
ro: Am găsit cheia!

# Dialogue_SupperDwarf
source: How can I set you free?
ro: Cum te pot elibera?

# Dialogue_SupperDwarf
source: Train
ro: Tren

# Dialogue_SupperDwarf
source: Leave
ro: Pleacă

# Dialogue_SupperDwarf
source: Do you mean those traps out there?
ro: Vrei să spui capcanele de acolo?

# Dialogue_SupperDwarf
source: Catch me there if you need to go somewhere!
ro: Prinde-mă acolo dacă trebuie să mergi undeva!

# Dialogue_SupperDwarf
source: I will catch you at Crossroad Cave after I finished my supper.
ro: Te voi prinde la Peștera Intersecției, după ce am terminat cina.

# Dialogue_SupperDwarf
source: What happened? How did you end up here?
ro: Ce s-a întâmplat? Cum ai ajuns aici?

# Dialogue_SupperDwarf
source: Errr... I don’t know... out of pure righteousness perhaps?
ro: Errr ... nu știu ... din pură dreptate, poate?

# Dialogue_SupperDwarf
source: He wasn't just an ordinary cat. He was somehow connected to a charming young girl called Lillian.
ro: Nu era doar o pisică obișnuită. S-a legat cumva de o tânără fermecătoare, numită Lillian.

# Dialogue_SupperDwarf
source: We build walls. We create machines out of golem spirits with simple rules which can't go wrong.
ro: Construim ziduri. Creăm utilaje din spiritele golemilor cu reguli simple care nu pot merge greșit.

# Dialogue_SupperDwarf
source: I hope she will return.
ro: Sper că se va întoarce.

# Dialogue_SupperDwarf
source: All right!
ro: În regula!

# Dialogue_SupperDwarf
source: Or do you like trains? I can help you redirect them to stations you couldn’t go otherwise.
ro: Sau îți plac trenurile? Te pot ajuta să le redirecționați către stații la care nu poți merge altfel.

# Dialogue_SupperDwarf
source: Errr... You know, sometimes in the evening I come here and have some late dinner. And there are others who think it would be funny to close the door when I'm inside.
ro: Errr ... Știi, uneori seara vin aici și iau o cină târzie. Și sunt alții care cred că ar fi amuzant să închidă ușa când sunt înăuntru.

# Dialogue_SupperDwarf
source: He was a good friend. We all miss him.
ro: Era un bun prieten. Toți ne e dor de el.

# Dialogue_SupperDwarf
source: Once you collected all the artefacts you will need to take them back to a point where I can transport you to the Human Realm.
ro: După ce ai colectat toate artefactele, va trebui să le duci înapoi într-un punct în care să te pot transporta pe Tărâmul Uman.

# Dialogue_SupperDwarf
source: I’m sorry about that.
ro: Îmi pare rău.

# Dialogue_SupperDwarf
source: What happened?
ro: Ce s-a întâmplat?

# Dialogue_SupperDwarf
source: I like jokes and it would have been funny for I don’t know a few hours maybe...
ro: Îmi plac glumele și ar fi fost amuzant pentru că nu știu câteva ore poate ...

# Dialogue_SupperDwarf
source: You can go down there by using the elevator.
ro: Poți coborî acolo folosind liftul.

# Dialogue_SupperDwarf
source: We left the artefacts at his tomb, but one day later they disappeared.
ro: Am lăsat artefactele la mormântul lui, dar o zi mai târziu au dispărut.

# Dialogue_SupperDwarf
source: Bye!
ro: Pa!

# Dialogue_SupperDwarf
source: Welcome back!
ro: Bine ai revenit!

# Dialogue_SupperDwarf
source: Lillian was really kind to us Dwarves. We couldn't ever meet her in person but she could talk to us via the cat Tabby.
ro: Lillian a fost într-adevăr amabilă cu noi piticii. Nu am putut să o întâlnim niciodată în persoană, dar ea ne-a putut vorbi prin intermediul pisicii Tabby.

# Dialogue_SupperDwarf
source: You said something about trains...
ro: Ai spus ceva despre trenuri ...

# Dialogue_SupperDwarf
source: How can I open the door?
ro: Cum pot deschide ușa?

# Dialogue_SupperDwarf
source: My friend Tabby was also looking for artefacts.
ro: Prietenul meu Tabby căuta, de asemenea, artefacte.

# Dialogue_SupperDwarf
source: I think the Kobolds attacked us by surprise.
ro: Cred că Kobolds ne-a atacat prin surprindere.

# Dialogue_SupperDwarf
source: After the Cataclysm we realized the only way to fight madness is to create rules to follow.
ro: După Cataclism am realizat că singura modalitate de a lupta împotriva nebuniei este să creăm reguli de urmat.

# Dialogue_SupperDwarf
source: But there is a spare key in the Catacombs.
ro: Dar există o cheie de rezervă în Catacombe.

# Dialogue_SupperDwarf
source: They surely have nothing to do with madness...
ro: Cu siguranță nu au nimic de-a face cu nebunia ...

# Dialogue_SupperDwarf
source: What we were doing? Well we Dwarves are not like other creatures you might have met.
ro: Ce făceam? Ei bine, piticii nu suntem ca alte creaturi pe care le-ai putea întâlni.

# Dialogue_SupperDwarf
source: That sounds useful.
ro: Sună util.

# Dialogue_SupperDwarf
source: Key
ro: Cheie

# Dialogue_SupperDwarf
source: See? They are simple, effective and logical. Ruin can't harm us as long as we follow all the rules.
ro: Vezi? Sunt simple, eficiente și logice. Ruina nu ne poate face rău atât timp cât respectăm toate regulile.

# Dialogue_SupperDwarf
source: Do you have any idea how the others died?
ro: Ai idee despre cum au murit ceilalți?

# Dialogue_SupperDwarf
source: I thought they were just kidding.
ro: Am crezut că glumesc.

# Dialogue_SupperDwarf
source: Just help me out.
ro: Ajută-mă.

# Dialogue_SupperDwarf
source: But being here for four months seems a bit too much for me.
ro: Dar a fi aici de patru luni mi se pare cam prea mult.

# Dialogue_SupperDwarf
source: How?
ro: Cum?

# Dialogue_SupperDwarf
source: She cared about us. She knew all our Strongholds and Outposts. She always warned us before the Kobolds attacked.
ro: Îi păsa de noi. Știa toate fortărețele și avanposturile noastre. Ea ne-a avertizat întotdeauna înainte ca Kobolds să atace.

# Dialogue_SupperDwarf
source: Why?
ro: De ce?

# Dialogue_SupperDwarf
source: It was only a matter of time.
ro: A fost doar o chestiune de timp.

# Dialogue_SupperDwarf
source: Yes, trains. I can help you reach destinations you couldn't reach on your own.
ro: Da, trenuri. Te pot ajuta să ajungi la destinație la care nu puteai ajunge singur.

# Dialogue_SupperDwarf
source: Finally someone!
ro: În cele din urmă cineva!

# Dialogue_SupperDwarf
source: Dwarves
ro: Piticii

# Dialogue_SupperDwarf
source: Odd that I survived.
ro: Ciudat că am supraviețuit.

# Dialogue_SupperDwarf
source: Errr... I don't know.
ro: Errr ... nu știu.

# Dialogue_SupperDwarf
source: Any idea where that key might be?
ro: Ai idee unde ar putea fi acea cheie?

# Dialogue_SupperDwarf
source: Have you found the key?
ro: Ai găsit cheia?

# Dialogue_SupperDwarf
source: I need to go now.
ro: Trebuie sa plec acum.

# Dialogue_SupperDwarf
source: Back already?
ro: Înapoi deja?

# Dialogue_SupperDwarf
source: Well done! Thank you! Thank you!
ro: Foarte bine! Mulțumesc! Mulțumesc!

# Dialogue_SupperDwarf2
source: It was nice to see you too!
ro: A fost plăcut să te văd și pe tine!

# Dialogue_SupperDwarf2
source: Great!
ro: Grozav!

# Dialogue_SupperDwarf2
source: Er... Thanks! We'll talk about this later.
ro: E ... Mulțumesc! Vom vorbi despre asta mai târziu.

# Dialogue_SupperDwarf2
source: Hello! It's nice to see you again.
ro: Salut! E plăcut să te văd din nou.

# Dialogue_SupperDwarf2
source: Don’t worry, I’ll make ready a train for you heading that way.
ro: Nu îți face griji, voi pregăti un tren pentru tine., care va merge în direcția aia.

# Dialogue_SupperDwarf2
source: Ask him how you can travel to World’s End.
ro: Întreabă-l cum poți călători la Sfârșitul Lumii.

# Dialogue_SupperDwarf2
source: But I can't go back, because it's not safe.
ro: Dar nu mă pot întoarce, pentru că nu este în siguranță.

# Dialogue_SupperDwarf2
source: You know I'm a bit worried about what will happen to the Outpost.
ro: Știi că sunt puțin îngrijorat de ce se va întâmpla cu avanpostul.

# Dialogue_SupperDwarf2
source: I’m really glad you found that key for me. Now I can finish my supper outside in fresh air!
ro: Chiar mă bucur că ai găsit această cheie pentru mine. Acum îmi pot termina cina afară, în aer curat!

# Dialogue_SupperDwarf2
source: Take this! You deserve it!
ro: Ia asta! O meriți!

# Dialogue_SupperDwarf2
source: Is everything all right?
ro: Este totul în regulă?

# Dialogue_SupperDwarf2
source: Except those crazy traps...
ro: Cu excepția capcanelor ălea nebune ...

# Dialogue_SupperDwarf2
source: By the way, in case you need to go somewhere with the train just let me know.
ro: Apropo, în caz că trebuie să mergi undeva cu trenul, anunță-mă.

# Dialogue_SupperDwarf2
source: I have banished some of the monsters lurking in the Outpost.
ro: Am alungat câțiva dintre monștrii care pândesc în avanpost.

# Dialogue_SupperDwarf2
source: The Outpost is safe again.
ro: Avanpostul este din nou în siguranță.

# Dialogue_SupperDwarf2
source: Outpost
ro: Avanpost

# Dialogue_SupperDwarf2
source: Thanks!
ro: Mulțumesc!

# Dialogue_SupperDwarf2
source: Could you somehow make the enemies move to somewhere else maybe?
ro: Ai putea cumva să-i faci pe dușmani să se mute în altă parte poate?

# Dialogue_SupperDwarf2
source: Do you need help?
ro: Ai nevoie de ajutor?

# Dialogue_SupperDwarf2
source: Well done! Well done!
ro: Foarte bine! Foarte bine!

# Dialogue_SupperDwarf2
source: Leave
ro: Pleacă

# Dialogue_SupperDwarf2
source: Hello again my friend!
ro: Salut din nou prietenul meu!

# Dialogue_SupperDwarf2
source: Oh, it must be a charming place!
ro: Oh, trebuie să fie un loc fermecător!

# Dialogue_SupperDwarf2
source: Anyway, take this for your effort!
ro: Oricum, ia asta pentru efortul tău!

# Dialogue_SupperDwarf2
source: As the last Defender, it would be my duty to keep that place safe.
ro: Ca ultim apărător, ar fi datoria mea să păstrez locul în siguranță.

# Dialogue_SupperDwarf2
source: That’s where I can take you out of the Ruined Realm.
ro: Acolo te pot scoate din Tărâmul Ruinat.

# Dialogue_SupperDwarf2
source: We can talk some more once I've finished my supper...
ro: Mai putem vorbi ceva odată ce am terminat cina ...

# Dialogue_SupperDwarf2
source: Well, I can't do my duty until you banish all of them.
ro: Ei bine, nu-mi pot face datoria până nu îi alungi pe toți.

# Dialogue_SupperDwarf2
source: You don't need to go anywhere before you find the three artefacts.
ro: Nu trebuie să mergi nicăieri înainte de a găsi cele trei artefacte.

# Dialogue_SupperDwarf2
source: I would like to go to World’s End.
ro: Aș dori să merg la finalul lumii.

# Dialogue_SupperDwarf2
source: I'll see what I can do.
ro: Voi vedea ce pot face.

# Dialogue_Teachy_GK
source: Oh! The Walking Ball returned! Just in time!
ro: Oh! Mingea Mergătoare s-a întors! La timp!

# Dialogue_Teachy_GK
source: Leave
ro: Pleacă

# Dialogue_Teachy_GK
source: But they were so tasty.
ro: Dar erau atât de gustoase.

# Dialogue_Teachy_GK
source: You again?
ro: Tu din nou?

# Dialogue_Teachy_GK
source: Give Weird Device
ro: Dă dispozitiv ciudat

# Dialogue_Teachy_GK
source: Unfortunately I don't have any.
ro: Din păcate nu am niciunul.

# Dialogue_Teachy_GK
source: Just let me know when you're done! Meanwhile, I'll be reading a few more pages.
ro: Lasă-mă să știu când ai terminat! Între timp, voi citi încă câteva pagini.

# Dialogue_Teachy_GK
source: I was supposed to find a portal here.
ro: Trebuia să găsesc un portal aici.

# Dialogue_Teachy_GK
source: Also, if I hadn't drank the last two bottles... that would have helped...
ro: De asemenea, dacă nu aș fi băut ultimele două sticle ... asta m-ar fi ajutat ...

# Dialogue_Teachy_GK
source: Really? That sounds like my students! They were always complaining about unannounced examinations or even worse, "Why are there no lessons tomorrow?".
ro: Într-adevăr? Asta sună ca studenții mei! Se plângeau întotdeauna de examene neanunțate sau chiar mai rău, „De ce nu sunt lecții mâine?”.

# Dialogue_Teachy_GK
source: Don't have
ro: Nu am

# Dialogue_Teachy_GK
source: That's it my ball! I wish I had more students like you.
ro: Asta e mingea mea! Mi-aș dori să am mai mulți studenți ca tine.

# Dialogue_Teachy_GK
source: Oh my...
ro: Vai...

# Dialogue_Teachy_GK
source: That is amazing! Thank you, my globular friend! Take these coins, I am sure that you will enjoy spending them on... on whatever Balls like you like to get.
ro: Asta este incredibil! Mulțumesc, prietenul meu globular! Ia aceste monede, sunt sigur că vă va plăcea să le cheltuiți pe ... pe orice mingi ca tine doresc să cumpere.

# Dialogue_Teachy_GK
source: Nevermind, I will just read a bit more... at least until a solution is found for the whole problem.
ro: Nu contează, voi citi doar un pic mai mult ... cel puțin până când se va găsi o soluție pentru întreaga problemă.

# Dialogue_Teachy_GK
source: What's the matter?
ro: Ce s-a întâmplat?

# Dialogue_Teachy_GK
source: Did the Gatekeeper open the gate for you?
ro: Portarul a deschis poarta pentru tine?

# Dialogue_Teachy_GK
source: One must always be eager to solve a problem. No matter how challenging that is.
ro: Unul trebuie să fie întotdeauna dornic să rezolve o problemă. Oricât de provocator ar fi.

# Dialogue_Teachy_GK
source: But we might find another way to solve the problem.
ro: Dar am putea găsi un alt mod de a rezolva problema.

# Dialogue_Teachy_GK
source: I hope that you still have at least one bottle of that potion of mine. I could really use some...
ro: Sper că mai aveți cel puțin o sticlă din acea poțiune a mea. Aș putea folosi unele ...

# Dialogue_Teachy_GK
source: Here is a Weird Device that I found in the hideout of the Secret Science Society.
ro: Iată un dispozitiv ciudat pe care l-am găsit în ascunderea Societății de Științe Secrete.

# Dialogue_Teachy_GK
source: I've used all of them to get back from the Sewer. You should have told me that there is another way out!
ro: Le-am folosit pe toate pentru a mă întoarce din canalizare. Ar fi trebuit să-mi spui că există o altă cale de ieșire!

# Dialogue_Teachy_GK
source: Well, the portal is definitely here, but as you might have already noticed, the place is a bit worn.
ro: Ei bine, portalul este cu siguranță aici, dar după cum ai observat deja, locul este puțin uzat.

# Dialogue_Teachy_GK
source: Zhongqi Shan.
ro: Nu încă.

# Dialogue_Teachy_GK
source: Only the Gatekeeper can reopen the portal.
ro: Doar Portarul poate redeschide portalul.

# Dialogue_TL_GetSoulkeeper
source: A Spellcaster. It makes you able to use the Ruined Realm's magic, at least, up to a certain level.
ro: Un făcător de vrăji. Te face să poți folosi magia Tărâmului Ruinat, cel puțin, până la un anumit nivel.

# Dialogue_TL_GetSoulkeeper
source: What is it?
ro: Ce este?

# Dialogue_TL_GetSoulkeeper
source: That amulet is useful.
ro: Amuleta este utilă.

# Dialogue_TL_Monk
source: Please tell your Wizard that Monk would like to have a word with him.
ro: Te rog să îi spui Vrăjitorului că Călugărul ar dori să vorbească cu el.

# Dialogue_TL_Monk
source: I can only guess that right now, he's complaining about me.
ro: Nu pot decât să ghicesc asta, acum se plânge de mine.

# Dialogue_TL_Monk
source: Just get rid of him.
ro: Doar scapă de el.

# Dialogue_TL_Monk
source: I'm sorry but he doesn't want to talk to you.
ro: Îmi pare rău, dar nu vrea să vorbească cu tine.

# Dialogue_TL_Monk
source: Ask Wizard
ro: Întrebăl pe vrăjitor

# Dialogue_TL_Monk
source: Farewell, my friend, until we meet again!
ro: Adio, prietene, până ne întâlnim din nou!

# Dialogue_TL_Monk
source: I won't transfer!
ro: Nu mă transfer!

# Dialogue_TL_Monk
source: Ha-ha-ha... I know he heard everything.
ro: Ha, ha, ha ... Știu că a auzit totul.

# Dialogue_TL_Monk
source: I don't talk to him!
ro: Nu vorbesc cu el!

# Dialogue_TL_Monk
source: Wizard don't want
ro: Vrăjitorul nu vrea

# Dialogue_TL_Monk
source: I also have something for you, Wanderer!
ro: Am și ceva pentru tine, Rătăcitorule!

# Dialogue_TL_Monk
source: This might help you along the way.
ro: Acest lucru vă poate ajuta pe parcurs.

# Dialogue_TL_Monk
source: I won't deliver your messages anymore! If the two of you want something, then go get it yourselves!
ro: Nu vă mai transmit mesajele! Dacă voi doi doriți ceva, atunci mergeți și luați-l voi!

# Dialogue_TL_Monk
source: That's right. I will give him more time.
ro: Asta e corect. Îi voi acorda mai mult timp.

# Dialogue_TL_Monk
source: Wizard! A fellow named Monk wants to talk to you!
ro: Vrăjitorule! Un coleg pe nume Calugăr vrea să vorbească cu tine!

# Dialogue_TL_Monk
source: Hello, little Wanderer!
ro: Bună ziua, micule Hoinar!

# Dialogue_TL_Monk
source: But please...
ro: Dar te rog...

# Dialogue_TL_SoulkeeperHint
source: Use the Soulstone to summon the Keeper.
ro: Folosiți Piatra Sufletului pentru a-l chema pe Deținătorul Sufletului.

# Dialogue_TL_TakeSoulkeeperHint
source: It would be easier if I could just simply summon her back to me...
ro: Ar fi mai ușor dacă aș putea doar s-o chem înapoi la mine ...

# Dialogue_TL_TakeSoulkeeperHint
source: Be more careful the next time...
ro: Fii mai atent data viitoare ...

# Dialogue_TL_TakeSoulkeeperHint
source: Now go back to the Soulkeeper.
ro: Acum revino la Deținătorul Sufletului.

# Dialogue_TL_TakeSoulkeeperHint
source: Er... It's still with me.
ro: E ... încă este cu mine.

# Dialogue_TLAdventurerGnome0
source: Set me free
ro: Eliberează-mă

# Dialogue_TLAdventurerGnome0
source: How to open gate
ro: Cum se deschide poarta

# Dialogue_TLAdventurerGnome0
source: I think... I am...
ro: Eu cred... ca sunt...

# Dialogue_TLAdventurerGnome0
source: Oh! A walking ball!
ro: Oh! O minge care merge!

# Dialogue_TLAdventurerGnome0
source: I am crazy, therefore I think!
ro: Sunt nebun, de aceea cred!

# Dialogue_TLAdventurerGnome0
source: Leave
ro: Ieși

# Dialogue_TLAdventurerGnome0
source: How to prove Worthy
ro: Cum să dovedesc a fi demn

# Dialogue_TLAdventurerGnome0
source: Here, take one!
ro: Aici, ia unul!

# Dialogue_TLAdventurerGnome0
source: And I am not wise. In fact, I am totally crazy. But look on the bright side! At least I am aware of it.
ro: Și nu sunt înțelept. De fapt, sunt total nebun. Dar uită-te pe partea strălucitoare! Cel puțin eu sunt conștient de asta.

# Dialogue_TLAdventurerGnome0
source: Come back if you change your mind!
ro: Reveniți dacă vă răzgândiți!

# Dialogue_TLAdventurerGnome0
source: I think something's happening with the door's mechanism... but who knows? I can definitely hear some creaking! It's hard to guess which one of those is the real one...
ro: Cred că se întâmplă ceva cu mecanismul ușii ... dar cine știe? Cu siguranță pot auzi niște scârțâituri! Este greu de ghicit care dintre acestea este adevărata ...

# Dialogue_TLAdventurerGnome0
source: How unique, how original, how... sporty!
ro: Cât de unic, cât de original, cât de ... sportiv!

# Dialogue_TLAdventurerGnome0
source: I am, therefore I think!
ro: Eu sunt, de aceea gândesc!

# Dialogue_TLAdventurerGnome0
source: I was pretty sure I had to face him too... that's why I prepared! Potion of Worthiness! I have a few bottles...
ro: Eram destul de sigur că trebuie să mă înfrunt și eu ... de aceea m-am pregătit! Poțiunea demnității! Am câteva sticle ...
