Repository: Frank1eJohnson/Uwajimaya
Catalog: Content/Localization/UwajimayaDialogues/*/UwajimayaDialogues.po
Languages: ro

# Dialogue_Gatekeeper_AfterBattle
source: Once you have proven Worthy.
ro: Odată ce te-ai dovedit demn.

# Dialogue_Gatekeeper_BeforeBattle
source: Leave
ro: Pleacă

# Dialogue_Gatekeeper_BeforeBattle
source: Accept Challenge
ro: Acceptă Provocarea

# Dialogue_Gatekeeper_BeforeBattle
source: Give seat
ro: Dă loc

# Dialogue_Gatekeeper_BeforeBattle
source: Did you come back to prove yourself?
ro: Ai revenit să te dovedești?

# Dialogue_Gatekeeper_BeforeBattle
source: Maybe later
ro: Poate mai târziu

# Dialogue_Gatekeeper_BeforeBattle
source: Only if you prove yourself worthy one more time.
ro: Doar dacă te dovedești demn încă o dată.

# Dialogue_Gatekeeper_BeforeBattle
source: Not fair
ro: Nu e corect

# Dialogue_Gatekeeper_BeforeBattle
source: Is that... is this really happening?
ro: Oare asta ... se întâmplă cu adevărat?

# Dialogue_Gatekeeper_BeforeBattle
source: I have found a seat that fits your size.
ro: Am găsit un scaun care să se potrivească dimensiunilor tale.

# Dialogue_Gatekeeper_BeforeBattle
source: Now... are you ready to prove yourself?
ro: Acum ... ești pregătit să te dovedești?

# Dialogue_Gatekeeper_BeforeBattle
source: Yes, I can.
ro: Da, pot.

# Dialogue_Gatekeeper_BeforeBattle
source: The best challenges were set aside just for you!
ro: Cele mai bune provocări au fost puse deoparte doar pentru tine!

# Dialogue_Gatekeeper_BeforeBattle
source: I myself shall test your worthiness.
ro: Eu însumi îți voi testa vrednicia.

# Dialogue_Gatekeeper_BeforeBattle
source: I will make no exceptions! Your generous act gave me back my spirit. From now on I pledge to perform my task even better.
ro: Nu voi face excepții! Actul tău generos mi-a dat înapoi spiritul meu. De acum înainte mă angajez să îmi îndeplinesc și mai bine sarcina.

# Dialogue_Gatekeeper_BeforeBattle
source: Errr... maybe a bit later.
ro: Errr ... poate un pic mai târziu.

# Dialogue_Gatekeeper_BeforeBattle
source: I am truly impressed. I will never forget about your kindness.
ro: Sunt cu adevărat impresionat. Nu voi uita niciodată de bunătatea ta.

# Dialogue_Gatekeeper_BeforeBattle
source: Are you ready to prove yourself?
ro: Ești pregătit să te dovedești?

# Dialogue_Gatekeeper_BeforeBattle
source: Thank you! You can have this RuneStone as a compensation.
ro: Mulțumesc! Poți salva această Piatra Runică drept compensare.

# Dialogue_Gatekeeper_BeforeBattle
source: All right, let's do it!
ro: Bine, hai să o facem!

# Dialogue_Gatekeeper_BeforeBattle
source: What? Can't you just open that gate?
ro: Ce? Nu poți deschide poarta aceea?

# Dialogue_Gatekeeper_BeforeBattle
source: Well that's very... kind of you, I guess.
ro: Păi, e foarte ... generos, cred.

# Dialogue_Gatekeeper_BeforeBattle
source: Keeper! Can you open a Portal?
ro: Portar! Poți să deschizi un portal?

# Dialogue_Gatekeeper_BeforeBattle
source: You are welcome
ro: Cu plăcere

# Dialogue_Gatekeeper_BeforeBattle
source: Give Seat
ro: Dă Loc

# Dialogue_Gatekeeper_BeforeBattle
source: This is your final trial.
ro: Acesta este proba ta finală.

# Dialogue_GGFountain
source: How did it happen? How was everything destroyed?
ro: Cum s-a întâmplat? Cum a fost distrus totul?

# Dialogue_GGFountain
source: Those who stayed died.
ro: Cei care au rămas au murit.

# Dialogue_GGFountain
source: It’s nice of the Mirror that he still remembers me. Could you give this flower to him to express my thankfulness?
ro: Este minunat că Oglinda faptul că încă își mai amintește de mine. Ai putea să dai această floare pentru a-mi exprima mulțumirea?

# Dialogue_GGFountain
source: Who lived in this Realm? Where are they now?
ro: Cine a trăit pe acest tărâm? Unde sunt ei acum?

# Dialogue_GGFountain
source: What was the Realm like before?
ro: Cum era Tărâmul înainte?

# Dialogue_GGFountain
source: Majestic castles and towers up until the sky. The air fresh, the sun shining.
ro: Castele și turnurile maiestuoase până la cer. Aerul proaspăt, soarele strălucind.

# Dialogue_GGFountain
source: Who lived here?
ro: Cine a locuit aici?

# Dialogue_GGFountain
source: No way
ro: În nici un caz

# Dialogue_GGFountain
source: Of course
ro: Desigur

# Dialogue_GGFountain
source: Ruin preserves them. They can’t get old and die. Some of them are still visiting these parts of the Realm, but they no longer know what they are looking for.
ro: Ruina îi păstrează. Ei nu pot îmbătrâni și muri. Unii dintre ei încă mai vizitează aceste părți ale tărâmului, dar nu mai știu ce caută.

# Dialogue_GGFountain
source: Thank you!
ro: Mulțumesc!

# Dialogue_GGFountain
source: Magic Mirror
ro: Oglinda Magică

# Dialogue_GGFountain
source: I'm not a postman. Find someone else!
ro: Nu sunt poștaș. Găsește pe altcineva!

# Dialogue_GGFountain
source: It was a wonderful world, full of life and joy.
ro: Era o lume minunată, plină de viață și bucurie.

# Dialogue_GGFountain
source: Realm's past
ro: Trecutul tărâmului

# Dialogue_GGFountain
source: I'll remember you!
ro: Îmi voi aminti de tine!

# Dialogue_GGFountain
source: Sure, I will deliver the flower!
ro: Sigur, voi livra floarea!

# Dialogue_GGFountain
source: Those who escaped changed in body and mind.
ro: Cei care au scăpat s-au schimbat în trup și minte.

# Dialogue_GGFountain
source: No problem. It doesn’t matter anyway.
ro: Nici o problema. Nu contează oricum.

# Dialogue_GGFountain
source: Cataclysm
ro: Cataclism

# Dialogue_GGFountain
source: Until one day many of the imprisoned spirits broke loose from the golem bodies.
ro: Până într-o zi, multe dintre spiritele încarcerate s-au desprins de trupurile golemilor.

# Dialogue_GGFountain
source: Until it was all gone.
ro: Până a dispărut totul.

# Dialogue_GGFountain
source: I am here so that the past is not forgotten until the very end. Have some rest and remember!
ro: Sunt aici pentru ca trecutul să nu fie uitat până la sfârșit. Odihnește-te și amintește-ți!

# Dialogue_GGFountain
source: The Golem Makers went too far. They made thousands and thousands of golems.
ro: Creatorii de Golemi au mers prea departe. Au făcut mii și mii de Golemi.

# Dialogue_GGFountain
source: Would you like to hear some other tales?
ro: Ți-ar plăcea să auzi și alte povești?

# Dialogue_GGFountain
source: They always cared about the new ones and forgot about the obsolete ones.
ro: Au avut mereu grijă de cele noi și au uitat de cele învechite.

# Dialogue_GGFountain
source: Is there anything else you want me to remember?
ro: Mai vreți să-mi amintesc ceva?

# Dialogue_GGFountain
source: The streets were clear and bright, trees and flowers everywhere.
ro: Străzile erau limpezi și luminoase, copaci și flori peste tot.

# Dialogue_GGFountain
source: I think it likes you.
ro: Cred că te place.

# Dialogue_GGFountain
source: Now they are all gone.
ro: Acum toți au dispărut.

# Dialogue_GGFountain
source: Oh, there were many: proud, wise, brave, clever and majestic.
ro: O, au fost mulți: mândri, înțelepți, curajoși, deștepți și maiestuoși.

# Dialogue_GGFountain
source: Leave
ro: Pleacă

# Dialogue_GGFountain
source: They are what is now called Ruin. The power which is destroying the Realm.
ro: Ei sunt ceea ce acum se numește Ruină. Puterea care distruge tărâmul.

# Dialogue_GGFountain
source: I’ve met with a Magic Mirror who showed a picture of you.
ro: M-am întâlnit cu o oglindă magică care a arătat imaginea ta.

# Dialogue_GGFountain
source: I've got to go now.
ro: Trebuie să plec acum.

# Dialogue_GGFountain
source: Ask if you need to know more. I'll remember.
ro: Întrebă dacă trebuie să ști mai multe. Îmi amintesc.

# Dialogue_GGGateKeeper0
source: That’s more like it!
ro: Așa mai merge!

# Dialogue_GGGateKeeper0
source: Retreat
ro: Retragete

# Dialogue_GGGateKeeper0
source: How can I prove that I'm worthy?
ro: Cum pot dovedi că sunt demn?

# Dialogue_GGGateKeeper0
source: That’s awful, let’s try it in a different tone.
ro: Este groaznic, să încercăm pe un ton diferit.

# Dialogue_GGGateKeeper0
source: Behold traveler!
ro: Iată călător!

# Dialogue_GGGateKeeper0
source: How to prove?
ro: Cum se dovedește?

# Dialogue_GGGateKeeper0
source: No problem I don't really want to pass that gate anyway.
ro: Nici o problemă oricum nu vreau să trec poarta aceea.

# Dialogue_GGGateKeeper0
source: I am the Gatekeeper. I will only open this door if you prove to be worthy.
ro: Eu sunt Portarul. Voi deschide această ușă doar dacă te dovedești a fi demn.

# Dialogue_GGGateKeeper0
source: Open, now!
ro: Deschide acum!

# Dialogue_GGGateKeeper0
source: Ask him to open the door.
ro: Cere-i să deschidă ușa.

# Dialogue_GGGateKeeper0
source: Please let me in
ro: Te rog, lasă-mă să intru

# Dialogue_GGGateKeeper0
source: Accept Challenge.
ro: Acceptă Provocarea.

# Dialogue_GGGateKeeper0
source: No way! Nobody can skip the Trial!
ro: În nici un caz! Nimeni nu poate sări peste Probă!

# Dialogue_GGGateKeeper0
source: Still not...
ro: Încă nu...

# Dialogue_GGGateKeeper0
source: There is no turning back now. The Trial awaits you!
ro: Nu se mai întoarce acum. Proba te așteaptă!

# Dialogue_GGGateKeeper0
source: The Trial will test you!
ro: Proba te va testa!

# Dialogue_GGGateKeeper0
source: Ah, you can't speak! Hmm... Try now!
ro: Ah, nu poți vorbi! Hmm ... Încearcă acum!

# Dialogue_GGGateKeeper0
source: Could you just let me pass this time?
ro: M-ai putea lăsa să trec de data asta?

# Dialogue_GGGateKeeper0
source: Open that gate, Keeper!
ro: Deschide poarta, Portare!

# Dialogue_GGGateKeeper0
source: I can only open this door for those who prove worthy.
ro: Pot deschide această ușă decât pentru cei care se dovedesc demni.

# Dialogue_GGGateKeeper0
source: Please, open the...
ro: Te rog, deschide...

# Dialogue_GGGateKeeper2
source: Leave
ro: Pleacă

# Dialogue_GGGateKeeper2
source: Here we go again...
ro: Iar începem...

# Dialogue_GGGateKeeper2
source: Well, of course.
ro: Ei bine, desigur.

# Dialogue_GGGateKeeper2
source: You know the rules.
ro: Știi regulile.

# Dialogue_GGGateKeeper2
source: Accept Challenge
ro: Acceptă Provocarea

# Dialogue_GGGateKeeper2
source: I mean: You shall not pass unless you prove yourself worthy!
ro: Adică: nu vei trece decât dacă te dovedești demn!

# Dialogue_GGGateKeeper2
source: You shall not pass!!
ro: Tu nu vei trece!!

# Dialogue_GGGateKeeper2
source: What?? I thought I will need to prove myself worthy.
ro: Ce?? Am crezut că va trebui să mă dovedesc demn.

# Dialogue_GGSurviverNote
source: 'I made this statue to give me shelter from the Cataclysm. Only magic can keep it away.'
ro: „Am făcut această statuie să-mi ofer adăpost de cataclism. Doar magia o poate ține departe. "

# Dialogue_GGSurviverNote
source: 'Cerulean is still safe. I managed to steal the Gem to open the Gate but I can’t use it.'
ro: „Cerulean este încă în siguranță. Am reușit să fur Bijuteria pentru a deschide Poarta, dar nu o pot folosi. ”

# Dialogue_GGSurviverNote
source: 'I am doomed.'
ro: „Sunt condamnat”.

# Dialogue_GhostDwarf
source: Sure
ro: Desigur

# Dialogue_GhostDwarf
source: Help you?! This is a courthouse not some charity club!
ro: Te ajut?! Acesta este un tribunal, nu un club de caritate!

# Dialogue_GhostDwarf
source: You know I heavily rely on my abacus. But being a ghost and all I can’t really use it.
ro: Știi că mă bazez foarte mult pe abacul meu. Dar fiind o fantomă nu pot folosi cu adevărat.

# Dialogue_GhostDwarf
source: I’m looking for three artefacts. Do you know anything about them?
ro: Caut trei artefacte. Știți ceva despre ei?

# Dialogue_GhostDwarf
source: Actually it’s kinda awesome!
ro: De fapt, este minunat!

# Dialogue_GhostDwarf
source: Returning again and again is not a crime but maybe we should reconsider the Law regarding this statement.
ro: Întoarcerea din nou și din nou nu este o crimă, dar poate ar trebui să reconsideram Legea cu privire la această afirmație.

# Dialogue_GhostDwarf
source: The Law says many things about being dad but nothing about being dead...
ro: Legea spune multe lucruri despre a fi tată, dar nimic despre a fi mort ...

# Dialogue_GhostDwarf
source: I can’t rest until the Case is solved.
ro: Nu mă pot odihni până nu se rezolvă cazul.

# Dialogue_GhostDwarf
source: Sure whatever...
ro: Sigur orice ...

# Dialogue_GhostDwarf
source: If you found her please escort her to the Room of the Law so that her vicious acts can be judged.
ro: Dacă ai găsit-o, te rog să o escortezi în Camera Legii, pentru ca actele ei vicioase să poată fi judecate.

# Dialogue_GhostDwarf
source: You are dead
ro: Ești mort

# Dialogue_GhostDwarf
source: Could you help me? I'm forced into this Realm by a Wizard.
ro: Ai putea să ma ajuți? Sunt forțat în acest tărâm de un vrăjitor.

# Dialogue_GhostDwarf
source: Ah, even the World will be over sooner than all our cases.
ro: Ah, chiar și Lumea se va termina mai repede decât toate cazurile noastre.

# Dialogue_GhostDwarf
source: I've made you a Ghost Abacus.
ro: Ți-am făcut un abac fantomă.

# Dialogue_GhostDwarf
source: And being a Wizard is strictly forbidden! If I manage to prove you have some connection with that criminal Wizard I will judge you as well!
ro: Și a fi vrăjitor este strict interzis! Dacă reușesc să dovedesc că ai vreo legătură cu acel vrăjitor criminal, te voi judeca și pe tine!

# Dialogue_GhostDwarf
source: The Law never writes it would be forbidden to be a walking ball. Therefore it is not a problem.
ro: Legea nu scrie niciodată că ar fi interzis să fie o minge care merge. Prin urmare, nu este o problemă.

# Dialogue_GhostDwarf
source: Staring like that is strictly forbidden!
ro: Privitul așa este strict interzis!

# Dialogue_GhostDwarf
source: The Case of the Gnome traveller. A really complicated one.
ro: Cazul călătorului Gnome. Una cu adevărat complicată.

# Dialogue_GhostDwarf
source: Makes sense...
ro: Are sens...

# Dialogue_GhostDwarf
source: The Law says that.
ro: Bănuiesc că au uitat să-ți spună, dar timpul de muncă a trecut mult ...

# Dialogue_GhostDwarf
source: I guess they forgot to tell you but work time is long over...
ro: Bănuiesc că au uitat să-ți spună, dar timpul de muncă a trecut de mult ...

# Dialogue_GhostDwarf
source: Take this as a reward!
ro: Ia acest lucru ca o recompensă!

# Dialogue_GhostDwarf
source: How wondrous! I’m sure this will reduce my research time with years!
ro: Ce minune! Sunt sigur că acest lucru îmi va reduce timpul de cercetare cu ani!

# Dialogue_GhostDwarf
source: You are guilty for bouncing too loudly! Just like my uncle...
ro: Ești vinovat că ai sărit prea tare! La fel ca unchiul meu ...

# Dialogue_GhostDwarf
source: We had to reread all the rules to find out if there is anything about this.
ro: A trebuit să recitim toate regulile pentru a afla dacă există ceva în acest sens.

# Dialogue_GhostDwarf
source: So what is this case you are working on?
ro: Deci la ce caz lucrezi?

# Dialogue_GhostDwarf
source: Help
ro: Ajutor

# Dialogue_GhostDwarf
source: No way
ro: În nici un caz

# Dialogue_GhostDwarf
source: Just give me some more time and I will prove that you are guilty.
ro: Dă-mi mai mult timp și voi demonstra că ești vinovat.

# Dialogue_GhostDwarf
source: Such a tragic death! Now I need to start everything from the beginning!
ro: O moarte atât de tragică! Acum trebuie să încep totul de la început!

# Dialogue_GhostDwarf
source: Yes, she is a criminal for inhabiting the body of a cat. That is strictly forbidden!
ro: Da, este o criminală pentru locuirea trupului unei pisici. Asta este strict interzis!

# Dialogue_GhostDwarf
source: Incorrect. It is not.
ro: Incorect. Nu este.

# Dialogue_GhostDwarf
source: Artefacts
ro: Artefacte

# Dialogue_GhostDwarf
source: Don’t disturb me!
ro: Nu mă deranja!

# Dialogue_GhostDwarf
source: That’s very likely.
ro: Este foarte probabil.

# Dialogue_GhostDwarf
source: All right I was just asking. It’s not forbidden. At least in this case.
ro: Întrebam doar. Nu este interzis. Cel puțin în acest caz.

# Dialogue_GhostDwarf
source: You are dead. Isn’t that a problem?
ro: Ești mort. Nu este asta o problemă?

# Dialogue_GhostDwarf
source: Do you know a girl called Lillian?
ro: Cunoașteți o fată care se numește Lillian?

# Dialogue_GhostDwarf
source: I’ll see what I can do...
ro: Voi vedea ce pot face...

# Dialogue_GhostDwarf
source: We almost finished the process when the Gnome Traveller died of waiting.
ro: Aproape că am terminat procesul când Piticul Călător a murit de așteptare.

# Dialogue_GhostDwarf
source: It is
ro: Este

# Dialogue_GhostDwarf
source: Give Abacus
ro: Dă-i Abacul

# Dialogue_GhostDwarf
source: And how about being dead?
ro: Și cum e să fii mort?

# Dialogue_GhostDwarf
source: He asked for permission to use the Railway. Which is really unusual. Before him only dwarves used the Railways.
ro: El a cerut permisiunea de a folosi calea ferată. Ceea ce este cu adevărat neobișnuit. Înaintea lui doar piticii foloseau Căile Ferate.

# Dialogue_GhostDwarf
source: Respect the Law!
ro: Respectă Legea!

# Dialogue_GhostDwarf
source: It’s not that simple. In his testament he asked us to bring his corpse home, on the railway.
ro: Nu este atât de simplu. În testamentul său ne-a cerut să-i aducem cadavrul acasă, pe calea ferată.

# Dialogue_GhostDwarf
source: What can I do for you?
ro: Cu ce vă pot ajuta?

# Dialogue_GhostDwarf
source: Leave
ro: Pleacă

# Dialogue_GhostDwarf
source: The Law doesn’t forbid walking for balls. I guess you are right then.
ro: Legea nu interzice mersul pentru mingi. Bănuiesc ca ești ok atunci.

# Dialogue_GhostDwarf
source: Rest... err... work in peace!
ro: Odihnește-te ... greș ... muncește în pace!

# Dialogue_GhostDwarf
source: Could you help me?
ro: Ai putea să mă ajuți?

# Dialogue_GhostDwarf
source: When we found out there are none, so we needed to create new rules. But for that we had to reread all the existing rules again.
ro: Când am aflat că nu există, așa că a trebuit să creăm noi reguli. Dar pentru asta a trebuit să recitim din nou toate regulile existente.

# Dialogue_GhostDwarf
source: I don’t. But keep in mind if they were stolen and you find them you have to give them to the Dwarven King.
ro: Nu sunt Dar ține minte dacă au fost furate și le găsești că trebuie să le dai Regelui Pitic.

# Dialogue_GhostDwarf
source: Not at all
ro: Deloc

# Dialogue_GhostDwarf
source: No, no, no! I have other things to do.
ro: Nu, nu, nu! Am alte lucruri de făcut.

# Dialogue_GhostDwarf
source: Thank you! Thank you!
ro: Mulțumesc! Mulțumesc!

# Dialogue_GhostDwarf
source: What crime did the Gnome commit?
ro: Ce crimă a comis acel Pitic?

# Dialogue_GhostDwarf
source: When I touch it my fingers slip past the abacus, I can’t move it.
ro: Când o ating, degetele alunecă pe lângă abac, nu o pot mișca.

# Dialogue_GhostDwarf
source: I would call that case solved...
ro: Aș numi acel caz rezolvat ...

# Dialogue_GhostDwarf
source: We decided that Gnomes can use the Railway, but how about Gnome Corpses? That’s a totally different issue.
ro: Am decis că Piticii pot folosi căile ferate, dar ce zici de Cadavrele la Pitici? Aceasta este o problemă total diferită.

# Dialogue_GhostDwarf
source: I guess the same rules apply.
ro: Bănuiesc ca se aplica aceleași reguli.

# Dialogue_GhostDwarf
source: Hmmm... Let me see...
ro: Hmmm ... Lasă-mă să văd ...

# Dialogue_GhostDwarf
source: And you are a walking ball. Isn’t that a problem?
ro: Și ești o minge care vorbește. Nu este asta o problemă?

# Dialogue_Gnory
source: Fishy warns you! This path is dangerous! Turn back! Explore other places!
ro: Peșțele te avertizează! Această cale este periculoasă! Întoarce-te! Explorează alte locuri!

# Dialogue_Gnory
source: Long story short I almost reached the Outpost when my cargo went into a pothole and my wheel was broken.
ro: Povestea scurtă aproape că am ajuns în avanpost, când marfa mea a intrat într-o gaură și mi s-a rupt roata.

# Dialogue_Gnory
source: Then I will give it for 10 Gold Coins.
ro: Apoi îl voi da pentru 10 monede de aur.

# Dialogue_Gnory
source: 9 Gold I won't go any lower!
ro: 9 Aur nu mă duc mai jos!

# Dialogue_Gnory
source: Such an insult! How dare you?
ro: O astfel de insultă! Cum îndrăznești?

# Dialogue_Gnory
source: Wohoo! I have some really epic names just for you! Each name costs a Single Gold coin!
ro: Wohoo! Am câteva nume cu adevărat epice doar pentru tine! Fiecare nume costă o monedă unică de aur!

# Dialogue_Gnory
source: Help me?
ro: Ajuta-mă?

# Dialogue_Gnory
source: Do you really want to help me?
ro: Chiar vrei să mă ajuți?

# Dialogue_Gnory
source: Oh, you come to visit old Gnory again.
ro: Oh, ai venit din nou să-l vizitezi pe bătrânul Gnory.

# Dialogue_Gnory
source: I so hated them...
ro: I-am urat atât de mult ...

# Dialogue_Gnory
source: Oh, the three artefacts! That sounds a bit too ambitious but after all, they can be quite a unique gift for a young ball lady.
ro: O, cele trei artefacte! Acest lucru sună un pic prea ambițios, dar până la urmă, acestea pot fi un cadou unic pentru o tânără domnișoară minge.

# Dialogue_Gnory
source: For everything as well.
ro: Pentru toate, de asemenea.

# Dialogue_Gnory
source: What?
ro: Ce?

# Dialogue_Gnory
source: {name}? It still sounds a bit weird, but I think I might like it.
ro: {name}? Sună încă un pic ciudat, dar cred că mi-ar plăcea.

# Dialogue_Gnory
source: Dr. Ball
ro: Dr. Minge

# Dialogue_Gnory
source: I’ve found a wheel for you!
ro: Am găsit o roată pentru tine!

# Dialogue_Gnory
source: That's sad. Come back when you have some!
ro: Asta e trist. Întoarce-te când ai ceva!

# Dialogue_Gnory
source: Fishy is Fishy!
ro: Peștele e Pește!

# Dialogue_Gnory
source: I've got to go now!
ro: Trebuie să plec acum!

# Dialogue_Gnory
source: An elixir that makes you attractive to the lady... err... balls?
ro: Un elixir care te face atractiv pentru doamnă ... err ... mingi?

# Dialogue_Gnory
source: Leave
ro: Pleacă

# Dialogue_Gnory
source: I have some at my shop for sale!
ro: Am câteva la magazinul meu de vânzare!

# Dialogue_Gnory
source: See? And I have to listen to him all day!
ro: Vezi? Și trebuie să-l ascult toată ziua!

# Dialogue_Gnory
source: It's yours for 12 Gold Coins.
ro: Este al tău pentru 12 monede de aur.

# Dialogue_Gnory
source: Then I will give it for 8 Gold Coins.
ro: Apoi îl voi da pentru 8 monede de aur.

# Dialogue_Gnory
source: I see one of your wagon wheels is broken.
ro: Văd că una dintre roțile tale de căruță este spartă.

# Dialogue_Gnory
source: Don’t care about Fishy. He can’t really speak and I’m not sure if he even understands himself.
ro: Nu-i pasă de Fishy. El nu poate vorbi cu adevărat și nu sunt sigur dacă chiar se înțelege pe sine.

# Dialogue_Gnory
source: See you later!
ro: Ne vedem mai târziu!

# Dialogue_Gnory
source: Shut up Fishy!
ro: Taci Pește!

# Dialogue_Gnory
source: 12 Gold
ro: 12 Aur

# Dialogue_Gnory
source: I’ve met another merchant called Lory. Is she your sister you talked about?
ro: Am întâlnit un alt comerciant numit Lory. Este sora ta despre care ai vorbit?

# Dialogue_Gnory
source: What the holy Coins?! Now I'm getting angry!
ro: Ce monede sfinte ?! Acum mă enervez!

# Dialogue_Gnory
source: And Fishy!
ro: Și Peștele!

# Dialogue_Gnory
source: Fishy know about them!
ro: Peștele știe despre ei!

# Dialogue_Gnory
source: He was a good merchant, so he understood. Business is hard. I always say that for a fair price I would even sell myself.
ro: Era un bun comerciant, așa că a înțeles. Afacerile sunt grele. Întotdeauna spun că pentru un preț corect chiar m-aș vinde.

# Dialogue_Gnory
source: You know what? 9 Gold Coins! Take it or leave it that's my final offer!
ro: Știi ce? 9 monede de aur! Luați-o sau lăsați-o, aceasta este oferta mea finală!

# Dialogue_Gnory
source: Don't buy
ro: Nu cumpăra

# Dialogue_Gnory
source: Then I will give it for 9 Gold Coins.
ro: Apoi îl voi da pentru 9 monede de aur.

# Dialogue_Gnory
source: All right, you won. I will give it for 11 Gold Coins.
ro: Bine, ai câștigat. Îl voi da pentru 11 monede de aur.
