Repository: Frank1eJohnson/Uwajimaya
Catalog: Content/Localization/UwajimayaDialogues/*/UwajimayaDialogues.po
Languages: ro

# Dialogue_AARaven0
source: Very nice! Raven likes that you are making progress.
ro: Foarte frumos! Corbului îi place că progresezi.

# Dialogue_AARaven0
source: Which is technically the same.
ro: Ceea ce este tehnic la fel.

# Dialogue_AARaven0
source: I'm confused
ro: Sunt derutat

# Dialogue_AARaven0
source: Help
ro: Ajutor

# Dialogue_AARaven0
source: Farewell
ro: Rămas bun

# Dialogue_AARaven0
source: What??
ro: Ce??

# Dialogue_AARaven0
source: Raven will just sit here for a short time before venturing into the Ruin.
ro: Corbul va sta doar aici pentru o scurtă perioadă de timp înainte de a se aventura în Ruină.

# Dialogue_AARaven0
source: So you're meant to open this dusty little door with Raven, aren't you?
ro: Deci trebuie să deschizi această ușă mică și prăfuită cu Corbul, nu-i așa?

# Dialogue_AARaven0
source: Let's have fun!
ro: Să ne distrăm!

# Dialogue_AARaven0
source: That's stupid
ro: Asta e o prostie

# Dialogue_AARaven0
source: Farewell, Raven!
ro: Adio, Corbule!

# Dialogue_AARaven0
source: I would like to know...
ro: Aș vrea să știu...

# Dialogue_AARaven0
source: Let's open that gate. Quick!
ro: Să deschidem poarta respectivă. Rapid!

# Dialogue_AARaven0
source: Why is he here?
ro: De ce este aici?

# Dialogue_AARaven0
source: Freedom
ro: Libertate

# Dialogue_AARaven0
source: You can't live your life like in the old days any longer and that's why you're staying with your master, right?
ro: Nu mai poți trăi viața ca pe vremuri și de aceea rămâi cu stăpânul tău, nu?

# Dialogue_AARaven0
source: End of the World
ro: Sfârșește lumea

# Dialogue_AARaven0
source: First you will need to find the Gem. Meanwhile, Raven must figure it out how to open the Gate with it.
ro: Mai întâi va trebui să găsești Bijuteria. Între timp, Corbul trebuie să-și dea seama cum să deschidă Poarta cu ea.

# Dialogue_AARaven0
source: What are you doing here?
ro: Ce faci aici?

# Dialogue_AARaven0
source: Go on your search then! Unless you'd like to chat some more with Raven.
ro: Continuă-ți căutarea atuncea! Dacă nu doriți să discuți cu Corbul.

# Dialogue_AARaven0
source: It must be somewhere close to the Arcade.
ro: Trebuie să fie undeva aproape de Arcadă.

# Dialogue_AARaven0
source: Raven knows some people that'd be glad with that.
ro: Corbul cunoaște unii oameni care s-ar bucura cu asta.

# Dialogue_AARaven0
source: Is that where I will find your artefacts?
ro: Acolo îți voi găsi artefactele?

# Dialogue_AARaven0
source: Save the world!
ro: Salvează lumea!

# Dialogue_AARaven0
source: Niiice!
ro: Grooozav!

# Dialogue_AARaven0
source: And now, even while we speak, their curse continues to spread.
ro: Și acum, chiar în timp ce vorbim, blestemul lor continuă să se răspândească.

# Dialogue_AARaven0
source: You are so hopeless...
ro: Ești atât de fără speranță ...

# Dialogue_AARaven0
source: Until one day the spirits broke loose and formed Ruin.
ro: Până într-o zi spiritele s-au dezlănțuit și au format Ruina.

# Dialogue_AARaven0
source: Ask more from Raven if you like!
ro: Cere mai multe de la Corb dacă dorești!

# Dialogue_AARaven0
source: One more,... and the Gem will be completed!
ro: Încă unul, ... și Bijuteria va fi finalizată!

# Dialogue_AARaven0
source: A strange creature, yet a familiar aura! Tell me, my dear Wizard, what happened to Tabby?
ro: O creatură ciudată, dar totuși o aură familiară! Spune-mi, scumpul meu Vrăjitor, ce s-a întâmplat cu Tabby?

# Dialogue_AARaven0
source: They both accepted that there is a great threat in this realm.
ro: Amândoi au acceptat că există o mare amenințare pe acest Tărâm.

# Dialogue_AARaven0
source: Somewhere beyond that Gate there's a Portal. It will take you into the heart of the Realm.
ro: Undeva dincolo de poarta respectivă există un portal. Te va duce în inima Tărâmului.

# Dialogue_AARaven0
source: The Master and Raven are seeking knowledge about the Ruined Realm.
ro: Maestrul și Corbul caută cunoștințe despre Tărâmul Ruinat.

# Dialogue_AARaven0
source: About Ruin
ro: Despre Ruină

# Dialogue_AARaven0
source: Your master said he is done with that.
ro: Stăpânul tău a spus că a terminat cu asta.

# Dialogue_AARaven0
source: Long ago it was called the Runic Realm.
ro: Cu mult timp în urmă, se numea Tărâmul Runic.

# Dialogue_AARaven0
source: Raven is really sorry but he can't help you anymore.
ro: Corbului îi pare cu adevărat rău, dar nu te mai poate ajuta.

# Dialogue_AARaven0
source: And what about the Realm of the wizards? They did not go mad yet, did they?
ro: Și cum rămâne cu tărâmul vrăjitorilor? Nu au înnebunit încă, nu?

# Dialogue_AARaven0
source: Focus on what you have to do and you will find the real you.
ro: Concentrează-te pe ceea ce trebuie să faci și vei găsi adevăratul.

# Dialogue_AARaven0
source: This is stupid
ro: Este o prostie

# Dialogue_AARaven0
source: Raven thinks freedom is such an empty word.
ro: Corbul crede că libertatea este un cuvânt atât de gol.

# Dialogue_AARaven0
source: Almost there!
ro: Aproape acolo!

# Dialogue_AARaven0
source: You are not listening to Raven's words!
ro: Nu asculți cuvintele Corbului!

# Dialogue_AARaven0
source: Even so, Raven will tell you a bit.
ro: Chiar și așa, Corbul vă va spune un pic.

# Dialogue_AARaven0
source: You know what? Raven totally agrees with that!
ro: Știi ce? Corbul este total de acord cu asta!

# Dialogue_AARaven0
source: The later we met the more time the World survived, didn't it?
ro: Cu cât ne-am întâlnit mai târziu, cu cât lumea a supraviețuit, nu?

# Dialogue_AARaven0
source: At first, lands lose their colours, people go mad... and then, everything breaks into shards until solely hollowness remains...
ro: La început, pământurile își pierd culorile, oamenii înnebunesc ... și apoi, totul se rupe în cioburi până când rămâne exclusiv lipsa de spațiu...

# Dialogue_AARaven0
source: If the end is near, there is no point in making long term plans.
ro: Dacă sfârșitul este aproape, nu are rost să faceți planuri pe termen lung.

# Dialogue_AARaven0
source: We all have a purpose in life.
ro: Cu toții avem un scop în viață.

# Dialogue_AARaven0
source: Private business? All right! We might have different motivations, however working together could be fruitful.
ro: Afaceri private? In regula! S-ar putea să avem motivații diferite, cu toate acestea colaborarea poate fi roditoare.

# Dialogue_AARaven0
source: Forget it, I'm on my way now.
ro: Uită-l, acum sunt pe drum.

# Dialogue_AARaven0
source: What else should Raven tell you?
ro: Ce altceva ar trebui să vă spună Corbul?

# Dialogue_AARaven0
source: Farewell compeer until you meet Raven again!
ro: Adio tovarășe până când veți întâlni din nou pe Corb!

# Dialogue_AARaven0
source: The task is of high complexity.
ro: Sarcina are o complexitate ridicată.

# Dialogue_AARaven0
source: Is there anything else for Raven?
ro: Mai este ceva pentru Corb?

# Dialogue_AARaven0
source: Raven used to like being a bird, but now he has no other choice. He must embrace what he became.
ro: Corbului îi plăcea să fie o pasăre, dar acum nu mai are de ales. El trebuie să îmbrățișeze ceea ce a devenit.

# Dialogue_AARaven0
source: We'd rather have some fun before it's all over.
ro: Mai bine am prefera să ne distrăm înainte să se termine.

# Dialogue_AARaven0
source: Krrr... Raven notices that you've found the Gem!
ro: Krrr ... Corbul observă că ai găsit Bijuteria!

# Dialogue_AARaven0
source: Let Raven tell you something:
ro: Lasă Corbul să-ți spună ceva:

# Dialogue_AARaven0
source: Nevermind. Raven is kidding.
ro: Nu contează. Corbul glumește.

# Dialogue_AARaven0
source: Hopeless...
ro: Fără speranță...

# Dialogue_AARaven0
source: What?
ro: Ce?

# Dialogue_AARaven0
source: About wizards
ro: Despre vrăjitori

# Dialogue_AARaven0
source: How can I know that if you don't do it?
ro: Cum pot ști asta dacă nu o faci?

# Dialogue_AARaven0
source: They don't believe that Ruin can affect their World. They say that it has no effect.
ro: Ei nu cred că Ruina le poate afecta Lumea. Ei spun că nu are niciun efect.

# Dialogue_AARaven0
source: Go now! Raven needs to think.
ro: Mergi acum! Corbul trebuie să se gândească.

# Dialogue_AARaven0
source: You were a bird once. Then you became something else.
ro: Ai fost o pasăre odată. Atunci ai devenit altceva.

# Dialogue_AARaven0
source: Don't know
ro: Nu stiu

# Dialogue_AARaven0
source: Raven knows what his task is. Do you know yours?
ro: Corbul știe care este sarcina lui. Îl cunoști pe al tău?

# Dialogue_AARaven0
source: Got it? Free like a bird! Ha-ha-ha!
ro: Ai înțeles? Liber ca o pasăre! Ha-ha-ha!

# Dialogue_AARaven0
source: Raven is doing this because this is what he is.
ro: Corbul face asta pentru că acesta este ceea ce este el.

# Dialogue_AARaven0
source: Maybe.
ro: Poate.

# Dialogue_AARaven0
source: That’s over now. This time it's for private business.
ro: Asta s-a terminat acum. Acest timp este pentru afaceri private.

# Dialogue_AARaven0
source: I want to be free again!
ro: Vreau să fiu liber din nou!

# Dialogue_AARaven0
source: I would like to go home.
ro: Aș dori să mă întorc acasă.

# Dialogue_AARaven0
source: You still haven't found the Gem.
ro: Încă nu ai găsit Bijuteria.

# Dialogue_AARaven0
source: Let's talk about something else!
ro: Hai sa vorbim despre altceva!

# Dialogue_AARaven0
source: If you can't fulfill your task, then maybe your master should look for a better servant.
ro: Dacă nu îți poți îndeplini sarcina, atunci poate că stăpânul tău ar trebui să caute un servitor mai bun.

# Dialogue_AARaven0
source: Yes?
ro: Da?

# Dialogue_AARaven0
source: No thanks! I'm on my way now.
ro: Nu mulțumesc! Acum sunt pe drum.

# Dialogue_AARaven0
source: The gate is open!
ro: Poarta este deschisă!

# Dialogue_AARaven0
source: Go home
ro: Du-te acasă

# Dialogue_AARaven0
source: So why not open the gate?
ro: Atunci de ce să nu deschidem poarta?

# Dialogue_AARaven0
source: What can you tell me about the Ruined Realm?
ro: Ce îmi puteți spune despre tărâmul ruinat?

# Dialogue_AARaven0
source: You failed to see the meaning behind Raven's thoughts.
ro: Nu ai reușit să vezi sensul din spatele gândurilor la Corb.

# Dialogue_AARaven0
source: We'll see.
ro: Vom vedea.

# Dialogue_AARaven0
source: Maybe you are wiser than Raven, but that's just a thought, little spirit.
ro: Poate că ești mai înțelept decât Corbul, dar acesta este doar un gând, un spirit mic.

# Dialogue_AARaven0
source: Raven doesn't believe it's true.
ro: Corbul nu crede că este adevărat.

# Dialogue_AARaven0
source: Just look at Raven! He's free like a bird.
ro: Uită-te la Corb! E liber ca o pasăre.

# Dialogue_AARaven0
source: I’m in.
ro: Mă bag.

# Dialogue_AARaven0
source: Raven notices that the gem is just as dull as before. Why did you return then?
ro: Corbul observă că bijuteria este la fel de plictisitoare ca înainte. De ce te-ai întors atunci?

# Dialogue_AARaven0
source: Agree
ro: De Acord

# Dialogue_AARaven0
source: And what's the truth?
ro: Și care este adevărul?

# Dialogue_AARaven0
source: Finally! From now on you won't need Raven anymore.
ro: Într-un final! De acum nu va mai avea nevoie de Corb.

# Dialogue_AARaven0
source: Find the other Chargers and return to Raven when you are done.
ro: Găsește celelalte încărcătoare și revin-o la Corb când ai terminat.

# Dialogue_AARaven0
source: Raven notices that you already have the Gem.
ro: Corbul observă că ai deja Bijuteria.

# Dialogue_AARaven0
source: About my purpose...
ro: Despre scopul meu ...

# Dialogue_AARaven0
source: He is a volunteer
ro: El este un voluntar

# Dialogue_AARaven0
source: I don't know what to do. I can't remember anything from my previous life.
ro: Nu știu ce să fac. Nu-mi amintesc nimic din viața mea anterioară.

# Dialogue_AARaven0
source: All right, I go then.
ro: Bine, merg apoi.

# Dialogue_AARaven0
source: Not interested
ro: Nu sunt interesat

# Dialogue_AARaven0
source: To activate the locking mechanism we need an infused Lock Gem.
ro: Pentru a activa mecanismul de blocare avem nevoie de o Bijutier de Lacăt înfuzată.

# Dialogue_AARaven0
source: So you are obeying because... that's the only thing that you can do?
ro: Deci te supui pentru că ... acesta este singurul lucru pe care îl poți face?

# Dialogue_AARaven0
source: It would make sense to try to save the world, wouldn't it?
ro: Ar avea sens să încerci să salvezi lumea, nu-i așa?

# Dialogue_AARaven0
source: Raven doesn't care about what he could do. Raven cares about what he does.
ro: Corbului nu-i pasă de ce ar putea face. Corbului îi pasă de ceea ce face.

# Dialogue_AARaven0
source: That's not too reassuring...
ro: Nu este prea liniștitor ...

# Dialogue_AARaven0
source: We shouldn't waste any more time on this.
ro: Nu trebuie să pierdem mai mult timp în acest sens.

# Dialogue_AARaven0
source: Except for a few paranoid ones, like your master.
ro: Cu excepția câtorva paranoici, cum ar fi stăpânul tău.

# Dialogue_AARaven0
source: Searching for a way to open this gate with the help of a talking Ball is so much fun!
ro: Căutarea unui mod de a deschide această poartă cu ajutorul unei mingi vorbitoare este atât de distractiv!

# Dialogue_AARaven0
source: Raven will venture deeper into the Ruined Realm!
ro: Corbul se va aventura mai adânc pe Tărâmul Ruinat!

# Dialogue_AARaven0
source: Raven agrees.
ro: Corbul este de acord.

# Dialogue_AARaven0
source: I hope that won't be too soon...
ro: Sper că nu va fi prea curând ...

# Dialogue_AARaven0
source: Do you mean that you are serving your wizard by your own will?
ro: Vrei să spui că îți slujești vrăjitorul după propria voință?

# Dialogue_AARaven0
source: But there is still so much left to do...
ro: Dar mai rămân atât de multe de făcut ...

# Dialogue_AARaven0
source: Raven Servant?
ro: Servitorul corbului?

# Dialogue_AARaven0
source: Except if we meet in the Afterworld.
ro: Cu excepția cazului în care ne întâlnim în lumea de Apoi.

# Dialogue_AARaven0
source: Raven servant?
ro: Servitorul corbului?

# Dialogue_AARaven0
source: Your master seeks to stop it no matter the price he has to pay.
ro: Stăpânul tău încearcă să îl oprească indiferent de prețul pe care trebuie să îl plătească.

# Dialogue_AARaven0
source: Tabby has retired. What did you come for?
ro: Tabby s-a retras. Pentru ce ai venit?

# Dialogue_AARaven0
source: Why are we messing with this door if the World is about to end?
ro: De ce ne facem de lucru cu această ușă dacă Lumea urmează să se termine?

# Dialogue_AARaven0
source: Obey? Raven doesn't obey.
ro: Supunere? Corbul nu se supune.

# Dialogue_AARaven0
source: Farewell then.
ro: Adio atunci.

# Dialogue_AGStatue
source: 'We are the elite of the Runic Realm. Our wisdom is great, our magic is strong.'
ro: „Suntem elita Tărâmului Runic. Înțelepciunea noastră este mare, magia noastră este puternică. '

# Dialogue_AGStatue
source: Looks like he was wrong...
ro: Se pare că a greșit ...

# Dialogue_AGStatue
source: 'We are Ceruleans! We do not escape!'
ro: „Suntem Ceruleans! Nu scăpăm! '

# Dialogue_AGStatue
source: 'Citizens of Cerulean! Do not join the poor of Grey Gate!'
ro: „Cetățeni din Cerulean! Nu vă alăturați săracilor de la Poarta Gri! '

# Dialogue_AGStatue
source: 'Ruin can’t harm us!'
ro: „Ruina nu ne poate face rău!”

# Dialogue_BeforeBoss
source: Maybe you should talk to the gnome or the Keeper.
ro: Poate ar trebui să vorbești cu Piticul sau cu Portarul.

# Dialogue_BeforeBoss
source: Using the portals here one could get into any part of the World in no time.
ro: Folosind portalurile de aici, poți ajunge în orice parte a lumii în cel mai scurt timp.

# Dialogue_BeforeBoss
source: This place was the base of the formal Ruined Realm.
ro: Acest loc a fost baza vechiului Tărâm Ruinat.

# Dialogue_BeforeBoss
source: I hope at least some of the portals still work.
ro: Sper că cel puțin unele dintre portaluri funcționează în continuare.

# Dialogue_BossArmourWrath
source: Keep away from my artefact little thief or I will crush you!
ro: Ține-te departe de artefactul meu micule hoț sau te voi zdrobi!

# Dialogue_BossArmourWrath
source: Listen, I really need that. What if I give you something instead?
ro: Ascultă, chiar am nevoie de asta. Ce se întâmplă dacă îți dau ceva în schimb?

# Dialogue_BossArmourWrath
source: I’m here for the artefact... could you give it to me?
ro: Sunt aici pentru artefactul ... mi-l puteți da?

# Dialogue_BossArmourWrath
source: That is mine!
ro: Asta e a mea!

# Dialogue_BossArmourWrath
source: Have you come to worship my perfection?
ro: Ai venit să te închini desăvârșirii mele?

# Dialogue_BossArmourWrath
source: Damn you and your perfection!
ro: La naiba cu tine și perfecțiunea ta!

# Dialogue_BossDwarvenStatue
source: I am all right! I am still keeping it back!
ro: Sunt in regulă! Încă o țin înapoi!

# Dialogue_BossDwarvenStatue
source: I am looking for an artefact...
ro: Caut un artefact ...

# Dialogue_BossDwarvenStatue
source: Do you...
ro: Tu...

# Dialogue_BossDwarvenStatue
source: Have the sculptors sent you?
ro: Te-a trimis sculptorii?

# Dialogue_BossDwarvenStatue
source: Go away! I hold it back!
ro: Pleacă de aici! O s-o rețin!

# Dialogue_BossDwarvenStatue
source: I have a bad feeling about this...
ro: Am o senzație proastă despre asta ...

# Dialogue_BossDwarvenStatue
source: He has one of the artefacts. You need to get it somehow.
ro: Are unul dintre artefacte. Trebuie să-l obți cumva.

# Dialogue_BossDwarvenStatue
source: Don’t come any closer! I’m still fine!
ro: Nu te apropia! Încă sunt bine!

# Dialogue_BossFallenDruid
source: You will never lay your hand on anything in this place!
ro: Nu vei pune niciodată mâna pe nimica din acest loc!

# Dialogue_BossFallenDruid
source: Actually I’m about to leave but I need the artefact first.
ro: De fapt, sunt pe cale să plec, dar mai întâi am nevoie de artefact.

# Dialogue_BossFallenDruid
source: I shall purge my forest from your kind! To hell with you creature!
ro: Îmi voi curățată pădurea de neamul tău! La dracu cu tine creatură!

# Dialogue_BossFallenDruid
source: Stay away from my sacred forests creature of Ruin!
ro: Stai departe de pădurile mele sacre creatură de Ruină!

# Dialogue_C3Fishy
source: Fishy will miss home.
ro: Peștelui îi va lipsa casa.

# Dialogue_C3Fishy
source: Raven will try to take us into the Human Realm.
ro: Corbul va încerca să ne ducă pe Tărâmul Uman.

# Dialogue_C3GateKeeper
source: I hope you will find us Worthy.
ro: Sper că ne veți găsi demni.

# Dialogue_C3GateKeeper
source: Welcome, my young Lord!
ro: Bine ați venit, tânărul meu Domn!

# Dialogue_C3GateKeeper
source: I heard this time you shall open a Gate for us.
ro: Am auzit că de data asta vei deschide o Poartă pentru noi.

# Dialogue_C3Gnory
source: I don’t want anything bad for business in the new Realm.
ro: Nu vreau nimic rău pentru afaceri în noul Tărâm.

# Dialogue_C3Gnory
source: Eh, you again?
ro: Eh, tu din nou?

# Dialogue_C3Gnory
source: A whole new World awaits for me and my shop.
ro: O lume cu totul nouă mă așteaptă pentru mine și magazinul meu.

# Dialogue_C3Gnory
source: If you can arrange it I would be more happy if we could leave Lory here.
ro: Dacă poți aranja, aș fi mult mai fericit dacă l-am putea lăsa aici pe Lory.

# Dialogue_C3Gnory
source: What a new opportunity! I don’t care about dwarves anymore.
ro: Ce oportunitate nouă! Nu-mi mai pasă de pitici.

# Dialogue_C3GolemMaker
source: I have to admit Ruin will win in the end.
ro: Trebuie să recunosc că Ruina va câștiga până la urmă.

# Dialogue_C3GolemMaker
source: I fought Ruin for hundreds of years.
ro: Am luptat cu Ruina timp de sute de ani.

# Dialogue_C3GolemMaker
source: I have a bad feeling about this all...
ro: Am o senzație proastă despre toate astea ...

# Dialogue_C3KoboldChef
source: So it will be ready anytime now.
ro: Deci va fi gata oricând.

# Dialogue_C3KoboldChef
source: According to the recipe I need to swirl the ingredients until the end of the World.
ro: Conform rețetei trebuie să învârt ingredientele până la sfârșitul Lumii.

# Dialogue_C3KoboldChef
source: This is a special soup.
ro: Aceasta este o supă specială.

# Dialogue_C3Lory
source: Without paying a single gold coin. How sad.
ro: Fără să plătească o singură monedă de aur. Ce trist.

# Dialogue_C3Lory
source: Hi, my dear Ball!
ro: Bună, draga mea Minge!

# Dialogue_C3Lory
source: Unfortunately I can't give you anything in return.
ro: Din păcate nu îți pot oferi nimica în schimb.

# Dialogue_C3Lory
source: Oh, thank you! Books always matter.
ro: Oh, mulțumesc! Cărțile contează întotdeauna.

# Dialogue_C3Lory
source: I hope I can open a new shop in the Human Realm.
ro: Sper să pot deschide un magazin nou pe Tărâmul Uman.

# Dialogue_C3Lory
source: I don't know if it still matters but I have these books for you.
ro: Nu știu dacă mai contează, dar am aceste cărți pentru tine.

# Dialogue_C3Lory
source: Unfortunately I have nothing at the store right now. Ha-ha...
ro: Din păcate, acum nu am nimic la magazin. Ha-ha ...

# Dialogue_C3Lory
source: No problem.
ro: Nici o problemă.

# Dialogue_C3Lory
source: Ruin took all my wares.
ro: Ruina mi-a luat toate lucrările.

# Dialogue_C3MerchAnt
source: Well I guess you don’t have many customer.
ro: Ei bine, cred că nu ai mulți clienți.

# Dialogue_C3MerchAnt
source: That’s only one man! I need three!
ro: Acesta este doar unul! Am nevoie de trei!

# Dialogue_C3MerchAnt
source: Buy name
ro: Cumpără nume

# Dialogue_C3MerchAnt
source: {name}? It still sounds a bit weird, but I think I might like it.
ro: {name}? Sună încă un pic ciudat, dar cred că mi-ar plăcea.

# Dialogue_C3MerchAnt
source: Wanderer
ro: Hoinar

# Dialogue_C3MerchAnt
source: A special offer for ya! Give me three Blue Gems and I’ll give ya the key!
ro: O ofertă specială pentru tine! Dă-mi trei Gemuri Albastre și îți voi da cheia!

# Dialogue_C3MerchAnt
source: Sure man!
ro: Desigur!

# Dialogue_C3MerchAnt
source: Who are you?
ro: Cine ești tu?

# Dialogue_C3MerchAnt
source: Fearsome! At least for what you will destroy.
ro: Înfricoșător! Cel puțin pentru ceea ce vei distruge.

# Dialogue_C3MerchAnt
source: Destroyer
ro: Distrugătorul

# Dialogue_C3MerchAnt
source: Don't buy
ro: Nu cumpăra

# Dialogue_C3MerchAnt
source: Don’t turn around I’m talking to ya big guy! Down here on the wood!
ro: Nu mă întorc, vorbesc cu tine tipule mare! Aici, pe lemn!

# Dialogue_C3MerchAnt
source: Back on topic: will ya buy something?
ro: Înapoi la subiect: vei cumpăra ceva?

# Dialogue_C3MerchAnt
source: C’mon man! Don’t just stand there tell me what ya want!
ro: Omule! Nu doar sta acolo, spune-mi ce vrei!

# Dialogue_C3MerchAnt
source: What’s wrong with ya man?
ro: Ce-i cu tine, omule?

# Dialogue_C3MerchAnt
source: You know transporting breadcrumbs, marching onto various directions, the usual things.
ro: Știi transportul pesmetul, mersul pe diverse direcții, lucrurile obișnuite.

# Dialogue_C3MerchAnt
source: I’m Merch Ant doin’ Microtransactions. I’ve just told ya.
ro: Sunt un Comerciant Furnică care face Microtransacții. Tocmai ți-am spus.

# Dialogue_C3MerchAnt
source: Trade
ro: Târguiește

# Dialogue_C3MerchAnt
source: Er... so who are you and what are you doing here?
ro: Deci ... cine ești și ce faci aici?

# Dialogue_C3MerchAnt
source: There is an iron door which blocks the path to the tower. Do you have something which opens it?
ro: Există o ușă de fier care blochează calea către turn. Ai ceva care o deschide?

# Dialogue_C3MerchAnt
source: Sure man! Microtransactions always work!
ro: Desigur! Microtransacțiile funcționează întotdeauna!

# Dialogue_C3MerchAnt
source: No man, we agreed on three!
ro: Nu omule, am fost de acord la trei!

# Dialogue_C3MerchAnt
source: Gate
ro: Poartă

# Dialogue_C3MerchAnt
source: Here is your Gem!
ro: Iată Bijuteria ta!

# Dialogue_C3MerchAnt
source: Sure man! I have some really cool ones for sale!
ro: Desigur! Am unele cu adevărat grozave de vânzare!
