Repository: Frank1eJohnson/Uwajimaya
Catalog: Content/Localization/UwajimayaDialogues/*/UwajimayaDialogues.po
Languages: ro

# Dialogue_Gnory
source: I see you do have a solution for everything.
ro: Văd că ai o soluție pentru tot.

# Dialogue_Gnory
source: Wow, that's magnificent!
ro: Uau, e minunat!

# Dialogue_Gnory
source: I want to buy a new name!
ro: Vreau să cumpăr un nume nou!

# Dialogue_Gnory
source: Fishy know a poem.
ro: Peștele știe o poezie.

# Dialogue_Gnory
source: How much do you charge for it?
ro: Cât ceri pentru asta?

# Dialogue_Gnory
source: Oh, holy golden coins please no...
ro: Oh, sfinte monede de aur, te rog nu ...

# Dialogue_Gnory
source: Tummm-dummm I would sell the whole World but who could possibly buy it? Uhhh... Yes?
ro: Tummm-dummm Aș vinde întreaga lume, dar cine ar putea să o cumpere? Uhhh ... Da?

# Dialogue_Gnory
source: Ultimate Frisbee
ro: Frisbee Final

# Dialogue_Gnory
source: Broken wheel?
ro: Roată spartă?

# Dialogue_Gnory
source: Take care and don't spend Gold anywhere else!
ro: Ai grijă și nu cheltui Aurul nicăieri în altă parte!

# Dialogue_Gnory
source: How about 10?
ro: Ce zici de 10?

# Dialogue_Gnory
source: Good choice!
ro: Bună alegere!

# Dialogue_Gnory
source: 11 Gold Coins! Take it or leave it that's my final offer!
ro: 11 monede de aur! Luați-o sau lăsați-o, aceasta este oferta mea finală!

# Dialogue_Gnory
source: Let him tell the poem!
ro: Lasă-l să spună poezia!

# Dialogue_Gnory
source: Then I found out there is a Dwarven Outpost here which is still populated.
ro: Apoi am aflat că există un Avanpost Pitic aici, care este încă populat.

# Dialogue_Gnory
source: In Crossroad Cave the three are close. Though where exactly? This poem shows: For the first one you need to be restless To avoid the Catacomb death traps. For the second you need to go down Deep until you reach the ancient fisher town. For the third one go high and even higher, Keep on til you reach the never sleeping fire.
ro: În Peștera Crossroad, cei trei sunt aproape. Deși unde exact? Acest poem arată: Pentru primul trebuie să fiți neliniștit Pentru a evita capcanele de moarte ala Catcombelor. Pentru a doua, trebuie să cobori Adânc până când ajungi în orașul pescar antic. Pentru cel de-al treilea merge mai sus și chiar mai sus, Continuă până ajungi la focul care nu doarme niciodată.

# Dialogue_Gnory
source: Sure. Shut up Fishy!
ro: Sigur. Taci Pește!

# Dialogue_Gnory
source: However business is business. She is bad for business! Trading with my customers before they could get to me!
ro: Cu toate acestea, afacerile sunt afaceri. Este proastă pentru afaceri! Tranzacționează cu clienții mei înainte să poată ajunge la mine!

# Dialogue_Gnory
source: Arrrgh! Fishy please no more poems! My head aches.
ro: Arrrgh! Pește, te rog, nu mai recita poezii! Mă doare capul.

# Dialogue_Gnory
source: Dr. who? Oh, see, Dr. Ball.
ro: Dr. Cine? Oh, vezi, Dr. Minge.

# Dialogue_Gnory
source: 8 Gold
ro: 8 Aur

# Dialogue_Gnory
source: It all started when I was back with my family. Oh, those peaceful moments!
ro: Totul a început când mă întorceam cu familia. O, acele momente pașnice!

# Dialogue_Gnory
source: It's yours for 8 Gold Coins.
ro: Este al tău pentru 8 monede de aur.

# Dialogue_Gnory
source: Well met dear err... traveler! How can a humble gnome merchant like me be at your service?
ro: Bine întâlnit dragă, călătorule! Cum poate un umil negustor pitic ca mine să vă stea la dispoziție?

# Dialogue_Gnory
source: Sure! She is the lovely lady ball for whom you would like to buy a precious present, right?
ro: Sigur! Este minunata minge doamnă pentru care ai vrea să cumperi un cadou prețios, nu?

# Dialogue_Gnory
source: Shut up!
ro: Taci!

# Dialogue_Gnory
source: Shut up both of you!
ro: Tăceți amândoi!

# Dialogue_Gnory
source: The three artefacts - by Fishy:
ro: Cele trei artefacte - de Pește:

# Dialogue_Gnory
source: I need a name
ro: Am nevoie de un nume

# Dialogue_Gnory
source: Of course! Are you lost in this hollow realm? Disappointed in all creature kind? Searching for a helpful hand? Not anymore!
ro: Desigur! Te-ai pierdut pe acest tărâm gol? Dezamăgit în toate tipurile de creaturi? Cauți o mână de ajutor? Nu mai!

# Dialogue_Gnory
source: Epic Sphero
ro: Sfera Epică

# Dialogue_Gnory
source: And Fishy is the primitive monster.
ro: Iar Fishy este monstrul primitiv.

# Dialogue_Gnory
source: My sister sold my brother, so I had enough money to set out.
ro: Sora mea mi-a vândut fratele, așa că am avut destui bani să-mi încep călătoria.

# Dialogue_Gnory
source: Do you know a girl called Lillian?
ro: Cunoști o fată care se numește Lillian?

# Dialogue_Gnory
source: Wake up! He is back!
ro: Trezește-te! El s-a întors!

# Dialogue_Gnory
source: Let’s talk about something else.
ro: Hai să vorbim despre altceva.

# Dialogue_Gnory
source: Bye!
ro: Pa!

# Dialogue_Gnory
source: I will tell her what I think about this that’s for sure!
ro: Îi voi spune ce cred despre asta, cu siguranță!

# Dialogue_Gnory
source: Hello again!
ro: Bună din nou!

# Dialogue_Gnory
source: Fare thee well!
ro: Noroc bun!

# Dialogue_Gnory
source: Forget your artefacts I have plenty of other valuable items instead!
ro: Uitați de artefacte. Am o mulțime de alte obiecte valoroase în schimb!

# Dialogue_Gnory
source: I guess you don’t know where they are...
ro: Presupun că nu știi unde sunt ...

# Dialogue_Gnory
source: Yet no one ever wanted to buy him for a single copper coin.
ro: Totuși, nimeni nu a vrut să-l cumpere pentru o singură monedă de cupru.

# Dialogue_Gnory
source: Uhhh... Yes?
ro: Uhhh ... Da?

# Dialogue_Gnory
source: Yes, yes that's it!
ro: Da, da, asta este!

# Dialogue_Gnory
source: It's yours for 10 Gold Coins.
ro: Este al tău pentru 10 monede de aur.

# Dialogue_Gnory
source: Now you can imagine those peaceful moments when they were all together.
ro: Acum îți poți imagina acele momente pașnice când erau împreună.

# Dialogue_Gnory
source: What... uhhh... me?
ro: Ce ... uhhh ... eu?

# Dialogue_Gnory
source: Artefacts
ro: Artefacte

# Dialogue_Gnory
source: Helpful hands of course and all kind of stuffs. Equip yourself. Once you get rid of all your gold, you won’t be alone anymore...
ro: Mâini utile bineînțeles și tot felul de lucruri. Echipează-te. După ce vei scăpa de tot aurul, nu vei mai fi singur ...

# Dialogue_Gnory
source: Yes, she is my beloved sister!
ro: Da, este sora mea iubită!

# Dialogue_Gnory
source: Hello there!
ro: Salutare!

# Dialogue_Gnory
source: Trade
ro: Comerț

# Dialogue_Gnory
source: If you could bring me a new wheel I would pay for it with shiny Gold coins!
ro: Dacă mi-ai putea aduce o roată nouă, aș plăti-o cu monede de aur strălucitoare!

# Dialogue_Gnory
source: Ok, I’ve got it.
ro: Bine, am înțeles.

# Dialogue_Gnory
source: Unfortunately I don't have enough gold.
ro: Din păcate nu am suficient aur.

# Dialogue_Gnory
source: Ha-ha-ha! You must be kidding that's ridiculously high!
ro: Ha-ha-ha! Trebuie să glumești asta este ridicol de mare!

# Dialogue_Gnory
source: 9 Gold I won't go any higher!
ro: 9 Aur nu voi merge mai sus!

# Dialogue_Gnory
source: That’s not fair. It would be a shame on me if I just robbed you like that!
ro: Nu este cinstit. Ar fi păcat pentru mine dacă te-aș jefui așa!

# Dialogue_Gnory
source: Who are you?
ro: Cine ești tu?

# Dialogue_Gnory
source: I am Gnory, traveler merchant. I wander the world, seeking rare items, secrets beneath dark doors, revealing truth of forg...
ro: Sunt Gnory, comerciant călător. Rătăcesc prin lume, căutând obiecte rare, secrete sub uși întunecate, dezvăluind adevărul uitării ...

# Dialogue_Gnory
source: She saw our Realm through cat eyes, The living fire, the dead ice. She cared, she took care of us all. What was ruined she made it whole. Then she left us, this is how it ended. Her own Realm also needed to be mended.
ro: Ea a văzut Tărâmul nostru prin ochii de pisică, Focul viu, gheața moartă. A avut grijă, a avut grijă de noi toți. Ce s-a stricat a făcut-o întreagă. Apoi ne-a părăsit, așa s-a încheiat. De asemenea, propriul ei tărâm trebuia să fie îngrijit.

# Dialogue_Gnory
source: I’m looking for three artefacts.
ro: Caut trei artefacte.

# Dialogue_Gnory
source: Not enough gold
ro: Nu este suficient aur

# Dialogue_Gnory
source: Good bye!
ro: La revedere!

# Dialogue_Gnory
source: How about 8?
ro: Ce zici de 8?

# Dialogue_Gnory
source: That's a weird name I have to admit.
ro: Acesta este un nume ciudat trebuie să recunosc.

# Dialogue_Gnory
source: 11 Gold I won't go any lower!
ro: 11 Aur nu mă duc mai jos!

# Dialogue_Gnory
source: Skip yack-yack
ro: Sari peste yack-yack

# Dialogue_Gnory
source: Fishy know her.
ro: Peștele o cunoaște.

# Dialogue_Gnory
source: Fortunately I had a loving family I could always count on. Since they are all merchants, they could easily help me out.
ro: Din fericire aveam o familie iubitoare pe care puteam conta întotdeauna. Deoarece sunt negustori, m-ar putea ajuta cu ușurință.

# Dialogue_Gnory
source: All right, no need to get angry! I can give you 9 Gold for it.
ro: Bine, nu e nevoie să te enervezi! Îți pot da 9 Aur pentru asta.

# Dialogue_Gnory
source: Show me what you have for sale!
ro: Arată-mi ce ai de vânzare!

# Dialogue_Gnory
source: Sell Wheel
ro: Vinde roată

# Dialogue_Gnory
source: No, she is...
ro: Nu, ea este..

# Dialogue_Gnory
source: All right, you won. I will give it for 9 Gold Coins.
ro: Bine, ai câștigat. O voi da pentru 9 monede de aur.

# Dialogue_Gnory
source: 10 Gold
ro: 10 Aur

# Dialogue_Gnory
source: I’m on a quest to find...
ro: Sunt în misiunea de a găsi ...

# Dialogue_Gnory
source: Deal! Here you go!
ro: Afacere! Poftim!

# Dialogue_Gnory
source: Go on
ro: Continuă

# Dialogue_Gnory
source: This was my chance to make a hit as a merchant but I didn’t have the resources for a journey this long.
ro: Aceasta a fost șansa mea să fac un hit ca comerciant, dar nu am avut resursele pentru o călătorie atât de lungă.

# Dialogue_Gnory
source: Do you call this a poem? Pathetic! Hardly any info and what a miserable structure! Shame on you Fishy!
ro: Numești asta o poezie? Jalnic! Aproape orice informație și ce structură mizerabilă! Rușine pe tine Pește!

# Dialogue_Gnory
source: That's a long and sad story...
ro: Aceasta este o poveste lungă și tristă ...

# Dialogue_HW_Candlestick
source: Even after mom passed the servants kept lighting the candles.
ro: Chiar și după ce mama a murit, slujitorii continuau să aprindă lumânările.

# Dialogue_HW_Candlestick
source: After Mom got sick she really feared darkness.
ro: După ce mama s-a îmbolnăvit, s-a temut cu adevărat de întuneric.

# Dialogue_HW_Candlestick
source: We always needed to light the hallway.
ro: Aveam întotdeauna nevoie să aprindem holul.

# Dialogue_HW_Exit
source: This door was really rusty.
ro: Această ușă era foarte ruginită.

# Dialogue_HW_Exit
source: I had to do something with it otherwise Father would have heard me.
ro: A trebuit să fac ceva cu asta altfel Tata m-ar fi auzit.

# Dialogue_HW_Exit
source: I used oil on this rusty door. I didn’t want to be heard.
ro: Am folosit ulei pe această ușă ruginită. Nu voiam să fiu auzit.

# Dialogue_HW_Explosion
source: What was this? I have to go back to check what happened!
ro: Ce a fost asta? Trebuie să mă întorc pentru a verifica ce s-a întâmplat!

# Dialogue_HW_FRDoor
source: I always wondered why.
ro: Mereu m-am întrebat de ce.

# Dialogue_HW_FRDoor
source: Father moved to his workroom and sealed this door.
ro: Tatăl s-a mutat în sala de lucru și a sigilat această ușă.

# Dialogue_HW_MRDoor
source: I felt I should have a last look before I go.
ro: Am simțit că ar trebui să arunc o ultimă privire înainte de a pleca.

# Dialogue_HW_MRDoor
source: Mom’s room looked just like it was when she was still alive.
ro: Camera mamei arăta exact ca atunci când era încă în viață.

# Dialogue_HW_Painting
source: Mom made this painting before she met Father.
ro: Mama a făcut acest tablou înainte să-l întâlnească pe Tata.

# Dialogue_HW_Stairs
source: I had to go really softly otherwise Father would have heard me.
ro: A trebuit să merg cu adevărat încet, altfel tatăl m-ar fi auzit.

# Dialogue_KoboldChef
source: Unfortunately I don't know where you can find them.
ro: Din păcate nu știu unde le poți găsi.

# Dialogue_KoboldChef
source: That’s a serious threat, I have to admit.
ro: Este o amenințare serioasă, trebuie să recunosc.

# Dialogue_KoboldChef
source: Yes I know her. She couldn’t come here so she sent her cat.
ro: Da o știu. Nu a putut veni aici așa că și-a trimis pisica.

# Dialogue_KoboldChef
source: Could you bring them to me?
ro: Ai putea să mi-o aduci?

# Dialogue_KoboldChef
source: Thanks!
ro: Mulțumesc!

# Dialogue_KoboldChef
source: I managed to defeat one group of the monsters.
ro: Am reușit să înving un grup de monștri.

# Dialogue_KoboldChef
source: Artefacts
ro: Artefacte

# Dialogue_KoboldChef
source: Purple Mushroom
ro: Ciupercă Mov

# Dialogue_KoboldChef
source: Uh... this was impressive!
ro: Uh ... asta a fost impresionant!

# Dialogue_KoboldChef
source: Well done!
ro: Foarte bine!

# Dialogue_KoboldChef
source: Anyway, if you give my Coin back I will apologize.
ro: Oricum, dacă îmi dai moneda înapoi, îmi voi cere scuze.

# Dialogue_KoboldChef
source: In theory if I add this to the soup...
ro: În teorie, dacă adaug asta la ciorbă...

# Dialogue_KoboldChef
source: Huh! Do you think chests are only there so that you can loot them?
ro: Huh! Crezi că cufărele sunt acolo doar pentru a le putea jefui?

# Dialogue_KoboldChef
source: Give back my Coin!
ro: Dă-mi înapoi moneda mea!

# Dialogue_KoboldChef
source: Purple Mushrooms. That’s the only mushroom which is purple. You can’t miss it.
ro: Ciuperci violet. Aceasta este singura ciupercă care este violet. Nu-l poți rata.

# Dialogue_KoboldChef
source: I saw that you opened my chest!
ro: Am văzut că mi-ai deschis cufărul!

# Dialogue_KoboldChef
source: We had the key of the Ancient Temple. According to our prophecies that will fall to Ruin last.
ro: Am avut cheia Templului Antic. Conform profețiilor noastre aceea va cădea la Ruină ultima.

# Dialogue_KoboldChef
source: Here you go!
ro: Poftim!

# Dialogue_KoboldChef
source: No problem. If I ever find one I will bring it to you.
ro: Nici o problema. Dacă voi găsi vreodată una, ți-l voi aduce.

# Dialogue_KoboldChef
source: I’m the chef and I’m making a soup.
ro: Eu sunt bucătarul și fac o ciorbă.

# Dialogue_KoboldChef
source: I know you are already hungry but the soup is zhongqi shan ready.
ro: Știu că ești deja flămând, dar ciorba nu este încă gata.

# Dialogue_KoboldChef
source: In return Lillian drew pictures for my tales.
ro: În schimb, Lillian a desenat imagini pentru poveștile mele.

# Dialogue_KoboldChef
source: I already have some...
ro: Am deja câteva ...

# Dialogue_KoboldChef
source: I won’t. And I won’t talk to you either.
ro: Nu voi face Și nici nu o să vorbesc nici cu voi.

# Dialogue_KoboldChef
source: Village
ro: Sat

# Dialogue_KoboldChef
source: Long ago we lived in peace and respected the ancestors. Even though they caused the Cataclysm.
ro: Cu mult timp în urmă, am trăit în pace și i-am respectat pe strămoși. Chiar dacă au provocat cataclismul.

# Dialogue_KoboldChef
source: Is this a village? Where are the others?
ro: Este acesta un sat? Unde sunt ceilalți?

# Dialogue_KoboldChef
source: They enslaved all the other tribes and forbid us to do our rituals.
ro: Au înrobit toate celelalte triburi și ne-au interzis să ne facem ritualurile.

# Dialogue_KoboldChef
source: You again? Take a seat until the soup is ready!
ro: Tu din nou? Ia loc până când supa este gata!

# Dialogue_KoboldChef
source: I’m looking for three artefacts. Do you know something about them?
ro: Caut trei artefacte. Ști ceva despre ele?

# Dialogue_KoboldChef
source: Take this! You deserve it.
ro: Ia asta! O meriți.

# Dialogue_KoboldChef
source: They used this village to produce Fishy slaves.
ro: Au folosit acest sat pentru a produce sclavi Pești.

# Dialogue_KoboldChef
source: Give back
ro: Dă înapoi

# Dialogue_KoboldChef
source: I see you have a lot of things here. Do you have something for sale?
ro: Văd că ai multe lucruri aici. Ai ceva de vânzare?

# Dialogue_KoboldChef
source: I've got to go now!
ro: Trebuie să plec acum!

# Dialogue_KoboldChef
source: Er... I don’t have it. But I will get it back I promise!
ro: Nu ... nu am. Dar o voi recupera înapoi promit!

# Dialogue_KoboldChef
source: I’m sorry, I didn’t know it was yours. There are chests like yours everywhere.
ro: Îmi pare rău, nu știam că este a ta. Există cufere ca ale tale peste tot.

# Dialogue_KoboldChef
source: Well, this morning. But there are some very special ingredients which make the cook time way shorter.
ro: Ei bine, în această dimineață. Există însă câteva ingrediente foarte speciale care fac ca gătitul să fie mai scurt.

# Dialogue_KoboldChef
source: Have no fear, I'll do it.
ro: Nu ai teamă, o voi face.

# Dialogue_KoboldChef
source: Yes, the soup! A very special recipe. It takes years to finish.
ro: Da, ciorba! O rețetă cu totul speciala. Durează ani până se pregătește.

# Dialogue_KoboldChef
source: Ah, it's you again.
ro: Ah, ești tu din nou.

# Dialogue_KoboldChef
source: Every time the cat came I told him a tale about the ancestors.
ro: De fiecare dată când venea pisica îi spuneam o poveste despre strămoși.

# Dialogue_KoboldChef
source: The soup still needs time.
ro: Ciorba mai are nevoie de timp.

# Dialogue_KoboldChef
source: This is yours.
ro: Asta e a noastră.

# Dialogue_KoboldChef
source: We decided to keep their knowledge in our rituals.
ro: Am decis să le păstrăm cunoștințele în ritualurile noastre.

# Dialogue_KoboldChef
source: And when did you start?
ro: Și când ai început?

# Dialogue_KoboldChef
source: That's wonderful!
ro: Asta e minunat!

# Dialogue_KoboldChef
source: You know I’m not really a trader but I might sell you some of them.
ro: Știi că nu sunt cu adevărat comerciant, dar aș putea să îți vând unii dintre ei.

# Dialogue_KoboldChef
source: No, I’m sorry.
ro: Nu îmi pare rău.

# Dialogue_KoboldChef
source: That would be great. I appreciate your kindness.
ro: Ar fi grozav. Eu apreciez bunătatea ta.

# Dialogue_KoboldChef
source: Soup
ro: Supă

# Dialogue_KoboldChef
source: Come back when you have my Coin.
ro: Întoarce-te când ai moneda mea.

# Dialogue_KoboldChef
source: Do you know a girl called Lillian?
ro: Cunoști o fată care se numește Lillian?

# Dialogue_KoboldChef
source: I banished some of the monsters.
ro: Am alungat o parte din monștri.

# Dialogue_KoboldChef
source: So you are making soup...
ro: Deci faci supă ...

# Dialogue_KoboldChef
source: Every year we made a pilgrimage to the Ancient Temple to express our respect to the ancestors.
ro: În fiecare an făceam un pelerinaj la Templul Antic pentru a ne exprima respectul față de strămoși.

# Dialogue_KoboldChef
source: then...
ro: apoi...

# Dialogue_KoboldChef
source: Why not? What do you need?
ro: De ce nu? De ce ai nevoie?

# Dialogue_KoboldChef
source: Who are you?
ro: Cine ești tu?

# Dialogue_KoboldChef
source: All right! I was just asking...
ro: In regulă! Doar întrebam...

# Dialogue_KoboldChef
source: But now Kobolds are wrathful. They make wars. They don’t respect anyone.
ro: Însă acum Kobolds sunt mânioși. Ei fac războaie. Nu respectă pe nimeni.

# Dialogue_KoboldChef
source: Kobolds are no longer good.
ro: Kobolds nu mai sunt buni.

# Dialogue_KoboldChef
source: I liked them very much.
ro: Mi-au plăcut foarte mult.

# Dialogue_KoboldChef
source: I don’t want to leave my kitchen.
ro: Nu vreau să-mi părăsesc bucătăria.

# Dialogue_KoboldChef
source: I think I banished all the monsters.
ro: Cred că am alungat toți monștrii.

# Dialogue_KoboldChef
source: What do you think honestly? You can just rob me and then come to have a chat?!
ro: Ce crezi sincer? Că poți să mă jefuiți și apoi să vii la vorbă ?!

# Dialogue_KoboldChef
source: Great. The lake is already more peaceful.
ro: Grozav. Lacul este deja mai pașnic.

# Dialogue_KoboldChef
source: This was the Village of my tribe. We lived here in peace.
ro: Acesta a fost Satul tribului meu. Am trăit aici în pace.

# Dialogue_KoboldChef
source: Accept
ro: Acceptă

# Dialogue_KoboldChef
source: That’s all.
ro: Asta e tot.

# Dialogue_KoboldChef
source: Hmm... it’s delicious. Here take some!
ro: Hmm ... este delicios. Aici ia!

# Dialogue_KoboldChef
source: If you came for soup you will need to wait a bit more!
ro: Dacă ai venit la ciorbă, va trebui să mai aștepți un pic!

# Dialogue_KoboldChef
source: Where is my Coin?
ro: Unde este moneda mea?

# Dialogue_KoboldChef
source: I can help you banish the monsters around the lake.
ro: Te pot ajuta să alungi monștrii din jurul lacului.

# Dialogue_KoboldChef
source: She was really curious about our rituals.
ro: Era cu adevărat curioasă despre ritualurile noastre.

# Dialogue_KoboldChef
source: I’ve found some Purple Mushroom!
ro: Am găsit o ciupercă purpuriu!

# Dialogue_KoboldChef
source: I'm glad that the lake is peaceful again. Thank you!
ro: Mă bucur că lacul este din nou pașnic. Mulțumesc!

# Dialogue_KoboldChef
source: Now they are gone and I'm alone with the monsters they left here.
ro: Acum au dispărut și sunt singur cu monștrii pe care i-au lăsat aici.

# Dialogue_KoboldChef
source: But then other Kobolds came. They called themselves the Great Kobols.
ro: Dar apoi au venit și alți Kobolds. S-au numit ei Mari Koboli.

# Dialogue_KoboldChef
source: And also take this! I could have not done the soup in time without your help.
ro: Și ia și asta! Nu aș fi putut face supa la timp fără ajutorul tău.

# Dialogue_KoboldChef
source: Trade
ro: Târguiește

# Dialogue_KoboldChef
source: I have something for you.
ro: Am ceva pentru tine.

# Dialogue_KoboldChef
source: Now they are both gone.
ro: Acum sunt amândoi dispăruți.

# Dialogue_KoboldChef
source: Don't give
ro: Nu da

# Dialogue_KoboldChef
source: Decline
ro: Refuză

# Dialogue_KoboldChef
source: Banish Monsters
ro: Alungă Monștrii

# Dialogue_KoboldChef
source: Leave
ro: Pleacă

# Dialogue_KoboldChef
source: I’m the last of my tribe.
ro: Sunt ultimul din tribul meu.

# Dialogue_KoboldChef
source: Who are you? What are you doing here?
ro: Cine ești tu? Ce faci aici?

# Dialogue_KoboldChef
source: What are you Kobolds like? What are you doing?
ro: Ce le place la Kobolds? Ce faci?

# Dialogue_LB_Device
source: Monk wanted me to use this device to separate the Worlds.
ro: Călugărul voia să folosesc acest dispozitiv pentru a separa Lumile.

# Dialogue_LB_Device
source: With Father we did all we could to make the device perfect. I won’t let us lose so close to the end!
ro: Cu Tatăl am făcut tot ce am putut pentru ca dispozitivul să fie perfect. Nu ne vom lăsa să pierdem atât de aproape de sfârșit!

# Dialogue_LB_Device
source: I need to pull the left lever first.
ro: Mai întâi trebuie să trag maneta stângă.

# Dialogue_LB_DeviceUse
source: Er... so far pulling the levers worked but this machine looks fairly complicated.
ro: Până acum, tragerea manetelor a funcționat, dar acest aparat pare destul de complicat.

# Dialogue_LB_DeviceUse
source: I should look around to find some instructions on how it works.
ro: Ar trebui să mă uit în jur pentru a găsi câteva instrucțiuni despre cum funcționează.

# Dialogue_LB_LeftLever
source: I heard them knocking on the door. They surely heard the alarm when I entered.
ro: I-am auzit bătând la ușă. Cu siguranță au auzit alarma când am intrat.

# Dialogue_LB_LeftLever
source: I need to hurry. The middle lever is the next one.
ro: Trebuie să mă grăbesc. Maneta din mijloc este următoarea.

# Dialogue_LB_MiddleLever
source: We both made our decision three years ago.
ro: Amândoi ne-am luat decizia acum trei ani.

# Dialogue_LB_MiddleLever
source: I’ve made my choice.
ro: Am ales alegerea mea.
