Repository: Frank1eJohnson/Uwajimaya
Catalog: Content/Localization/UwajimayaDialogues/*/UwajimayaDialogues.po
Languages: ro

# Dialogue_DlgGolemMaker
source: The end is close, yet knowing what I am makes my last days brighter.
ro: Finalul este aproape, dar știind ce sunt îmi fac ultimele zile mai luminoase.

# Dialogue_DlgGolemMaker
source: Not my business
ro: Nu e treaba mea

# Dialogue_DlgGolemMaker
source: Do you know a girl called Lillian?
ro: Cunoașteți o fată care se numește Lillian?

# Dialogue_DlgGolemMaker
source: Memory Crystals? Can I touch them?
ro: Cristale de memorie? Pot să le ating?

# Dialogue_DlgGolemMaker
source: You will find it if you reach the top of the Main Tower.
ro: O vei găsi dacă ajungi în vârful Turnului Principal.

# Dialogue_DlgGolemMaker
source: I don't know... I'm forced to do tasks for a wizard. I'm lost and confused.
ro: Nu știu ... sunt obligat să fac sarcini pentru un vrăjitor. Sunt pierdut și confuz.

# Dialogue_DlgGolemMaker
source: Look, I have more crystals.
ro: Uite, am mai multe cristale.

# Dialogue_DlgGolemMaker
source: This is really not my problem. All I care about is to complete my task and go on my way.
ro: Aceasta nu este problema mea. Tot ce îmi pasă este să-mi completez sarcina și să merg pe drumul meu.

# Dialogue_DlgGolemMaker
source: I can no longer open a gate to the Unknown Realm.
ro: Nu mai pot deschide o poartă către Tărâmul Necunoscut.

# Dialogue_DlgGolemMaker
source: If you can summon Spirits you surely know a way to get me home.
ro: Dacă poți chema spirite, sigur ști o modalitate de a mă duce acasă.

# Dialogue_DlgGolemMaker
source: I won’t work with anything else.
ro: Nu voi lucra cu altceva.

# Dialogue_DlgGolemMaker
source: Bronze key
ro: Cheie din bronz

# Dialogue_DlgGolemMaker
source: I can’t remember.
ro: Nu-mi amintesc.

# Dialogue_DlgGolemMaker
source: Making Golems?
ro: Creezi Golemi?

# Dialogue_DlgGolemMaker
source: Thank you Spirit! I will be forever in your debt.
ro: Mulțumesc Spirit! Voi fi pentru totdeauna în datoria ta.

# Dialogue_DlgGolemMaker
source: It's done. They are destroyed.
ro: Este gata. Sunt distruse.

# Dialogue_DlgGolemMaker
source: There is some kind of a connection between Ruin and the Spirits.
ro: Există un fel de legătură între Ruină și Spirite.

# Dialogue_DlgGolemMaker
source: A spirit of the Unknown was summoned here by a Wizard of another world.
ro: Un spirit al Necunoscutului a fost chemat aici de către un vrăjitor al altei lumi.

# Dialogue_DlgGolemMaker
source: Yet now the only important thing is to finish my golems.
ro: Acum, singurul lucru important este să-mi termin golemii.

# Dialogue_DlgGolemMaker
source: Get me home!
ro: Du-mă acasă!

# Dialogue_DlgGolemMaker
source: New body for me
ro: Corp nou pentru mine

# Dialogue_DlgGolemMaker
source: Wait a minute! I’ll make something special for you.
ro: Așteptă un minut! Voi face ceva special pentru tine.

# Dialogue_DlgGolemMaker
source: Yes, now I remember. Thank you little Spirit for giving my memories back.
ro: Da, acum îmi amintesc. Mulțumesc spirit mic pentru că mi-am dat amintirile înapoi.

# Dialogue_DlgGolemMaker
source: Copper Key
ro: Cheie de cupru

# Dialogue_DlgGolemMaker
source: Even without my memories I liked to talk to her.
ro: Chiar și fără amintirile mele mi-a plăcut să vorbesc cu ea.

# Dialogue_DlgGolemMaker
source: They will fall
ro: Vor cădea

# Dialogue_DlgGolemMaker
source: Please, leave me alone now.
ro: Te rog, lasă-mă în pace acum.

# Dialogue_DlgGolemMaker
source: I can fix it!
ro: Pot s-o rezolv!

# Dialogue_DlgGolemMaker
source: How do you make Golems then?
ro: Cum faci Golemi atunci?

# Dialogue_DlgGolemMaker
source: I’m looking for three artefacts. Do you know something about them?
ro: Caut trei artefacte. Ști ceva despre ele?

# Dialogue_DlgGolemMaker
source: We created too many of them. Always new ones. We forgot about the old ones.
ro: Am creat prea mulți. Întotdeauna alții noi. Am uitat de cei vechi.

# Dialogue_DlgGolemMaker
source: You wonder if Ruin will destroy their World as well...
ro: Te întrebi dacă și Ruina le va distruge Lumea ...

# Dialogue_DlgGolemMaker
source: What do you need?
ro: De ce ai nevoie?

# Dialogue_DlgGolemMaker
source: Thank you!
ro: Mulțumesc!

# Dialogue_DlgGolemMaker
source: I think these crystals have something to do with you.
ro: Cred că aceste cristale au ceva de-a face cu tine.

# Dialogue_DlgGolemMaker
source: It shall be done.
ro: Se va face.

# Dialogue_DlgGolemMaker
source: I’m sorry but I can’t help you.
ro: Îmi pare rău, dar nu te pot ajuta.

# Dialogue_DlgGolemMaker
source: Knowledge lost. We are lost.
ro: Cunoașterea pierdută. Ne-am pierdut.

# Dialogue_DlgGolemMaker
source: It's nothing. Here it is.
ro: Nu-i nimic. Aici este.

# Dialogue_DlgGolemMaker
source: No.
ro: Nu.

# Dialogue_DlgGolemMaker
source: They can't work together even if they share the same goal.
ro: Nu pot lucra împreună chiar dacă au același obiectiv.

# Dialogue_DlgGolemMaker
source: What do you mean by 'your creations'?
ro: Ce vrei să spui prin „creațiile tale”?

# Dialogue_DlgGolemMaker
source: The Armour Wrath is no more.
ro: Armura Mâniei nu mai este.

# Dialogue_DlgGolemMaker
source: Your creation?
ro: Creația ta?

# Dialogue_DlgGolemMaker
source: Leave
ro: Pleacă

# Dialogue_DlgGolemMaker
source: I don’t think I will manage though. It’s already too late. But there is no reason to give up either.
ro: Nu cred însă că voi reuși. E deja prea târziu. Dar nu există niciun motiv să renunți.

# Dialogue_DlgGolemMaker
source: Is there a way I can help you?
ro: Există un mod în care te pot ajuta?

# Dialogue_DlgGolemMaker
source: More Crystal? That's very kind.
ro: Mai mult cristal? E foarte drăguț.

# Dialogue_DlgGolemMaker
source: I have found one more crystal.
ro: Am mai găsit încă un cristal.

# Dialogue_DlgGolemMaker
source: I’ll see what I can do.
ro: Voi vedea ce pot face.

# Dialogue_DlgGolemMaker
source: I’ve already destroyed them.
ro: Le-am distrus deja.

# Dialogue_DlgGolemMaker
source: I try to create the perfect Golem. The one which resists Ruin.
ro: Încerc să creez Golemul perfect. Cel care rezistă la Ruină.

# Dialogue_DlgGolemMaker
source: Some of them are still out there.
ro: Unii dintre ei sunt încă acolo.

# Dialogue_DlgGolemMaker
source: Like you?
ro: Ca și tine?

# Dialogue_DlgGolemMaker
source: I don’t know why but I feel in some way you are bound to her.
ro: Nu știu de ce, dar simt într-un fel că ești legat de ea.

# Dialogue_DlgGolemMaker
source: A Wizard? So now the Human Realm's people are messing with Golem Technology.
ro: Un Vrăjitor? Acum, oamenii Regatului Uman se joacă cu Tehnologia Golemilor.

# Dialogue_DlgGolemMaker
source: It’s not safe for me to walk outside.
ro: Nu este sigur pentru mine să ies afară.

# Dialogue_DlgGolemMaker
source: You mean Ruin
ro: Vrei să spui Ruina

# Dialogue_DlgGolemMaker
source: Spirit in a ball
ro: Spiritul într-o minge

# Dialogue_DlgGolemMaker
source: Now there is only a few missing.
ro: Acum lipsesc doar câțiva.

# Dialogue_DlgGolemMaker
source: That is me. And what are you creature?
ro: Acela sunt eu. Și ce ești tu creatură?

# Dialogue_DlgGolemMaker
source: Getting back some of my lost knowledge also makes me feel happy.
ro: Dacă îmi iau înapoi o parte din cunoștințele mele pierdute mă face să mă simt fericit.

# Dialogue_DlgGolemMaker
source: Metal binds the will of the spirits. Rock is a bit less cruel but still weakens your will.
ro: Metalul leagă voința spiritelor. Piatra este ceva mai puțin crudă, dar îți slăbește totuși voința.

# Dialogue_DlgGolemMaker
source: Yes, they bring back some of my memories.
ro: Da, adu-mi înapoi unele amintiri.

# Dialogue_DlgGolemMaker
source: Come back when you found all of them.
ro: Întoarce-te când le-ai găsit pe toate.

# Dialogue_DlgGolemMaker
source: It's only me trying to recreate the perfect Golem.
ro: Doar eu încerc să recreez Golemul perfect.

# Dialogue_DlgGolemMaker
source: One of the artefacts is close.
ro: Unul dintre artefacte este aproape.

# Dialogue_DlgGolemMaker
source: That won't happen.
ro: Nu se va întâmpla asta.

# Dialogue_DlgGolemMaker
source: There is nothing else I could say. See you later!
ro: Nu puteam spune nimic altceva. Ne vedem mai târziu!

# Dialogue_DlgGolemMaker
source: Why are you making Golems? What would you like to achieve?
ro: De ce faci Golemi? Ce ai vrea să obții?

# Dialogue_DlgGolemMaker
source: Armour Wrath
ro: Armura Mâniei

# Dialogue_DlgGolemMaker
source: Do you need help?
ro: Ai nevoie de ajutor?

# Dialogue_DlgGolemMaker
source: Yes.
ro: Da.

# Dialogue_DlgGolemMaker
source: Destroy them if you can.
ro: Distrugeți dacă poți.

# Dialogue_DlgGolemMaker
source: Didn't look too intelligent to me...
ro: Nu mi s-a părut prea inteligent ...

# Dialogue_DlgGolemMaker
source: I could but I don’t think you would like it.
ro: Aș putea, dar nu cred că ți-ar plăcea.

# Dialogue_DlgGolemMaker
source: With this last one I have all my memories back.
ro: Cu aceasta utimul mi-am revenit toate amintirile.

# Dialogue_DlgGolemMaker
source: I wonder if they will end like us.
ro: Mă întreb dacă se vor termina ca noi.

# Dialogue_DlgGolemMaker
source: Though I forgot the reason.
ro: Deși am uitat motivul.

# Dialogue_DlgGolemMaker
source: Could you create a stronger body for me?
ro: Ai putea crea un corp mai puternic pentru mine?

# Dialogue_DlgGolemMaker
source: Thank you! I remember more and more.
ro: Mulțumesc! Îmi amintesc din ce în ce mai mult.

# Dialogue_DlgGolemMaker
source: Bring me more so that I can remember!
ro: Adu-mi mai mult, ca să-mi amintesc!

# Dialogue_DlgGolemMaker
source: Let me touch it! Hmmm...
ro: Lasă-mă să o ating! Hmmm ...

# Dialogue_DlgGolemMaker
source: What happened to you?
ro: Ce ți s-a întâmplat?

# Dialogue_DlgGolemMaker
source: She was from the Human Realm. I liked her better than the other human.
ro: Era din tărâmul uman. Mi-a plăcut mai bine decât celălalt om.

# Dialogue_DlgGolemMaker
source: Yes, I felt his presence disappearing.
ro: Da, am simțit prezența lui dispărând.

# Dialogue_DlgGolemMaker
source: Now I have all my memories back.
ro: Acum îmi amintesc toate amintirile.

# Dialogue_DlgGolemMaker
source: I’ve destroyed the Golems near the Tomb.
ro: Am distrus Golemii de lângă Mormânt.

# Dialogue_DlgGolemMaker
source: They are doomed.
ro: Sunt sortiți.

# Dialogue_DlgGolemMaker
source: I try to create an Essence which resists Ruin. If it works it could stop Ruin.
ro: Încerc să creez o Esență care rezistă ruinei. Dacă funcționează, ar putea opri Ruina.

# Dialogue_DlgGolemMaker
source: What are you creature?
ro: Ce ești tu creatură?

# Dialogue_DlgGolemMaker
source: Metal is good for spirits. Even rock is dangerous.
ro: Metalul este bun pentru spirite. Chiar și piatra este periculoasă.

# Dialogue_DlgGolemMaker
source: Memory Crystals
ro: Cristale de Memorie

# Dialogue_DlgGolemMaker
source: Here, take this! It might help if you need to face my creature!
ro: Aici, ia asta! S-ar putea să te ajute dacă ai nevoie să înfrunți creatura mea!

# Dialogue_DlgGolemMaker
source: No way home.
ro: Nici o cale spre casă.

# Dialogue_DlgGolemMaker
source: I reuse the old golems. Maybe that’s why I can’t succeed.
ro: Reutilizez golemi vechi. Poate de aceea nu pot reuși.

# Dialogue_DlgGolemMaker
source: Could you merge these iron pieces?
ro: Ai putea îmbina aceste bucăți de fier?

# Dialogue_DlgGolemMaker
source: Here it is!
ro: Aici este!

# Dialogue_DlgGolemMaker
source: Iron Key
ro: Cheia de Fier

# Dialogue_DlgGolemMaker
source: There are too many unsuccessful golems.
ro: Există prea mulți golemi nereușiți.

# Dialogue_DlgGolemMaker
source: Your words remind me of something. Something which was important.
ro: Cuvintele tale îmi amintesc de ceva. Ceva important.

# Dialogue_DlgGolemMaker
source: One is guarded by my worst creation.
ro: Unul este păzit de cea mai proastă creație a mea.

# Dialogue_DlgGolemMaker
source: She were... She said...
ro: A fost ... A spus ...

# Dialogue_DlgGolemMaker
source: Look at this!
ro: Uită-te la asta!

# Dialogue_DlgGolemMaker
source: I create golems. You go on with your quest. Nothing else matters.
ro: Eu Creez golemi. Continuă cu căutarea ta. Altceva nu contează.

# Dialogue_DlgGolemMaker
source: Ruin caused too much damage.
ro: Ruina a provocat pagube prea mari.

# Dialogue_DlgGolemMaker
source: You are right. We are what we do. That keeps us alive.
ro: Ai dreptate. Suntem ceea ce facem. Asta ne ține în viață.

# Dialogue_DlgGolemMaker
source: I'm glad you managed to defeat him and yet...
ro: Mă bucur ca ai reușit sa îl învingi și totuși ...

# Dialogue_DlgGolemMaker
source: One more Crystal for you!
ro: Încă un Cristal pentru tine!

# Dialogue_DlgGolemMaker
source: I know what you are up to. I would like to help but I fear I can’t do much.
ro: Știu ce faci. Aș dori să ajut, dar mă tem că nu pot face multe.

# Dialogue_DlgGolemMaker
source: I create Golems. I always did. I designed the most intelligent ones.
ro: Eu creez Golemi. Întotdeauna am făcut-o. Le-am proiectat pe cele mai inteligente.

# Dialogue_DlgGolemMaker
source: There are some seeking a way to stop Ruin. They don't care about using spirits as slaves.
ro: Există unii care caută o modalitate de a opri Ruina. Nu le pasă să folosească spiritele ca sclavi.

# Dialogue_DlgGolemMaker
source: And this is for you!
ro: Și asta este pentru tine!

# Dialogue_DlgGolemMaker
source: Do you mean those moving rock things out there?
ro: Vrei să spui ca pietrele alea care se mișcă acolo?

# Dialogue_DlgGolemMaker
source: She had heart, she cared about what’s going on here. For the others we were like some interesting study.
ro: Avea inimă, îi păsa de ce se întâmplă aici. Pentru ceilalți am fost ca un studiu interesant.

# Dialogue_DlgGolemMaker
source: As for other materials I have no experience. Trust me you don’t want me to test out something on you for the first time.
ro: Cât despre alte materiale nu am experiență. Crede-mă că nu vrei să testez ceva pe tine pentru prima dată.

# Dialogue_DlgGolemMaker
source: Knowledge is lost. We are all lost.
ro: Cunoașterea este pierdută. Cu toții suntem pierduți.

# Dialogue_DlgGolemMaker
source: Artefacts
ro: Artefacte

# Dialogue_DlgGolemMaker
source: They can't do as they plan. Some of them don't even believe Ruin.
ro: Nu pot face așa cum intenționează. Unii dintre ei nici măcar nu cred în Ruină.

# Dialogue_DlgGolemMaker
source: Though it is guarded by the worst Golem I ever made: the Armour Wrath...
ro: Deși este păzit de cel mai rău Golem pe care l-am făcut vreodată: Armura Mâniei ...

# Dialogue_DO1Altar
source: Under section 1 of the first Act, an action of worship can not be aimed at any entity, god or divinity other than the Law itself.
ro: În conformitate cu secțiunea 1 a primului act, o acțiune de închinare nu poate fi orientată către nicio entitate, zeu sau divinitate în afară de Legea însăși.

# Dialogue_DO1Altar1
source: Under section 2 of the first Act... ??? There is section 3 of the first act, one would assume.
ro: În conformitate cu secțiunea 2 din primul act ... ??? Există secțiunea 3 a primului act, cineva ar presupune.

# Dialogue_DO1Arrive1DeadDwarves
source: So they were the dwarfs who lived here.
ro: Deci au fost piticii care au locuit aici.

# Dialogue_DO1Arrive1DeadDwarves
source: I'm not sure why but I feel a bit of sorrow for them.
ro: Nu sunt sigur de ce, dar simt un pic de întristare pentru ei.

# Dialogue_DO1Arrive1DeadDwarves
source: I wonder how you can tell them apart.
ro: Mă întreb cum le poți diferenția.

# Dialogue_DO1Arrive1DeadDwarves
source: I knew these ones. That's Gwin and Traga, there's Krug...
ro: Îi știam pe acestea. Acesta este Gwin și Traga, acolo este Krug ...

# Dialogue_DO1Gate
source: I think you may mistranslated a word or two...
ro: Cred că s-ar putea să traduceți greșit un cuvânt sau două ...

# Dialogue_DO1Gate
source: Dwarven letters are so similar...
ro: Literele piticilor sunt atât de similare ...

# Dialogue_DO1Gate
source: Dwarven language is stupid, these signs could mean anything!
ro: Limba pitică este o prostie, aceste semne ar putea însemna orice!

# Dialogue_DO1Gate
source: Associate!
ro: Asociază!

# Dialogue_DO1Gate
source: The Doors of Dwar — Lord of Dwartown. Speak, associate, and enter.
ro: Ușille lui Dwarf - Lord al Dwartown. Vorbiți, asociați și intrați.

# Dialogue_DO1Gate
source: Are you sure that is what you just read?
ro: Ești sigur că asta ai citit?

# Dialogue_DO1Gate
source: Nice try...
ro: Bună încercare...

# Dialogue_DO1Gate
source: I have to practice my Dwarven a bit more...!
ro: Trebuie să exersez ceva mai mult limba Piticilor ...!

# Dialogue_DO1Gate
source: I am going to open this door somehow.
ro: Voi deschide cumva această ușă.

# Dialogue_DO1Gate
source: I want a Schnauser with my Wienerschnitzel
ro: Vreau un Schnauser cu Wienerschnitzel

# Dialogue_DO1Gate
source: And on the day the Ball is set free, the gate opens and happiness finds everyone...
ro: Și în ziua în care Mingea este libera, poarta se deschide și fericirea îi găsește pe toți ...

# Dialogue_DO1Gate
source: Associwhat?
ro: Asociace?

# Dialogue_DO1Gate
source: Damn, my Dwarven is just not good enough, I have to practice a bit more...
ro: La naiba, înțelesul Limbi Piticilor nu este suficient de bună, trebuie să exersez un pic mai mult ...

# Dialogue_DO1Gate
source: There is sauerkraut in my Lederhosen
ro: În sauerkraut-ul meu există varză

# Dialogue_DO1Gate
source: There must be a way to open this door...
ro: Trebuie să existe un mod de a deschide această ușă ...

# Dialogue_DO1Tomb
source: These are the orders of the Chancellor of Dwartown, unjustly murdered by order of Duality.
ro: Acestea sunt ordinele Cancelarului din Dwartown, ucis pe nedrept de ordinul dualității.

# Dialogue_DO1Tomb1
source: Here lies the testament of the order of Duality, justly murdered by the Chancellor of Dwartown's spirit.
ro: Aici se află testamentul oridinului Dualității, doar ucis de către Cancelarul spiritului Dwartown.

# Dialogue_E3_Start
source: I survived the Unknown. I know how to use the Device, but...
ro: Am supraviețuit Necunoscutului. Știu cum să folosesc dispozitivul, dar ...

# Dialogue_E3_Start
source: I need to choose one last time. Once and for all.
ro: Trebuie să aleg ultima dată. Odată pentru totdeauna.

# Dialogue_E3_Start
source: I have already lost almost everything.
ro: Am pierdut deja aproape totul.

# Dialogue_E3_Start
source: And here I am again. Is this how it will end?
ro: Și iată-mă din nou. Așa se va termina?

# Dialogue_E3_Start
source: Do I really have to lose everyone I met in the Ruined Realm?
ro: Chiar trebuie să îi pierd pe toți pe care i-am cunoscut pe tărâmul ruinat?

# Dialogue_E3_Start
source: Or would I only save them so that we can die together?
ro: Sau i-aș salva doar pentru a putea muri împreună?

# Dialogue_E3_Start
source: I can hear the people outside the tower. I don’t have much time.
ro: Pot să aud oamenii din afara turnului. Nu am mult timp.

# Dialogue_GateKeeper
source: Worthy?
ro: Vrednic?

# Dialogue_GateKeeper
source: Get some rest and try again later.
ro: Stai și odihneștete și încearcă din nou mai târziu.

# Dialogue_GateKeeper
source: All right so you just teleported me to this... what is this place?
ro: Bine, așa că m-ai teleportat până aici ... ce este acest loc?

# Dialogue_GateKeeper
source: So right now this is the most proper place to test your Worthiness.
ro: Deci, acum este acesta cel mai potrivit loc pentru a-ți testa demnitatea.

# Dialogue_GateKeeper
source: You are not Worthy!
ro: Nu ești demn!

# Dialogue_GateKeeper
source: Giving up is not an option.
ro: Renunțarea nu este o opțiune.

# Dialogue_GateKeeper
source: Skip
ro: Treci Peste

# Dialogue_GateKeeper
source: Farewell! I need to go now.
ro: Rămas bun! Trebuie sa plec acum.

# Dialogue_GateKeeper
source: Focus on the trial!
ro: Concentrează-te pe proces!

# Dialogue_GateKeeper
source: Venture further down into the Sewer! You will find the answer.
ro: Aventurează-te mai jos în canalizare! Vei găsi răspunsul.

# Dialogue_GateKeeper
source: This trial will test your limits!
ro: Acest proces îți va testa limitele!

# Dialogue_GateKeeper
source: Give seat
ro: Dă loc

# Dialogue_GateKeeper
source: Restore
ro: Reînoiește

# Dialogue_GateKeeper
source: What?
ro: Ce?

# Dialogue_GateKeeper
source: Yes, you are!
ro: Da, ești!

# Dialogue_GateKeeper
source: Of course!
ro: Desigur!

# Dialogue_GateKeeper
source: I shall yield you to the right path!
ro: Te voi da pe calea cea bună!

# Dialogue_GateKeeper
source: I'm fed up with your trial! Just teleport me back.
ro: Sunt sătul de proba ta! Doar teleportează-mă înapoi.

# Dialogue_GateKeeper
source: There used to be an Arena here to test the Adventurers of the Realm, but it has been flooded with water for a hundred years.
ro: Aici exista o Arenă pentru a testa aventurierii tărâmului, dar a fost inundată cu apă timp de o sută de ani.

# Dialogue_GateKeeper
source: Am I Worthy?
ro: Sunt demn?

# Dialogue_GateKeeper
source: Where are we?
ro: Unde suntem?

# Dialogue_GateKeeper
source: We don't have time for this now.
ro: Nu avem timp pentru asta acum.

# Dialogue_GateKeeper
source: These are the remnants of the Ancient Sewer.
ro: Acestea sunt rămășițele Canalizării Antice.

# Dialogue_GateKeeper
source: So how am I supposed to complete your Trial?
ro: Deci, cum trebuie să termin proba ta?

# Dialogue_GateKeeper
source: Your Worthiness has to be proven.
ro: Demnitatea ta trebuie dovedită.

# Dialogue_GateKeeper
source: Go now, the Trial awaits you!
ro: Du-te acum, te așteaptă provocarea!

# Dialogue_GateKeeper
source: I'm tired, I will need some time to recover.
ro: Sunt obosit, voi avea nevoie de ceva timp pentru a mă recupera.

# Dialogue_GateKeeper
source: Leave
ro: Pleacă

# Dialogue_GateKeeper
source: The Worthiness is strong in this one...
ro: Demnitatea este puternică în acesta...

# Dialogue_GateKeeper
source: You have proven yourself Worthy!
ro: Te-ai dovedit demn!

# Dialogue_GateKeeper
source: Your Worthiness has been proven again!
ro: Demnitatea ta a fost dovedită din nou!

# Dialogue_GateKeeper
source: I have found a...
ro: Am găsit un ...

# Dialogue_Gatekeeper_AfterBattle
source: What?! I understand that for a new gate to open one would have to prove something, but... in this case... I accept that...
ro: Ce?! Am înțeles că pentru ca o nouă poartă să se deschidă va trebui să demonstreze ceva, dar ... în acest caz ... accept asta ...

# Dialogue_Gatekeeper_AfterBattle
source: Enough!
ro: Destul!

# Dialogue_Gatekeeper_AfterBattle
source: What a coincidence! I also happen to be heading in that direction.
ro: Ce coincidență! De asemenea, se întâmplă să mă îndrept în această direcție.

# Dialogue_Gatekeeper_AfterBattle
source: You can pass.
ro: Poți trece.

# Dialogue_Gatekeeper_AfterBattle
source: Farewell my Ball Lord! May the Great Gate open for you when the time comes!
ro: Adio, Domnul meu Minge! Fie ca Marea Poartă să se deschidă când va veni vremea!

# Dialogue_Gatekeeper_AfterBattle
source: Noooooo...
ro: Nuuuuuu...

# Dialogue_Gatekeeper_AfterBattle
source: Could you just let me pass? Please?
ro: M-ai putea lăsa să trec? Te rog?

# Dialogue_Gatekeeper_AfterBattle
source: You have proved your Worthiness.
ro: Ți-ai dovedit demnitatea.

# Dialogue_Gatekeeper_AfterBattle
source: Farewell, Keeper!
ro: Adio, Portare!

# Dialogue_Gatekeeper_AfterBattle
source: Ask him to take you to Crossroad Cave.
ro: Roagă-l să te ducă la Peștera de la Intersecție.

# Dialogue_Gatekeeper_AfterBattle
source: Wait! What?
ro: Așteptă! Ce?

# Dialogue_Gatekeeper_AfterBattle
source: Then if you accept, let the trial begin!
ro: Atunci, dacă accepți, începe procesul!

# Dialogue_Gatekeeper_AfterBattle
source: Where do you want to go, Sir? Command me.
ro: Unde vrei să mergi, domnule? Ordonă-mi.

# Dialogue_Gatekeeper_AfterBattle
source: Crossroad Cave!
ro: Peștera de la Intersecție!

# Dialogue_Gatekeeper_AfterBattle
source: So be it!
ro: Așa să fie!
