Repository: Frank1eJohnson/Uwajimaya
Catalog: Content/Localization/UwajimayaDialogues/*/UwajimayaDialogues.po
Languages: ro

# Dialogue_LB_MiddleLever
source: I heard the door exploding. Father must be really mad but It doesn’t matter now.
ro: Am auzit ușa explodând. Tatăl trebuie să fie într-adevăr nebun, dar acum nu mai contează.

# Dialogue_LB_RightLever
source: I pulled the last lever.
ro: Am tras ultima manetă.

# Dialogue_LR_Bed
source: Sleeping wasn’t easy since Mom was gone.
ro: Dormitul nu a fost ușor de când mama a dispărut.

# Dialogue_LR_Bed
source: I really couldn’t sleep that night.
ro: Chiar nu am putut dormi în noaptea aceea.

# Dialogue_LR_Chest
source: It was half past eleven.
ro: Era ora 11 și jumătate.

# Dialogue_LR_Chest
source: I took the key.
ro: Am luat cheia.

# Dialogue_LR_Chest
source: Daddy didn’t like if I went out in the night but I felt something calling for me.
ro: Tatălui nu i-a plăcut dacă aș ieși noaptea, dar am simțit ceva care mă cheamă.

# Dialogue_LR_Door
source: I always locked the door just to make sure I won’t sleep walk out.
ro: Am închis întotdeauna ușa doar pentru a mă asigura că nu voi dormi in mers afară.

# Dialogue_LR_Door
source: I opened the door.
ro: Am deschis ușa.

# Dialogue_LR_Door
source: I hid the key under the clock.
ro: Am ascuns cheia sub ceas.

# Dialogue_LR_Notebook
source: Here I collected all my less scientific notes on the Ruined Realm.
ro: Aici am colectat toate notele mele mai puțin științifice despre Tărâmul Ruinat.

# Dialogue_LR_Notebook
source: They deserve to be remembered. I will miss them.
ro: Merită să fie amintiți. Imi vor lipsi.

# Dialogue_LR_Notebook
source: So many lovely people! Despite their madness.
ro: Atâția oameni minunați! În ciuda nebuniei lor.

# Dialogue_LR_TabbyBed
source: Sometimes I wished there could be a place like that for me as well.
ro: Uneori îmi doream să existe și un loc ca acela pentru mine.

# Dialogue_LR_TabbyBed
source: As usually Tabby was out there maybe hunting or just hanging out with other cats.
ro: Așa cum de obicei Tabby era acolo, poate la vânătoare sau doar petrecând timpul cu alte pisici.

# Dialogue_LR_TabbyBed
source: In this World, he was normal.
ro: În această lume, el era normal.

# Dialogue_LR_Window
source: Yet sometimes I liked to watch other kids playing in the castle garden.
ro: Totuși, uneori, îmi plăcea să mă uit la alți copii jucându-se în grădina castelului.

# Dialogue_LR_Window
source: They didn’t understand how important my task was.
ro: Nu au înțeles cât de importantă era sarcina mea.

# Dialogue_LR_Window
source: I didn’t leave the castle since Mom died.
ro: Nu am părăsit castelul de când mama a murit.

# Dialogue_LR_Window
source: Two years passed and they still didn’t give up throwing balls on the window to get my attention.
ro: Au trecut doi ani și încă nu au renunțat să arunce mingi pe geam pentru a-mi atrage atenția.

# Dialogue_LR_Window
source: They will never understand.
ro: Nu vor înțelege niciodată.

# Dialogue_MagicMirror1
source: Well, that fountain is definitely not your cup of tea but you can accept that it might be the fairest for the Magic Mirror...
ro: Ei bine, acea fântână nu este cu siguranță ceea ce îți place ție, dar poți accepta că ar putea fi cea mai corectă pentru oglinda magică ...

# Dialogue_MagicMirror1
source: Who is the fairest?
ro: Cine este cel mai corect?

# Dialogue_MagicMirror1
source: Wish something
ro: Puneți o dorință

# Dialogue_MagicMirror1
source: No matter how hard you try to receive a sign, the Mirror remains silent. It doesn't show you anything this time.
ro: Oricât de greu încerci să primești un semn, Oglinda rămâne tăcută. Nu îți arată nimic de data asta.

# Dialogue_MagicMirror1
source: The water seems to be boiling and the bubbles pop when they hit the surface; it is indeed mesmerizing. Suddenly, something breaks the silence - you can hear whispers.
ro: Apa pare să fiarbă, iar bulele să apară atunci când lovesc suprafața; este într-adevăr fascinant. Deodată, ceva sparge tăcerea - poți auzi șoapte.

# Dialogue_MagicMirror1
source: Leave
ro: Pleacă

# Dialogue_MagicMirror1
source: You politely explain that you want to see your past instead of your body, but the Mirror is stubbornly stuck on this image.
ro: Îi explici politicos că vrei să-ți vezi trecutul în loc de corpul tău, dar Oglinda este încăpățânată să rămână cu această imagine.

# Dialogue_MagicMirror1
source: You place the flower and wait to see what happens.
ro: Pui floarea și aștepți să vezi ce se întâmplă.

# Dialogue_MagicMirror1
source: The vision fades away.
ro: Viziunea se estompează.

# Dialogue_MagicMirror1
source: The Mirror seems to be unavailable at the moment. It doesn't want to be bothered. Maybe you should return later.
ro: Oglinda pare a fi indisponibilă în acest moment. Nu vrea să fie deranjat. Poate că ar trebui să te întorci mai târziu.

# Dialogue_MagicMirror1
source: The water turns still. Deep under the surface you notice a glimmering light.
ro: Apa se întoarce. Adânc sub suprafață observi o lumină strălucitoare.

# Dialogue_MagicMirror1
source: The Magic Mirror shows things that were, things that are, and things that yet may be. You fill the basin with water and start contemplating. You meditate about...
ro: Oglinda magică arată lucruri care au fost, lucruri care sunt și lucruri care pot fi încă. Umpli bazinul cu apă și începi să contemplezi. Meditezi despre ...

# Dialogue_MagicMirror1
source: Ruin left this place almost untouched. The street lamps spread light on a couple of metal benches and flower pots.
ro: Ruina a lăsat acest loc aproape neatins. Lămpile stradale răspândesc lumină pe câteva bănci metalice și ghivece cu flori.

# Dialogue_MagicMirror1
source: You are watching the ball and start to get frustrated. You don't want to look at this body replacement... this raggy shell... You want answers!
ro: Urmărești mingea și începi să te frustrezi. Nu vrei să te uiți la acest înlocuitor al corpului ... la acest înveliș neobișnuit ... Vrei răspunsuri!

# Dialogue_MagicMirror1
source: Who you were in the past
ro: Cine ai fost în trecut

# Dialogue_MagicMirror1
source: Floating Flower
ro: Floare Plutitoare

# Dialogue_MagicMirror1
source: There are glass shards all over the place. There's a ball on the floor next to the girl.
ro: Există cioburi de sticlă peste tot. Există o minge pe podea lângă fată.

# Dialogue_MagicMirror1
source: You reach for the light and your fingers grab onto something smooth and cold.
ro: Te aproprie de lumină și degetele se prind de ceva neted și rece.

# Dialogue_MagicMirror1
source: You are seeing the wizard's room once more. There is a weakened little girl lying on the floor in the middle of the room. She is surrounded by stone runes, candles and magical potions.
ro: Mai vezi încă o dată camera vrăjitorului. În mijlocul camerei există o fetiță slăbită. Este înconjurată de pietre runice,, lumânări și poțiuni magice.

# Dialogue_MagicMirror1
source: What you were before
ro: Ce ai fost înainte

# Dialogue_MagicMirror1
source: The image zooms in and you have a clearer view of the fountain. You are waiting for more, but nothing happens.
ro: Imaginea se mărește și ai o vedere mai clară asupra fântânii. Aștepți mai multe, dar nu se întâmplă nimic.

# Dialogue_MagicMirror1
source: You are seeing the Ruined Realm from afar. The view gets closer until you find yourself looking at the top of a tower.
ro: Vezi Tărâmul Ruinat de departe. Priveliștea se apropie până când descoperi că privești spre vârful unui turn.

# Dialogue_MagicMirror1
source: You found a precious rune stone! Hmmm...Is this the gift offered by the Mirror in exchange for your enchanting flower?
ro: Ai găsit o piatră scumpă! Hmmm ... Acesta este cadoul oferit de Oglindă în schimbul florii tale fermecătoare?

# Dialogue_Monk
source: I don’t care what happens here after I’m back home.
ro: Nu mă interesează ce se întâmplă aici după ce mă întorc acasă.

# Dialogue_Monk
source: He can’t release his daughter. He can’t accept that she is gone. He wants to get her back even if it means they all die after a few months...
ro: Nu-și poate elibera fiica. El nu poate accepta că ea a dispărut. Vrea să o recupereze, chiar dacă înseamnă că toți mor după câteva luni ...

# Dialogue_Monk
source: Wait! You can’t just dis...
ro: Aștepta! Nu poți doar să dis ...

# Dialogue_Monk
source: All right and what can we do against it?
ro: În regulă și ce putem face împotriva ei?

# Dialogue_Monk
source: Now it’s better.
ro: Acum este mai bine.

# Dialogue_Monk
source: To be honest I don’t have the faintest idea. I just want to be free again.
ro: Sincer să fiu, nu am cea mai vagă idee. Vreau doar să fiu liber din nou.

# Dialogue_Monk
source: Do you think Ruin will stop after swallowing the Human Realm?
ro: Crezi că Ruina se va opri după înghițirea Tărâmului Uman?

# Dialogue_Monk
source: He says he wants his daughter back but I think he is still trying to close the Realm to stop Ruin.
ro: El spune că își dorește fiica sa înapoi, dar cred că încă încearcă să închidă tărâmul pentru a opri Ruina.

# Dialogue_Monk
source: Yet he doesn’t care about the World. He wants to get her back even if it means they all die after a few months...
ro: Totuși nu-i pasă de lume. Vrea să o recupereze, chiar dacă înseamnă că toți mor după câteva luni ...

# Dialogue_Monk
source: Thanks for the Soulcaster
ro: Mulțumesc pentru Făcătorul de Suflete

# Dialogue_Monk
source: Why should it concern me if Ruin destroys your Realm? You deserve it for summoning us to do the hard work.
ro: De ce ar trebui să mă preocupe dacă Ruina îți distruge Tărâmul? Meriți că ne-ai chemat să facem munca grea.

# Dialogue_Monk
source: You again? I told you if you want something from the Wizard go and find him yourself...
ro: Tu din nou? Ți-am spus dacă vrei ceva de la Vrăjitor, du-te și găsește-l tu ...

# Dialogue_Monk
source: It might take time but it will reach the Unknown Realm and all the spirits will become part of Ruin just like those who were summoned here.
ro: S-ar putea să dureze timp, dar va ajunge pe Tărâmul Necunoscut și toate spiritele vor deveni parte a Ruinei la fel ca cei care au fost chemați aici.

# Dialogue_Monk
source: I’m not sure. I will think about it.
ro: Nu sunt sigur. O sa ma gândesc la asta.

# Dialogue_Monk
source: The Wizard created a device which can separate the Realms. This is the only way to stop Ruin from spreading.
ro: Vrăjitorul a creat un dispozitiv care poate separa tărâmurile. Acesta este singurul mod de a opri Ruina să se răspândească.

# Dialogue_Monk
source: This time I would like to talk to you...
ro: De data asta aș dori să vorbesc cu tine ...

# Dialogue_Monk
source: Don’t know
ro: Nu știu

# Dialogue_Monk
source: Not my problem
ro: Nu este problema mea

# Dialogue_Monk
source: Accept plan
ro: Acceptă planul

# Dialogue_Monk
source: Bring back daughter
ro: Adu-i fiica înapoi

# Dialogue_Monk
source: Not sure
ro: Nu sunt sigur

# Dialogue_Monk
source: Have no fear, I will have this done!
ro: Nu te teme, voi face asta!

# Dialogue_Monk
source: For you this would be completely different. For you this is not a sacrifice but a way of going home!
ro: Pentru tine acest lucru ar fi complet diferit. Pentru tine acesta nu este un sacrificiu, ci un mod de a pleca acasă!

# Dialogue_Monk
source: You are wrong. The World is falling apart yet he doesn’t care about it even when he is the only one who could stop Ruin.
ro: Greșești. Lumea se destramă, totuși lui nu-i pasă nici atunci când este singurul care ar putea să-l oprească Ruina.

# Dialogue_Monk
source: I’m also glad. It was bloody damn difficult.
ro: Sunt, de asemenea, bucuros. Era sângeros al naibii de greu.

# Dialogue_Monk
source: Decline plan
ro: Refuză planul

# Dialogue_Monk
source: The World is falling apart and only the Wizard has a chance to stop this.
ro: Lumea se destramă și numai Vrăjitorul are șansa de a opri acest lucru.

# Dialogue_Monk
source: Hello, little Wanderer! I’m glad you made it this far.
ro: Bună ziua, micule Rătăcitor! Mă bucur că ai ajuns până aici.

# Dialogue_Monk
source: I'm a demon
ro: Sunt un demon

# Dialogue_Monk
source: My plan is simple.
ro: Planul meu este simplu.

# Dialogue_Monk
source: I saw Ruin and I don’t want the same to happen to any other Realm. What can I do?
ro: Am văzut Ruin și nu vreau să se întâmple același lucru cu niciun alt tărâm. Ce pot sa fac?

# Dialogue_Monk
source: For the sake of all Realms I hope you will make the right decision.
ro: De dragul tuturor tărâmurilor, sper că vei lua o decizie corectă.

# Dialogue_Monk
source: Once you are there find the Laboratory and activate the device! It will take you home and will separate the Worlds which means no spirit will be ever summoned again!
ro: Odată ce ești acolo, găsește laboratorul și activează dispozitivul! Te va duce acasă și va separa Lumile, ceea ce înseamnă că niciun spirit nu va mai fi chemat din nou!

# Dialogue_Monk
source: ...and I don’t want our conversation to be overheard, so if you don’t mind...
ro: ... și nu vreau ca conversația noastră să fie auzită, deci dacă nu te deranjează ...

# Dialogue_Monk
source: How to save the World?
ro: Cum să salvezi lumea?

# Dialogue_Monk
source: Farewell Wanderer!
ro: Adio Rătăcitorule!

# Dialogue_Monk
source: Calm down little spirit.
ro: Calmează-te spirit mic.

# Dialogue_Monk
source: Thank you Spirit! For the sake of all Realms I hope you won’t fail on your way!
ro: Multumesc Spirit! De dragul tuturor tărâmurilor, sper că nu vei da greș în calea ta!

# Dialogue_Monk
source: But we won’t let this happen, will we?
ro: Dar nu vom lăsa să se întâmple asta, nu-i așa?

# Dialogue_Monk
source: You deserve Ruin. I won’t save the Human Realm!
ro: Meriți Ruina. Nu voi salva Tărâmul Uman!

# Dialogue_Monk
source: Where shall I start? Do you know what the Wizard is up to? Did he tell you?
ro: De unde să încep? Ști ce face Vrăjitorul? Ți-a spus?

# Dialogue_Monk
source: This is not my Realm and not my problem. All I want is to get out of here.
ro: Acesta nu este tărâmul meu și nici problema mea. Tot ce vreau este să plec de aici.

# Dialogue_Monk
source: He would like to bring his daughter back to life. For that he needs three artefacts which are somewhere here.
ro: El ar dori să-și readucă fiica la viață. Pentru asta are nevoie de trei artefacte care sunt undeva aici.

# Dialogue_Monk
source: I understand your fury. Yet I hope you will change your mind.
ro: Îți înțeleg furia ta. Totuși sper că te vei răzgândi.

# Dialogue_Monk
source: He lost his daughter and he can’t release her. He can’t accept that she is gone.
ro: Și-a pierdut fiica și nu o poate elibera. El nu poate accepta că ea a dispărut.

# Dialogue_Monk
source: Before you go on I have something to discuss with you...
ro: Înainte de a continua, am de discutat ceva cu tine ...

# Dialogue_Monk
source: Me too
ro: Și eu

# Dialogue_Monk
source: I won’t deliver any message
ro: Nu voi transmite niciun mesaj

# Dialogue_Monk
source: That’s correct. He can’t release his daughter. He can’t accept that she is gone.
ro: Este corect. Nu-și poate elibera fiica. El nu poate accepta că ea a dispărut.

# Dialogue_Monk
source: I know right now it doesn’t look that way, but I’m a mighty demon of the Unknown Realm.
ro: Știu că acum nu arată așa, dar sunt un demon puternic al Tărâmului Necunoscut.

# Dialogue_Monk
source: Close Ruined Realm
ro: Închide Tărâmul Ruinat

# Dialogue_Monk
source: It wasn’t easy but I made good use of the Spellcaster you gave me.
ro: Nu a fost ușor, dar am profitat bine de Făcătorul de Vrăji pe care mi l-ai oferit.

# Dialogue_Monk
source: When you deliver the artefacts he will let you into his tower.
ro: Când vei livra artefactele, te va lăsa în turnul său.

# Dialogue_Monk
source: When the Wizard’s daughter activated the device it transported her soul into the Unknown Realm. At that point the Wizard stopped the device so that he can summon his daughter back.
ro: Când fiica vrăjitorului a activat dispozitivul, acesta și-a transportat sufletul pe Tărâmul Necunoscut. În acel moment, Vrăjitorul a oprit dispozitivul pentru a-și putea lua fiica înapoi.

# Dialogue_Monk
source: This is just as much your problem as it is mine.
ro: Aceasta este la fel de mult problema ta cât este și a mea.

# Dialogue_Monk
source: You made it and that is what matters.
ro: Ai făcut-o și asta contează.

# Dialogue_MR_Bed
source: We always wore colourful clothes because that made her happy.
ro: Am purtat întotdeauna haine colorate pentru că asta a făcut-o fericită.

# Dialogue_MR_Bed
source: Most of her time she just lied here and stared at nothing.
ro: Cea mai mare parte a timpului ei doar a stat acolo și nu a privit nimic.

# Dialogue_MR_Bed
source: Sometimes she talked about grey lands.
ro: Uneori vorbea despre terenuri cenușii.

# Dialogue_MR_Chair
source: I hope they will never find out how wrong they were. I hope there is still time for our World.
ro: Sper că nu vor afla niciodată cât de greșit au fost. Sper că mai este timp pentru Lumea noastră.

# Dialogue_MR_Chair
source: This is where the doctor used to sit. He never believed that Mom was infected by the Ruin.
ro: Aici stătea medicul. Nu a crezut niciodată că mama a fost infectată de Ruină.

# Dialogue_MR_Chair
source: No one ever believed in Ruin.
ro: Nimeni nu a crezut vreodată în Ruină.

# Dialogue_MR_Lamps
source: This room was the brightest in the castle.
ro: Această cameră era cea mai strălucitoare din castel.

# Dialogue_MR_Lamps
source: I took some oil.
ro: Am luat puțin ulei.

# Dialogue_MR_Lamps
source: Father bought some exotic lamp oil so that we had coloured lights.
ro: Tatăl a cumpărat ulei de lampă exotic, astfel încât să avem lumini colorate.

# Dialogue_MR_Paintings
source: Mom was always fond of art.
ro: Mama era întotdeauna pasionată de artă.

# Dialogue_MR_Paintings
source: After she got sick she couldn’t paint the way she did before yet she still liked it.
ro: După ce s-a îmbolnăvit, nu a mai putut picta așa cum o făcea înainte, dar încă îi plăcea.

# Dialogue_MR_Paintings
source: It could engage her for hours.
ro: Ar putea să o țină ocupată ore întregi.

# Dialogue_Scholar
source: Not my business
ro: Nu e treaba mea

# Dialogue_Scholar
source: Maybe we failed the ritual again and summoned another of your kind.
ro: Poate că am eșuat din nou ritualul și l-am chemat pe altul din același neam ca tine.

# Dialogue_Scholar
source: What do you expect me to do, Spirit?
ro: Ce te aștepți să fac, duhule?

# Dialogue_Scholar
source: I’ve already done way too much for you.
ro: Am făcut deja prea mult pentru tine.

# Dialogue_Scholar
source: Now, take me home!
ro: Acum, du-mă acasă!

# Dialogue_Scholar
source: We made the spell... and it worked!
ro: Am făcut vraja ... și a funcționat!

# Dialogue_Scholar
source: And then what?
ro: Și apoi, ce?

# Dialogue_Scholar
source: And he...
ro: Și el...

# Dialogue_Scholar
source: Someone like me...
ro: Cineva ca mine...

# Dialogue_Scholar
source: She destroyed half of the room before we could even cast a spell.
ro: A distrus jumătate din cameră înainte de a putea chiar să aruncăm o vrajă.

# Dialogue_Scholar
source: That’s how you handle situations like these...
ro: Așa te descurci în situații ca acestea ...

# Dialogue_Scholar
source: I’m not sure... Everything happened so fast.
ro: Nu sunt sigur ... Totul s-a întâmplat atât de repede.

# Dialogue_Scholar
source: What happened?
ro: Ce s-a întâmplat?

# Dialogue_Scholar
source: I can’t... I’m sorry!
ro: Nu pot ... îmi pare rău!

# Dialogue_Scholar
source: What happened to Lillian? Has she returned?
ro: Ce s-a întâmplat cu Lillian? Sa întors?

# Dialogue_Scholar
source: Something... arrgh... something went wrong...
ro: Ceva ... arrgh ... ceva a mers prost ...

# Dialogue_Scholar
source: You are Raven’s master...
ro: Ești stăpânul Corbului...

# Dialogue_Scholar
source: She was taken over by a wicked force and she unleashed boundless spells.
ro: A fost preluată de o forță nelegiuită și a dezlănțuit vrăji nelimitate.

# Dialogue_Scholar
source: It was like the devil itself.
ro: Era ca însuși diavolul.

# Dialogue_Scholar
source: Where is Wizard? Something happened to him?
ro: Unde este Vrăjitorul? Ceva i s-a întâmplat?

# Dialogue_Scholar
source: Wizard was right when he decided to trust you.
ro: Vrăjitorul avea dreptate când a decis să aibă încredere în tine.

# Dialogue_Scholar
source: I won’t fight
ro: Nu voi lupta

# Dialogue_Scholar
source: I will face her!
ro: O voi înfrunta!

# Dialogue_Scholar
source: We made everything right...
ro: Am făcut totul bine ...

# Dialogue_Scholar
source: Why is it that every time you refuse to face the consequences of your actions, it is me who needs to clean up your mess?
ro: De ce este că de fiecare dată când refuzi să te confrunți cu consecințele acțiunilor tale, eu sunt cel care trebuie să-ți curețe mizeria?

# Dialogue_Scholar
source: I'm sorry that I can't help...
ro: Îmi pare rău că nu mă pot ajuta ...

# Dialogue_Scholar
source: You are free to do whatever you want!
ro: Ești liber să faci orice vrei!

# Dialogue_Scholar
source: Was it trapped inside a teddy bear?
ro: A fost prins în interiorul unui ursuleț?

# Dialogue_Scholar
source: The demon-Lillian left. There is no one who could stop her now...
ro: Demonul-Lillian a plecat. Nu există nimeni care să o poată opri acum ...

# Dialogue_Scholar
source: She had fire in her eyes...
ro: Avea foc în ochi ...

# Dialogue_Scholar
source: Lillian woke up and then...
ro: Lillian s-a trezit și apoi ...

# Dialogue_Scholar
source: Leave and let me rest in peace...
ro: Pleacă și lasă-mă să mă odihnesc în pace ...

# Dialogue_Scholar
source: Wizard?
ro: Vrăjitorul?

# Dialogue_Scholar
source: Is the Wizard safe? What happened afterwards?
ro: Vrăjitorul este în siguranță? Ce s-a întâmplat după aceea?

# Dialogue_Scholar
source: I was hit by the table.
ro: Am fost lovit de masă.

# Dialogue_Scholar
source: Good luck with... everything!
ro: Baftă în toate!

# Dialogue_Scholar
source: Let me go!
ro: Lasă-mă sa plec!

# Dialogue_Scholar
source: I'll stop her
ro: O voi opri

# Dialogue_Scholar
source: He was burnt to ashes.
ro: A fost ars până la cenușă.

# Dialogue_Scholar
source: I have always wanted to meet someone of my own kind anyway.
ro: Întotdeauna am dorit să întâlnesc pe cineva de neamul meu.

# Dialogue_Scholar
source: I can’t open a Gate without Wizard...
ro: Nu pot deschide o Poartă fără vrăjitor ...

# Dialogue_Scholar
source: I don't understand... It is...
ro: Nu înțeleg ... Este ...

# Dialogue_Scholar
source: It wasn't me who brought you here.
ro: Nu eu te-am adus aici.

# Dialogue_Scholar
source: Was it trapped?
ro: A fost prins?

# Dialogue_Scholar
source: I can't let her destroy everything!
ro: Nu pot să o las să distrugă totul!

# Dialogue_Scholar
source: No-no-no!
ro: Nu-nu-nu!

# Dialogue_SewerCreatures
source: All right, I will return when I'm done.
ro: Bine, voi reveni când termin.

# Dialogue_SewerCreatures
source: Really?
ro: Într-adevăr?

# Dialogue_SewerCreatures
source: That's sad. What happened exactly?
ro: Asta e trist. Ce s-a întâmplat exact?

# Dialogue_SewerCreatures
source: Farewell until we meet again!
ro: Adio până ne întâlnim din nou!

# Dialogue_SewerCreatures
source: I'm glad I could help.
ro: Mă bucur că am putut ajuta.

# Dialogue_SewerCreatures
source: It was nice to see you again.
ro: A fost frumos să ne vedem din nou.

# Dialogue_SewerCreatures
source: Don't worry! I'm still looking for it.
ro: Nu-ți face griji! Încă o caut.

# Dialogue_SewerCreatures
source: I don't have time for you creature! Stay out of my way!
ro: Nu am timp pentru tine creatură! Stai în afara drumului meu!

# Dialogue_SewerCreatures
source: Accept Quest
ro: Acceptă Misiune

# Dialogue_SewerCreatures
source: Leave
ro: Pleacă

# Dialogue_SewerCreatures
source: Farewell and good luck to you as well!
ro: Adio și mult noroc și pentru tine!
