Repository: Frank1eJohnson/Uwajimaya
Catalog: Content/Localization/UwajimayaDialogues/*/UwajimayaDialogues.po
Languages: ro

# Dialogue_2HW_LRDoor
source: They still didn’t notice I locked them into the workroom.
ro: Încă nu au observat că i-am închis în sala de lucru.

# Dialogue_2HW_LRDoor
source: I entered into the Laboratory.
ro: Am intrat în Laborator.

# Dialogue_2HW_LRDoor
source: The Laboratory has strong secure spells. I can’t enter here without being noticed.
ro: Laboratorul are vrăji puternice și sigure. Nu pot intra aici fără să fiu observat.

# Dialogue_2HW_WRDoor
source: Ruin is close and we are all at risk. It’s not about you. It's about everyone.
ro: Ruina este aproape și suntem cu toții în pericol. Nu este vorba despre tine. Este vorba despre toată lumea.

# Dialogue_2HW_WRDoor
source: I heard father arguing with someone.
ro: L-am auzit pe tată care se ceartă cu cineva.

# Dialogue_2HW_WRDoor
source: The device must be destroyed.. We’ll find something else to stop Ruin.
ro: Dispozitivul trebuie distrus. Vom găsi altceva pentru a-l opri pe Ruin.

# Dialogue_2HW_WRDoor
source: I had to do this. At least for mom. So that she didn’t die in vain.
ro: A trebuit să fac asta. Cel puțin pentru mama. Așa că nu a murit în zadar.

# Dialogue_2HW_WRDoor
source: No, I won't risk losing her! She is bound to the device.
ro: Nu, nu voi risca să o pierd! Ea este legată de dispozitiv.

# Dialogue_2HW_WRDoor
source: Lillian knew what she applied for. She must decide.
ro: Lillian știa la ce a aplicat. Ea trebuie să decidă.

# Dialogue_2HW_WRDoor
source: I used the key to close the door.
ro: Am folosit cheia pentru a închide ușa.

# Dialogue_2HW_WRDoor
source: No, I’ve made my decision.
ro: Nu, am luat decizia mea.

# Dialogue_2HW_WRDoor
source: Even if our entire World needs to pay the price.
ro: Chiar dacă întreaga noastră lume trebuie să plătească prețul.

# Dialogue_2HW_WRDoor
source: I knew he wouldn’t let me finish what we started.
ro: Știam că nu mă va lăsa să termin ceea ce am început.

# Dialogue_AABook
source: '...the Wisest of the Arcade gathered here to discuss if the magical phenomena means any more threat...'
ro: '... Cel mai Înțelepți al Arcadei s-a adunat aici pentru a discuta dacă fenomenele magice înseamnă o amenințare mai mare ...'

# Dialogue_AABook
source: They were just like us. The next one hundred pages explain why Ruin will never reach the Arcade or how the Ancient Magic can stop it.
ro: Erau la fel ca noi. Următoarele o sută de pagini explică de ce Ruina nu va ajunge niciodată pe Arcadă sau cum Magia Antică o poate opri.

# Dialogue_AABook
source: I hope you don’t want to read all that nonsense.
ro: Sper că nu vrei dori să citești toate prostiile astea.

# Dialogue_AABook
source: 'Ten years after the Cataclysm (or recently named as Ruin)...'
ro: "Zece ani după cataclism (sau recent numit ruină) ..."

# Dialogue_AAGateKeeper1
source: What if you just take a break from this and let me pass? Make an exception.
ro: Ce se întâmplă dacă faci doar o pauză de la asta și mă lași să trec? Fă o excepție.

# Dialogue_AAGateKeeper1
source: No rest, no sleep allowed.
ro: Fără odihnă, fără somn permis.

# Dialogue_AAGateKeeper1
source: ...sometimes I could really appreciate a chair.
ro: ... uneori aș puteam aprecia cu adevărat un scaun.

# Dialogue_AAGateKeeper1
source: I do ask you for apologies, young one.
ro: Îmi cer scuze, tinere.

# Dialogue_AAGateKeeper1
source: Take this rune stone as compensation.
ro: Luați această piatră runică ca o compensare.

# Dialogue_AAGateKeeper1
source: You might have proven worthy for the Arcade Gate, yet there are some other doors, and they have different rules.
ro: S-ar fi putut să te dovedești demn pentru poarta Arcadei, dar există alte uși și au reguli diferite.

# Dialogue_AAGateKeeper1
source: Will you??? That's so kind of you... err... I mean...
ro: Veți??? E atât de amabil de tine ... Adică ...

# Dialogue_AAGateKeeper1
source: Skip?
ro: Ocolește?

# Dialogue_AAGateKeeper1
source: Accept challenge
ro: Acceptă Provocare

# Dialogue_AAGateKeeper1
source: I accept my fate yet sometimes...
ro: Îmi accept soarta deși uneori ...

# Dialogue_AAGateKeeper1
source: Not so fast young lord!
ro: Nu prea repede tânăr domn!

# Dialogue_AAGateKeeper1
source: Poor Keeper
ro: Săracul Portar

# Dialogue_AAGateKeeper1
source: Farewell!
ro: Rămas bun!

# Dialogue_AAGateKeeper1
source: I am really sorry about that.
ro: Îmi pare foarte rău pentru asta.

# Dialogue_AAGateKeeper1
source: For there was a mistake.
ro: Căci a fost o greșeală.

# Dialogue_AAGateKeeper1
source: I guess you want me to go through some crazy traps again...
ro: Cred că vrei să trec din nou prin niște capcane nebune ...

# Dialogue_AAGateKeeper1
source: Keepers never fail their duty.
ro: Portarii niciodată nu își neglijează datoria.

# Dialogue_AAGateKeeper1
source: There are times when you have to stand in front of a door for a really long time.
ro: Există momente în care trebuie să stai în fața unei uși pentru o perioadă foarte lungă de timp.

# Dialogue_AAGateKeeper1
source: If I ever see a chair that's your size I will let you know.
ro: Dacă voi vedea vreodată un scaun de dimensiunea ta, te voi anunța.

# Dialogue_AAGateKeeper1
source: Accept Challenge
ro: Acceptă Provocarea

# Dialogue_AAGateKeeper1
source: Prove yourself worthy and I shall yield the path!
ro: Dovedește-te demn și voi da drumul!

# Dialogue_AAGateKeeper1
source: This door is open and free of charge for everyone...
ro: Aceasta ușă este deschisă și gratuită pentru toată lumea ...

# Dialogue_AAGateKeeper1
source: Keepers' lives are never easy.
ro: Viața Portarilor nu este niciodată ușoară.

# Dialogue_AAGateKeeper1
source: Just get over
ro: Doar treci peste

# Dialogue_AAGateKeeper1
source: I am all right with a few hundred years, but after a millennium my knees hurt like hell.
ro: Sunt în regulă cu câteva sute de ani, dar după un mileniu, genunchii mă dor ca naiba.

# Dialogue_AAGateKeeper1
source: What?? Do you mean that all those challenges that I had to pass were in vain?
ro: Ce?? Vrei să spui că toate acele provocări pe care trebuia să le trec au fost în zadar?

# Dialogue_AAGateKeeper1
source: All right, you win. I'll go and do some jumping. Must be better than waiting here for an eternity.
ro: În regulă, ai câștigat. Mă duc să fac câteva sărituri. Trebuie să fie mai bine decât să aștepți o eternitate.

# Dialogue_AAGateKeeper1
source: Accept Challenge.
ro: Acceptă provocarea.

# Dialogue_AAGateKeeper1
source: Hopefully, we will finish this soon.
ro: Sperăm că vom termina asta în curând.

# Dialogue_AAGateKeeper1
source: You shall prove yourself one more time.
ro: Te vei dovedi încă o dată.

# Dialogue_AAGateKeeper1
source: I will help
ro: Voi ajuta

# Dialogue_AAGateKeeper1
source: Well, thanks!
ro: Ei bine, mulțumesc!

# Dialogue_AALory
source: Did you came back to check out my wares?
ro: Te-ai întors să-mi verifici produsele?

# Dialogue_AALory
source: Though maybe you will find relief by looking through my wares. Haha!
ro: Deși poate veți găsi alinare uitându-te prin produsele mele. Haha!

# Dialogue_AALory
source: That's a sad name indeed. If the old saying 'nomen est omen' is true, then it might not be the best choice.
ro: Acesta este un nume trist într-adevăr. Dacă vechea zicală „nomen est omen” este adevărată, atunci este posibil să nu fie cea mai bună alegere.

# Dialogue_AALory
source: Trade
ro: Târguiește

# Dialogue_AALory
source: Oh, that's sad my little one.
ro: Oh, este trist micuțul meu.

# Dialogue_AALory
source: How noble of you!
ro: Cât de nobil pentru tine!

# Dialogue_AALory
source: But I hope this doesn't mean that you want to join the Maintainers. Haha!
ro: Dar sper că acest lucru nu înseamnă că dorești să te alături Întreținătorilor. Haha!

# Dialogue_AALory
source: No, thanks!
ro: Nu mulțumesc!

# Dialogue_AALory
source: This is a sad name indeed. And if the old saying 'nomen est omen' is true, then this might not be the best choice.
ro: Acesta este într-adevăr un nume trist. Și dacă vechea zicală „nomen est omen” este adevărată, atunci aceasta ar putea să nu fie cea mai bună alegere.

# Dialogue_AALory
source: {name}? It still sounds a bit weird, but I think I might like it.
ro: {name}? Sună încă un pic ciudat, dar cred că mi-ar plăcea.

# Dialogue_AALory
source: This sounds pretty epic but I wonder what nickname it might have?
ro: Suna destul de epic, dar mă întreb ce poreclă ar putea avea?

# Dialogue_AALory
source: By using some sort of ritual or spell...
ro: Folosind un fel de ritual sau vrajă ...

# Dialogue_AALory
source: I am rewarding you with these shiny coins!
ro: Te răsplătesc cu aceste monede strălucitoare!

# Dialogue_AALory
source: See? I'm a gnome of my word!
ro: Vedea? Sunt un pitic al cuvântului meu!

# Dialogue_AALory
source: Well, you know where to find me... once you have some coins to spend!
ro: Ei bine, știi unde să mă găsești ... odată ce ai niște monede de cheltuit!

# Dialogue_AALory
source: If you bring them to me, I will reward you with shiny golden coins!
ro: Dacă mi le aduci, te voi răsplăti cu monede aurii strălucitoare!

# Dialogue_AALory
source: I would love to give you that name, but if you don't have the money to pay for it, we can't make the deal, it wouldn't be fair
ro: Mi-ar plăcea să îți dau acest nume, dar dacă nu ai banii pentru a plăti pentru asta, nu putem face tranzacția, nu ar fi corect

# Dialogue_AALory
source: Oh, how sad.
ro: Oh, ce trist.

# Dialogue_AALory
source: Don't know
ro: Nu știu

# Dialogue_AALory
source: It sounds pretty epic, however I wonder what nickname it might have?
ro: Pare destul de epic, totuși mă întreb ce poreclă ar putea avea?

# Dialogue_AALory
source: Farewell! Ha-ha...
ro: Rămas bun! Ha-ha ...

# Dialogue_AALory
source: Leave
ro: Pleacă

# Dialogue_AALory
source: A mighty spirit
ro: Un spirit puternic

# Dialogue_AALory
source: Sure, show me what you've got!
ro: Sigur, arată-mi ce poți!

# Dialogue_AALory
source: Spirit of the Unknown
ro: Spiritul Necunoscutului

# Dialogue_AALory
source: And you are...
ro: Și tu ești...

# Dialogue_AALory
source: Buy name
ro: Cumpără nume

# Dialogue_AALory
source: Don't buy.
ro: Nu Cumpăra.

# Dialogue_AALory
source: "The true value of your family" and "How much does a brother cost?" can be two examples in this case.
ro: „Adevărata valoare a familiei tale” și „Cât costă un frate?” pot fi două exemple în acest caz.

# Dialogue_AALory
source: Failed One
ro: Cel Eșuat

# Dialogue_AALory
source: Farewell then, and good luck with your quest! Ha-ha...
ro: Adio, și mult noroc cu căutarea ta! Ha-ha ...

# Dialogue_AALory
source: I have some other important things to do right now.
ro: Am alte lucruri importante de făcut acum.

# Dialogue_AALory
source: I'm a mighty spirit of the Unknown!
ro: Sunt un spirit puternic al Necunoscutului!

# Dialogue_AALory
source: Help
ro: Ajutor

# Dialogue_AALory
source: Life is relentless. Innocent people are trapped, enslaved or abused!
ro: Viața este neobosită. Oamenii nevinovați sunt prinși, înrobiți sau abuzați!

# Dialogue_AALory
source: I need a proper name.
ro: Am nevoie de un nume potrivit.

# Dialogue_AALory
source: Right now I don't really have much money...
ro: Chiar acum nu prea am bani ...

# Dialogue_AALory
source: Even though there are some other precious books that I could add to my collection...
ro: Chiar dacă există câteva alte cărți prețioase pe care le-aș putea adăuga în colecția mea ...

# Dialogue_AALory
source: I know that some of those books must be in the Sewer's Library, but I couldn't find them.
ro: Știu că unele dintre acele cărți trebuie să fie în Biblioteca Canalizării, dar nu le-am găsit.

# Dialogue_AALory
source: That's fine but I wonder, what is your name?
ro: E în regulă, dar mă întreb, cum te cheamă?

# Dialogue_AALory
source: I don't know if I have one.
ro: Nu știu dacă am una.

# Dialogue_AALory
source: Spirit of the Unknown (1 Gold)
ro: Spiritul Necunoscutului (1 Aur)

# Dialogue_AALory
source: BALL-E (1 Gold)
ro: MINGE-E (1 Aur)

# Dialogue_AALory
source: As you can observe, I have a pretty nice collection of books.
ro: După cum puteți observa, am o colecție destul de drăguță de cărți.

# Dialogue_AALory
source: Ring the bell if you need something.
ro: Sună clopoțelul dacă ai nevoie de ceva.

# Dialogue_AALory
source: Spiry? Knowny?
ro: Spiry? Știutorul?

# Dialogue_AALory
source: Need gold
ro: Am nevoie de aur

# Dialogue_AALory
source: Nevermind! You chose well.
ro: Nu contează! Ai ales bine.

# Dialogue_AALory
source: Would you like to buy one? The first one is for free!
ro: Ai dori să cumperi unul? Primul este gratuit!

# Dialogue_AALory
source: I don't have much gold. Is there any way you could help me out?
ro: Nu am prea mult aur. Există vreun fel în care să mă poți ajuta?

# Dialogue_AALory
source: No, no, I meant the other bell.
ro: Nu, nu, mă refer la celălalt clopot.

# Dialogue_AALory
source: Can't afford
ro: Nu-mi permit

# Dialogue_AALory
source: Now that we're done with this, will you have a look at my wares?
ro: Acum că am terminat cu asta, vei arunca o privire asupra produselor mele?

# Dialogue_AALory
source: Hush, hush, little one!
ro: Hush, hush, micuțule!

# Dialogue_AALory
source: Failed One (1 Gold)
ro: Cel eșuat (1 aur)

# Dialogue_AALory
source: Well, I guess that's a classic.
ro: Ei bine, cred că este un clasic.

# Dialogue_AALory
source: Ok, I'll try not to be annoying this time.
ro: Ok, voi încerca să nu fiu enervant de data asta.

# Dialogue_AALory
source: Farewell!
ro: Rămas bun!

# Dialogue_AALory
source: All right...
ro: În regula...

# Dialogue_AALory
source: Take this Elevator Crystal as it might prove useful in your journey.
ro: Ia acest Cristal pentru Lift, deoarece s-ar putea dovedi util în călătoria ta.

# Dialogue_AALory
source: However, there is a way, I can help you out. Of course, if you are interested.
ro: Cu toate acestea, există o cale, te pot ajuta. Desigur, dacă ești interesat.

# Dialogue_AALory
source: I'm not quite sure.
ro: Nu sunt chiar sigur.

# Dialogue_AALory
source: That's sad. Nothing is worse than a customer without any gold to spend!
ro: Asta e trist. Nimic nu este mai rău decât un client fără niciun aur de cheltuit!

# Dialogue_AALory
source: I'm forced to stay in this realm because I agreed to do some silly tasks for a wizard. I could really use some help.
ro: Sunt obligat să rămân pe acest tărâm pentru că am acceptat să fac niște sarcini stupide pentru un vrăjitor. Aș putea folosi cu adevărat ajutor.

# Dialogue_AALory
source: And now that you have some coins to spend it's time to talk about business!
ro: Și acum că ai niște monede de cheltuieală, este timpul să vorbim despre afaceri!

# Dialogue_AALory
source: I hope this doesn't mean that you want to join the Maintainers. Haha!
ro: Sper că acest lucru nu înseamnă că dorești să te alături întreținătorilor. Haha!

# Dialogue_AALory
source: How wondrous! You found my books!
ro: Ce minune! Mi-ai găsit cărțile!

# Dialogue_AALory
source: I understand if you have identity problems, but there must be a way... how do others call you?
ro: Înțeleg dacă ai probleme de identitate, dar trebuie să existe un mod ... cum îți spun alții?

# Dialogue_AALory
source: You've come to the right place! Haha!
ro: Ai ajuns la locul potrivit! Haha!

# Dialogue_AALory
source: There is no justice in this Realm.
ro: Nu există dreptate în acest Tărâm.

# Dialogue_AALory
source: That's a very cute name for a little one like you.
ro: Acesta este un nume foarte drăguț pentru ceva mic ca tine.

# Dialogue_AALory
source: Nevermind, you can always come back.
ro: Nu contează, poți să te întorci mereu.

# Dialogue_AALory
source: That's such a cute name for a little one.
ro: Acesta este un nume atât de drăguț pentru unul mic.

# Dialogue_AALory
source: Which means you chose well.
ro: Ceea ce înseamnă că ai ales bine.

# Dialogue_AALory
source: Of course! You need some gold, otherwise how would you buy my stuff?
ro: Desigur! Ai nevoie de aur, altfel cum ai cumpăra lucrurile mele?

# Dialogue_AALory
source: However, I'd rather prefer: 'Nomen quantivis iam est pret!'
ro: Cu toate acestea, mai degrabă aș prefera: 'Nomen quantivis iam est pret!'

# Dialogue_AALory
source: BALL-E
ro: MINGE-E

# Dialogue_AALory
source: Refuse
ro: Refuză

# Dialogue_AARagdoll
source: Well that happens sometimes. Maybe that someone forgot to monopolize this ragdoll design.
ro: Ei bine, asta se întâmplă uneori. Poate că cineva a uitat să monopolizeze acest design de păpușă de cârpă.

# Dialogue_AARagdoll
source: It’s like the doll which was made by...
ro: Este ca păpușa care a fost făcută de ...

# Dialogue_AARagdoll
source: How on earth did this get here?
ro: Cum a ajuns aici?

# Dialogue_AARagdoll
source: ...by someone I knew.
ro: ... de cineva pe care îl cunosc.

# Dialogue_AARagdoll
source: There are many weird things all over this place. What makes this stand out?
ro: Există multe lucruri ciudate peste tot în acest loc. Ce face să iasă în evidență?

# Dialogue_AARagdoll
source: You are not funny.
ro: Nu ești amuzant.

# Dialogue_AARaven0
source: You can hardly find anyone that has more information about the Realms.
ro: Cu greu găsești pe cineva care să aibă mai multe informații despre Tărâmuri.

# Dialogue_AARaven0
source: How can I do something if I do not know what I have to do?
ro: Cum pot face ceva dacă nu știu ce am de făcut?

# Dialogue_AARaven0
source: Your logic is incoherent.
ro: Logica ta este incoerentă.

# Dialogue_AARaven0
source: All right, I'm on it.
ro: Sunt bine.

# Dialogue_AARaven0
source: Maybe I should accept what I need to do now.
ro: Poate că ar trebui să accept ceea ce trebuie să fac acum.

# Dialogue_AARaven0
source: Make your wizard turn you back to normal.
ro: Fă ca vrăjitorul să te transforme înapoi la normal.

# Dialogue_AARaven0
source: Raven gives you one of his keys so that you can move around freely.
ro: Corbul îți oferă una dintre cheile sale, astfel încât să te poți deplasa liber.

# Dialogue_AARaven0
source: Raven is something which won't make wizards turn Raven back.
ro: Corbul este ceva care nu-i va face pe vrăjitori să întoarcă pe Corb înapoi.

# Dialogue_AARaven0
source: You don't have to know.
ro: Nu trebuie să știi.

# Dialogue_AARaven0
source: A rich kingdom ruling all the other lands, powered by spirits of another world; these spirits were bound to metal.
ro: Un regat bogat care stăpânește toate celelalte regiuni, alimentat de spirite ale altei lumi; aceste spirite erau legate de metal.

# Dialogue_AARaven0
source: I'm not quite sure about this...
ro: Nu sunt deloc sigur de asta ...

# Dialogue_AARaven0
source: Yes.
ro: Da.

# Dialogue_AARaven0
source: Is there anything else on your mind?
ro: Există alceva în mintea ta?

# Dialogue_AARaven0
source: We still have some time left before this happens.
ro: Mai avem ceva timp înainte să se întâmple acest lucru.

# Dialogue_AARaven0
source: No more Raven
ro: Nu mai este Corbul

# Dialogue_AARaven0
source: Though Raven knows how you feel.
ro: Deși Corbul știe cum te simți.

# Dialogue_AARaven0
source: Now you only need to find a place where you can infuse it.
ro: Acum trebuie doar să găsești un loc în care să-l poți infuza.

# Dialogue_AARaven0
source: Chat
ro: Conversează

# Dialogue_AARaven0
source: Now you only need to find a place where you can infuse it. Meanwhile, Raven must figure it out how to open the Gate with it.
ro: Acum trebuie doar să găsești un loc în care să-l poți infuza. Între timp, Corbul trebuie să-și dea seama cum să deschidă Poarta cu ea.

# Dialogue_AARaven0
source: Raven is not like those dummy Living Armors, yet he does what he was made for.
ro: Corbul nu este ca acele Armuri Vii manechine, totuși face ceea ce a fost făcut.

# Dialogue_AARaven0
source: They lost purpose and became reckless.
ro: Și-au pierdut scopul și au devenit imprudenți.

# Dialogue_AARaven0
source: After he had some rest.
ro: După ce s-a odihnit.

# Dialogue_AARaven0
source: Raven's master would like to understand before doing anything.
ro: Stăpânul Corbului ar dori să înțeleagă înainte de a face orice.

# Dialogue_AARaven0
source: You will realize that 'sense' has no meaning in this realm anymore.
ro: Îți vei da seama că „sensul” nu mai are niciun sens în acest tărâm.

# Dialogue_AARaven0
source: They are humans.
ro: Sunt oameni.

# Dialogue_AARaven0
source: I think I know all about the meaning of life and all, ok? Can we just go on?
ro: Cred că știu totul despre sensul vieții și toate, ok? Putem merge mai departe?

# Dialogue_AARaven0
source: Hand it over to Raven so he could open the Gate!
ro: Înmânează-l Corbului ca să poată deschide Poarta!

# Dialogue_AARaven0
source: The master gave Raven the ability to think and talk.
ro: Stăpânul i-a oferit Corbului capacitatea de a gândi și de a vorbi.

# Dialogue_AARaven0
source: Why are you here?
ro: De ce ești aici?

# Dialogue_AARaven0
source: Seeking for knowledge, as always. And you? Never thought we’ll meet again. Still trying to take down these Realms forever?
ro: Caută cunoaștere, ca întotdeauna. Și tu? Nu am crezut niciodată că ne vom întâlni din nou. Încearcă să elimini aceste tărâmuri pentru totdeauna?

# Dialogue_AARaven0
source: I'm new with all this wizard business thing. What was their conversation about?
ro: Sunt nou cu toate lucrurile care au de a face cu vrăjitorul. Despre ce vorbea?

# Dialogue_AARaven0
source: So we let those keys behind and set ourselves free from wizards?
ro: Așadar, lăsăm acele chei în urmă și ne eliberăm de vrăjitori?

# Dialogue_AARaven0
source: A pleasure to hear that. Talk to Raven about the details. Please excuse me for leaving so early, I have something important to do.
ro: O plăcere să aud asta. Vorbește cu Corbul despre detalii. Te rog să mă scuzi că plec atât de devreme, am ceva important de făcut.

# Dialogue_AARaven0
source: Raven knows he has different tasks now, compared to what he used to do before.
ro: Corbul știe că are sarcini diferite acum, în comparație cu ce făcea înainte.

# Dialogue_AARaven0
source: Go now! Raven still needs some more time to think about this.
ro: Mergi acum! Corbul mai are nevoie de mai mult timp pentru a se gândi la acest lucru.

# Dialogue_AARaven0
source: They were always like this.
ro: Au fost mereu așa.

# Dialogue_AARaven0
source: The Cerulean Gates are closed again. What if we share the work?
ro: Porțile Cerulean sunt închise din nou. Ce se întâmplă dacă împărtășim munca?

# Dialogue_AARaven0
source: Yes! The Gem is fully charged!
ro: Da! Bijuteria este încărcată complet!

# Dialogue_AARaven0
source: Why are you obeying that wizard of yours?
ro: De ce te supui Vrăjitorului tău?

# Dialogue_AARaven0
source: Raven is not that happy with those two, but Raven can accept that he is what he is.
ro: Raven nu este atât de fericit cu cei doi, dar Raven poate accepta că el este ceea ce este.

# Dialogue_AARaven0
source: Don't worry. You'll find some purpose.
ro: Nu-ți face griji. Vei găsi un scop.

# Dialogue_AARaven0
source: The residents of the Realm did not have to work. Their spirit slaves did everything for them, they accomplished all their desires.
ro: Locuitorii de pe tărâm nu trebuiau să muncească. Sclavii lor spirituali au făcut totul pentru ei, și-au îndeplinit toate dorințele.

# Dialogue_AARaven0
source: Raven thinks you might want to be something else. Something that you used to be, but you are not anymore.
ro: Corbul crede că poate vrei să fii altceva. Ceva ce ai fost, dar nu mai ești.

# Dialogue_AARaven0
source: Except...
ro: Cu excepția..

# Dialogue_AARaven0
source: It is a long story and Raven doesn't really like to talk about it.
ro: Este o poveste lungă și Corbului nu-i place foarte mult să vorbească despre asta.

# Dialogue_AARaven0
source: Leave
ro: Pleacă

# Dialogue_AARaven0
source: Raven is fine with talking. Ask me whatever you have on your mind!
ro: Corbului este în regulă cu vorbele. Întreabă-mă orice ai în minte!
